#pragma once

namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x128 (0x158 - 0x30)
// Class ReadyOrNot.AchievementSubsystem
class UAchievementSubsystem : public UGameInstanceSubsystem
{
public:
	uint8                                        Pad_1154[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EAchievementStats, struct FUniversalStat> AchievementStats;                                  // 0x38(0x50)(Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1157[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSet<class ABaseItem*>                       UsedItemsInCurrentMission;                         // 0x98(0x50)(NativeAccessSpecifierPrivate)
	uint8                                        Pad_1159[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class ULocalAchievements*                    LocalAchievements;                                 // 0x138(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class URequestStatsAndAchievements*          RequestStatAndAchievements;                        // 0x140(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStoreStatsAndAchievements*            StoreStatsAndAchievements;                         // 0x148(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UIndicateAchievementProgress*          UserAchievementProgress;                           // 0x150(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAchievementSubsystem* GetDefaultObj();

	void UserAchievementProgressSuccess(int32 SteamErrorOutput);
	void UserAchievementProgressFailure(int32 SteamErrorOutput);
	void UsedItem(class ABaseItem* Item);
	void StoreStatsAndAchievementsSuccess(int32 SteamErrorOutput);
	void StoreStatsAndAchievementsFailure(int32 SteamErrorOutput);
	void QueryAchievementsAndStatsSuccess(int32 SteamErrorOutput);
	void QueryAchievementsAndStatsFailure(int32 SteamErrorOutput);
	void IndicateUserAchievementProgress(enum class EAchievement Achievement, int32 Progress, int32 MaxProgress);
	bool HasOnlyUsedItems(const TArray<enum class EItemCategory>& Categories);
	void EndMission(class UObject* WorldContextObject);
	void BeginMission();
};

// 0x0 (0x28 - 0x28)
// Class ReadyOrNot.AchievementStatics
class UAchievementStatics : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAchievementStatics* GetDefaultObj();

};

// 0x60 (0x88 - 0x28)
// Class ReadyOrNot.LocalAchievements
class ULocalAchievements : public USaveGame
{
public:
	TMap<enum class EAchievementStats, struct FUniversalStat> Stats;                                             // 0x28(0x50)(NativeAccessSpecifierPrivate)
	TArray<enum class EAchievement>              Achievements;                                      // 0x78(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ULocalAchievements* GetDefaultObj();

};

// 0x18 (0x338 - 0x320)
// Class ReadyOrNot.ActivatableBaseWidget
class UActivatableBaseWidget : public UCommonActivatableWidget
{
public:
	struct FVector2D                             MouseAxisDeltaThreshold;                           // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                             GamepadAxisDeltaThreshold;                         // 0x328(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AReadyOrNotGameState*                  RONGS;                                             // 0x330(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UActivatableBaseWidget* GetDefaultObj();

	bool UpdateDebugInfo();
	void ToggleWidgetVisibility(bool bNotHitTestable);
	void StopWidgetAnimation_Internal(class UWidgetAnimation* InWidgetAnimation);
	void ShowWidget(bool bNotHitTestable);
	void PlayWidgetAnimation_Internal(class UWidgetAnimation* InWidgetAnimation, bool bRestartIfAlreadyPlaying);
	void PlaySoundEffect(class UFMODEvent* SoundEffectToPlay);
	void PauseWidgetAnimation_Internal(class UWidgetAnimation* InWidgetAnimation);
	bool IsMouseAxisBeyondThreshold(struct FVector2D& InMouseDelta);
	bool IsGamepadAxisBeyondThreshold(struct FVector2D& InGamepadAxis);
	bool IsBlockingAnimationPlaying();
	void HideWidget();
	bool HasMouseMoved();
	struct FVector2D GetMousePosition();
	struct FVector2D GetMouseDelta();
	struct FVector2D GetCenterScreenPosition();
};

// 0xF8 (0x128 - 0x30)
// Class ReadyOrNot.ActivityData
class UActivityData : public UDataAsset
{
public:
	enum class EActivity                         Activity;                                          // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1259[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSwatCommandData                      SwatCommandData;                                   // 0x38(0x38)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTutorialWidgetData                   WidgetData;                                        // 0x70(0x78)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        ActionsRequired;                                   // 0xE8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeRequired;                                      // 0xEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnComplete;                                        // 0xF0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class APlayerCharacter*                      PlayerCharacter;                                   // 0x100(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_125C[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AReadyOrNotCharacter*>          CharactersKilled;                                  // 0x118(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UActivityData* GetDefaultObj();

	void OnWeaponTacticalReload(class APlayerCharacter* DelegatePlayerCharacter);
	void OnWeaponSwitchAmmoType(class APlayerCharacter* DelegatePlayerCharacter);
	void OnWeaponReload(class APlayerCharacter* DelegatePlayerCharacter);
	void OnWeaponFireModeChanged(class APlayerCharacter* DelegatePlayerCharacter, enum class EFireMode NewFireMode, enum class EFireMode LastFireMode);
	void OnWeaponFire(class AReadyOrNotCharacter* Character, class ABaseMagazineWeapon* Weapon, const struct FVector& FireDirection);
	void OnTeamViewSet(class AReadyOrNotCharacter* NewViewCharacter);
	void OnTargetHit(class ATrainingTarget* Target);
	void OnSwatElementChanged(enum class ETeamType TeamType);
	void OnSwatCommandQueued(const struct FQueuedSwatCommand& QueuedSwatCommand, enum class ETeamType TeamType);
	void OnSwatCommandIssued(enum class ESwatCommand SwatCommand, enum class ETeamType TeamType, class AActor* ContextActor);
	void OnNightVisionGogglesToggled(class AReadyOrNotCharacter* Character, bool bOn);
	void OnItemUseStart(class ABaseItem* Item);
	void OnItemUseCompleted(class ABaseItem* Item);
	void OnItemEquipped(class ABaseItem* Item);
	void OnInteract(class UInteractableComponent* InteractableComponent);
	void OnExfiltrateMission();
	void OnEvidenceCollected(class AActor* Evidence);
	void OnDoorKicked(class ADoor* Door, class AReadyOrNotCharacter* InstigatorCharacter, bool bSuccess);
	void OnChemlightThrown(class APlayerCharacter* DelegatePlayerCharacter);
	void OnCharacterMovementUpdated(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void OnCharacterKilled(class AReadyOrNotCharacter* Character, class AReadyOrNotCharacter* KilledBy);
	void OnCharacterArrested(class AReadyOrNotCharacter* Character, class AReadyOrNotCharacter* ArrestedBy);
	void OnCantedSightToggled(bool bUsingCantedSight);
	void OnAttachmentLightToggled();
	bool IsComplete();
	void CompleteActivity();
};

// 0x70 (0x98 - 0x28)
// Class ReadyOrNot.ActivityState
class UActivityState : public UObject
{
public:
	uint8                                        Pad_1290[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x58(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ID;                                                // 0x68(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Uptime;                                            // 0x6C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActivityFiniteStateMachine*           StateMachineOwner;                                 // 0x70(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FActivityStateTransition>      StateTransitions;                                  // 0x78(0x10)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1295[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActivityState* GetDefaultObj();

	class UActivityState* RemoveTransitionByName(const class FString& InName);
	class UActivityState* RemoveTransitionByID(int32 InID);
	TArray<struct FActivityStateTransition> GetTransitions();
	class UActivityState* CreateTransition(struct FActivityStateTransition& InStateTransition);
};

// 0x20 (0x48 - 0x28)
// Class ReadyOrNot.ActivityFiniteStateMachine
class UActivityFiniteStateMachine : public UObject
{
public:
	TArray<class UActivityState*>                States;                                            // 0x28(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, NativeAccessSpecifierPrivate)
	class UActivityState*                        ActiveState;                                       // 0x38(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bMachineInitialized : 1;                           // Mask: 0x1, PropSize: 0x10x40(0x1)(Edit, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12DB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActivityFiniteStateMachine* GetDefaultObj();

	bool IsMachineInitialized();
	class UActivityState* GetStateByName(const class FString& InStateName);
	class UActivityState* GetStateByID(int32 InStateID);
	class UActivityState* GetActiveState();
	class UActivityState* AddState(const class FString& NewStateName, const TArray<struct FActivityStateTransition>& Transitions);
};

// 0x70 (0xB0 - 0x40)
// Class ReadyOrNot.ActivityManager
class UActivityManager : public UTickableWorldSubsystem
{
public:
	FMulticastInlineDelegateProperty_            OnStartActivity;                                   // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UBaseActivity*>                 AllActivities;                                     // 0x50(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<TSubclassOf<class UBaseActivity>, float> ActivityClassGlobalCooldownMap;                    // 0x60(0x50)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActivityManager* GetDefaultObj();

	void OnStartActivity__DelegateSignature(class UBaseActivity* Activity, class ACyberneticController* Controller);
	bool IsActivityClassOnCooldown_WithTimeRemaining(TSubclassOf<class UBaseActivity> Class, float* TimeRemaining);
	bool IsActivityClassOnCooldown(TSubclassOf<class UBaseActivity> Class);
	bool GiveActivityTo(class UBaseActivity* InActivity, class ACyberneticCharacter* InCharacter, bool bOverrideCurrentActivity, bool bClearActivityList);
	class UBaseActivity* CreateActivity(class UObject* ContextObject, TSubclassOf<class UBaseActivity> InActivityClass, const class FString& InActivityName, float InActivityStartDelay);
};

// 0xB0 (0x2D8 - 0x228)
// Class ReadyOrNot.ActivityTriggerVolume
class AActivityTriggerVolume : public ATriggerBox
{
public:
	TArray<struct FActivityEvent>                ActivationEvents;                                  // 0x228(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FActivityEvent>                OnEnterEvents;                                     // 0x238(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UActivityData*>                 Activities;                                        // 0x248(0x10)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FActivityEvent>                OnLeaveEvents;                                     // 0x258(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FActivityEvent>                CompletionEvents;                                  // 0x268(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class AActivityTriggerVolume> NextTransitionVolume;                              // 0x278(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TransitionDelay;                                   // 0x2A0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bStartActive;                                      // 0x2A4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_133A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ActivityDelay;                                     // 0x2A8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bTriggerEventsWhileInactive;                       // 0x2AC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bDrawDebug;                                        // 0x2AD(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_133B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APlayerCharacter*                      PlayerCharacter;                                   // 0x2B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                          ActivateDelayTimerHandle;                          // 0x2B8(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_133E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnAllActivitiesComplete;                           // 0x2C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AActivityTriggerVolume* GetDefaultObj();

	void ResetAllProgress();
	void Reactivate(float ReactivateDelay);
	void OnSpawnedAiKilled(class AReadyOrNotCharacter* InstigatorCharacter, class AReadyOrNotCharacter* KilledCharacter);
	void OnPlayerEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnPlayerBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnActivityComplete(class UActivityData* Activity);
	bool IsActive();
	TArray<class UActivityData*> GetActivities();
	void Deactivate();
	bool AllActivitiesComplete();
	void Activate();
};

// 0x18 (0x238 - 0x220)
// Class ReadyOrNot.ActorSpawnPoint
class AActorSpawnPoint : public AActor
{
public:
	class USceneComponent*                       SceneComponent;                                    // 0x220(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBillboardComponent*                   BillboardComponent;                                // 0x228(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHasVisited : 1;                                   // Mask: 0x1, PropSize: 0x10x230(0x1)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1343[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AActorSpawnPoint* GetDefaultObj();

};

// 0x0 (0x260 - 0x260)
// Class ReadyOrNot.AdminGameControls
class UAdminGameControls : public UUserWidget
{
public:

	static class UClass* StaticClass();
	static class UAdminGameControls* GetDefaultObj();

	void KickPlayer(class APlayerState* KickingPlayerState, class FText Reason);
	bool IsAdmin();
	void GetKickablePlayers(TArray<class APlayerState*>* KickablePlayers);
};

// 0x30 (0x58 - 0x28)
// Class ReadyOrNot.AIAction
class UAIAction : public UObject
{
public:
	uint8                                        Pad_13A7[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          Tags;                                              // 0x30(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class ACyberneticController*                 OwningController;                                  // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13AB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        LastMoveRequestPathID;                             // 0x4C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        LastMoveRequestMoveID;                             // 0x50(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13AD[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAction* GetDefaultObj();

	bool WantsAbort();
	void Tick_Blueprint(float DeltaTime);
	bool ShouldPerformAction();
	void RequestMove(const struct FVector& Location, float AcceptanceRadius);
	void OnTakenDamage_Blueprint(float Damage, class AReadyOrNotCharacter* Instigator);
	void OnSucceededToConsider_Blueprint();
	void OnPathFound_Blueprint(int32 PathId, enum class ERonNavigationQueryResult Result);
	void OnPathFound(int32 PathId, enum class ERonNavigationQueryResult Result);
	void OnMoveComplete_Blueprint(class AAIController* Controller, int32 RequestID);
	void OnMoveComplete(class AAIController* Controller, int32 RequestID);
	void OnFailedToConsider_Blueprint();
	void OnCreate_Blueprint(class ACyberneticController* Controller);
	void InitAction_Blueprint(class ACyberneticController* Controller);
	bool HasTag(class FName Tag);
	class FName GetMoveStyleOverride();
	class ACyberneticCharacter* GetCharacter();
	int32 GetActionRunCount();
	struct FAIActionData GetActionData();
	class FString GatherDebugInfo();
	void EndAction_Blueprint();
	void BeginAction_Blueprint();
	void AbortAction();
};

// 0xB0 (0xD8 - 0x28)
// Class ReadyOrNot.AIActionConsideration
class UAIActionConsideration : public UObject
{
public:
	uint8                                        bManualCurveEdit : 1;                              // Mask: 0x1, PropSize: 0x10x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCustomCurveFunction : 1;                          // Mask: 0x2, PropSize: 0x10x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_CB : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class EEasingFunc                       CurveType;                                         // 0x29(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bInverseX : 1;                                     // Mask: 0x1, PropSize: 0x10x2A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bInverseY : 1;                                     // Mask: 0x2, PropSize: 0x10x2A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bClamp : 1;                                        // Mask: 0x4, PropSize: 0x10x2A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_CC : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_13C8[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    Curve;                                             // 0x30(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                        bCustomRange : 1;                                  // Mask: 0x1, PropSize: 0x10xB8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_CD : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_13CA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinRange;                                          // 0xBC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxRange;                                          // 0xC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        OffsetX;                                           // 0xC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        OffsetY;                                           // 0xC8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        Exponent;                                          // 0xCC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        SubStep;                                           // 0xD0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ERichCurveInterpMode              InterpMode;                                        // 0xD4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ERichCurveTangentMode             TangentMode;                                       // 0xD5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13CE[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIActionConsideration* GetDefaultObj();

	float Score(struct FAIActionDecisionContext& Context, bool* bSuccess);
	float EvaluateResponseCurve(float Score);
	float CalculateCurve(float X);
};

// 0x10 (0xE8 - 0xD8)
// Class ReadyOrNot.ACNumberOfNearbyAI
class UACNumberOfNearbyAI : public UAIActionConsideration
{
public:
	enum class ETeamType                         TeamType;                                          // 0xD8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13D2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SearchRange;                                       // 0xDC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bMustBeVisible;                                    // 0xE0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13D3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UACNumberOfNearbyAI* GetDefaultObj();

};

// 0x0 (0xD8 - 0xD8)
// Class ReadyOrNot.AC_Health
class UAC_Health : public UAIActionConsideration
{
public:

	static class UClass* StaticClass();
	static class UAC_Health* GetDefaultObj();

};

// 0x0 (0xD8 - 0xD8)
// Class ReadyOrNot.AC_TargetHealth
class UAC_TargetHealth : public UAIActionConsideration
{
public:

	static class UClass* StaticClass();
	static class UAC_TargetHealth* GetDefaultObj();

};

// 0x0 (0xD8 - 0xD8)
// Class ReadyOrNot.AC_IncapacitationHealth
class UAC_IncapacitationHealth : public UAIActionConsideration
{
public:

	static class UClass* StaticClass();
	static class UAC_IncapacitationHealth* GetDefaultObj();

};

// 0x0 (0xD8 - 0xD8)
// Class ReadyOrNot.AC_Ammo
class UAC_Ammo : public UAIActionConsideration
{
public:

	static class UClass* StaticClass();
	static class UAC_Ammo* GetDefaultObj();

};

// 0x0 (0xD8 - 0xD8)
// Class ReadyOrNot.AC_Armor
class UAC_Armor : public UAIActionConsideration
{
public:

	static class UClass* StaticClass();
	static class UAC_Armor* GetDefaultObj();

};

// 0x0 (0xD8 - 0xD8)
// Class ReadyOrNot.AC_Morale
class UAC_Morale : public UAIActionConsideration
{
public:

	static class UClass* StaticClass();
	static class UAC_Morale* GetDefaultObj();

};

// 0x0 (0xD8 - 0xD8)
// Class ReadyOrNot.AC_Stress
class UAC_Stress : public UAIActionConsideration
{
public:

	static class UClass* StaticClass();
	static class UAC_Stress* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class ReadyOrNot.AIActionGate
class UAIActionGate : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAIActionGate* GetDefaultObj();

	bool CanOpen(struct FAIActionDecisionContext& Context);
};

// 0x8 (0x30 - 0x28)
// Class ReadyOrNot.AGValidTarget
class UAGValidTarget : public UAIActionGate
{
public:
	bool                                         bAllowFriendly;                                    // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowEnemy;                                       // 0x29(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowNeutral;                                     // 0x2A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowLastTrackedTarget;                           // 0x2B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13ED[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAGValidTarget* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class ReadyOrNot.AGAnyNearbyAI
class UAGAnyNearbyAI : public UAIActionGate
{
public:
	enum class ETeamType                         TeamType;                                          // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13EE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SearchRange;                                       // 0x2C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMustBeVisible;                                    // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13F0[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAGAnyNearbyAI* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class ReadyOrNot.AGNumActiveAI
class UAGNumActiveAI : public UAIActionGate
{
public:
	enum class ETeamType                         Team;                                              // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        NumAI;                                             // 0x29(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EComparisonOp                     ComparisonType;                                    // 0x2A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13F3[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAGNumActiveAI* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class ReadyOrNot.AG_HasEquippedItem
class UAG_HasEquippedItem : public UAIActionGate
{
public:

	static class UClass* StaticClass();
	static class UAG_HasEquippedItem* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class ReadyOrNot.AG_HasEquippedWeapon
class UAG_HasEquippedWeapon : public UAIActionGate
{
public:

	static class UClass* StaticClass();
	static class UAG_HasEquippedWeapon* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class ReadyOrNot.AG_IsSurrendered
class UAG_IsSurrendered : public UAIActionGate
{
public:
	float                                        Time;                                              // 0x28(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13F9[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAG_IsSurrendered* GetDefaultObj();

};

// 0x2D0 (0x300 - 0x30)
// Class ReadyOrNot.AIActionPresetData
class UAIActionPresetData : public UDataAsset
{
public:
	struct FAIActionData                         Action;                                            // 0x30(0x2D0)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIActionPresetData* GetDefaultObj();

};

// 0x100 (0x130 - 0x30)
// Class ReadyOrNot.AIArchetypeData
class UAIArchetypeData : public UDataAsset
{
public:
	class FString                                Name;                                              // 0x30(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableAlertActions : 1;                           // Mask: 0x1, PropSize: 0x10x40(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D0 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1402[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAIActionDataContainer>        AlertActions;                                      // 0x48(0x10)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        bEnableUnalertActions : 1;                         // Mask: 0x1, PropSize: 0x10x58(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D1 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1403[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAIActionDataContainer>        UnalertActions;                                    // 0x60(0x10)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        bEnableSuspiciousActions : 1;                      // Mask: 0x1, PropSize: 0x10x70(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D2 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1404[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAIActionDataContainer>        SuspiciousActions;                                 // 0x78(0x10)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        bEnableContinuousActions : 1;                      // Mask: 0x1, PropSize: 0x10x88(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D3 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1405[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAIActionData_NameOnly>        ContinuousActions;                                 // 0x90(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAIActionDataContainer>        ContinuousActionsCache;                            // 0xA0(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        bEnableCombatMoveActions : 1;                      // Mask: 0x1, PropSize: 0x10xB0(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D4 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1406[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAIActionDataContainer>        CombatMoveActions;                                 // 0xB8(0x10)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        bEnableTraitActions : 1;                           // Mask: 0x1, PropSize: 0x10xC8(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D5 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1407[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAITraitActionData>            TraitActions;                                      // 0xD0(0x10)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        bOverrideAimSettings : 1;                          // Mask: 0x1, PropSize: 0x10xE0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D6 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1409[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FocalPointInterpSpeed;                             // 0xE4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAlphaBlendOption                 FocalPointInterpCurve;                             // 0xE8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_140A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FocusTurnSpeed;                                    // 0xEC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TurnDegreesPerSecond;                              // 0xF0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActorRotationInterpStandingSpeed;                  // 0xF4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActorRotationInterpMovingSpeed;                    // 0xF8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AimOffsetInterpSpeed;                              // 0xFC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreDamageHitReactions : 1;                     // Mask: 0x1, PropSize: 0x10x100(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D7 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_140D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EAIAwarenessState>         AllowCombatMoveInState;                            // 0x108(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        bSuppressionRequiresLOSOnLastKnownEnemyPosition : 1; // Mask: 0x1, PropSize: 0x10x118(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAccuracyOverride : 1;                             // Mask: 0x2, PropSize: 0x10x118(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D8 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1410[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Accuracy;                                          // 0x11C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMoraleOverride : 1;                               // Mask: 0x1, PropSize: 0x10x120(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_D9 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1412[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinMorale;                                         // 0x124(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxMorale;                                         // 0x128(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisableVO : 1;                                    // Mask: 0x1, PropSize: 0x10x12C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1413[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIArchetypeData* GetDefaultObj();

};

// 0x30 (0x290 - 0x260)
// Class ReadyOrNot.AICombatMovesWidget
class UAICombatMovesWidget : public UUserWidget
{
public:
	class UVerticalBox*                          CombatMoves_VerticalBox;                           // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                            AIName_TextBlock;                                  // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                               NextAI_Button;                                     // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACyberneticCharacter*                  CurrentAI;                                         // 0x278(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAICombatMovesWidgetEntry> WidgetEntryClass;                                  // 0x280(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>               AIWorldWidgetClass;                                // 0x288(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAICombatMovesWidget* GetDefaultObj();

	void SetAIToFocus(class ACyberneticCharacter* CyberneticCharacter);
	void OnNextAIButtonClicked();
};

// 0x20 (0x280 - 0x260)
// Class ReadyOrNot.AICombatMovesWidgetEntry
class UAICombatMovesWidgetEntry : public UUserWidget
{
public:
	class UTextBlock*                            CombatAction_TextBlock;                            // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            SuccessfulConsiderations_TextBlock;                // 0x268(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            FailedConsiderations_TextBlock;                    // 0x270(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            RunTime_TextBlock;                                 // 0x278(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAICombatMovesWidgetEntry* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class ReadyOrNot.AIData
class UAIData : public UDataAsset
{
public:

	static class UClass* StaticClass();
	static class UAIData* GetDefaultObj();

};

// 0x58 (0x278 - 0x220)
// Class ReadyOrNot.AIFactionManager
class AAIFactionManager : public AActor
{
public:
	uint8                                        bGroupIntoTeams : 1;                               // Mask: 0x1, PropSize: 0x10x220(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_DC : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1463[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TeamsOf;                                           // 0x224(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAssignRandomTeamTactics : 1;                      // Mask: 0x1, PropSize: 0x10x228(0x1)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_DD : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1464[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFactionTeamTactics>           TacticsPool;                                       // 0x230(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FFactionSuspectTeam>           SuspectTeams;                                      // 0x240(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class ACyberneticCharacter*>          Characters;                                        // 0x250(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class ACyberneticCharacter*>          Leaders;                                           // 0x260(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, Protected, NativeAccessSpecifierProtected)
	float                                        TeamBehaviourStrengthReductionSpeed;               // 0x270(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TeamBehaviourOverrideStrength;                     // 0x274(0x4)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AAIFactionManager* GetDefaultObj();

	void OnAllAISpawned_Blueprint();
	void OnAISpottedNeutral_Blueprint(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Neutral);
	void OnAISpottedNeutral(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Neutral);
	void OnAISpottedFriendly_Blueprint(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Friendly);
	void OnAISpottedFriendly(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Friendly);
	void OnAISpottedEnemy_Blueprint(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Enemy);
	void OnAISpottedEnemy(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Enemy);
	void OnAIAdded_Blueprint(class ACyberneticCharacter* Character);
	bool IsTeamFull(struct FFactionSuspectTeam& InTeam);
	bool IsSuspectInTeam(class ASuspectCharacter* InSuspect, struct FFactionSuspectTeam* OutTeam);
	bool GetTeamTacticFor(class ASuspectCharacter* InSuspect, enum class EAITeamTactic* OutTactic);
	int32 GetTeamIndex(class ASuspectCharacter* InSuspect);
	bool GetSuspectsInTeam(class ASuspectCharacter* InSuspect, TArray<class ASuspectCharacter*>* OutSuspects, bool bIncludeSelf);
	TArray<class ASuspectCharacter*> GetAllSuspects();
	TArray<class ACyberneticCharacter*> GetAllLeaders();
	TArray<class ACivilianCharacter*> GetAllCivilians();
	TArray<class ACyberneticCharacter*> GetAllCharacters();
	class ASuspectCharacter* FindClosestSuspect(TArray<class ASuspectCharacter*>& OtherSuspects, class ASuspectCharacter* Suspect, float MaxDistance);
	bool AreTeamSpotsAvailable(int32* OutIndex);
	void AlertOtherSuspectsInTeam_Blueprint(class ASuspectCharacter* Suspect, class AReadyOrNotCharacter* Enemy);
};

// 0x8 (0x268 - 0x260)
// Class ReadyOrNot.AISelectionDebugWidget
class UAISelectionDebugWidget : public UUserWidget
{
public:
	class UTextBlock*                            AIName_TextBlock;                                  // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAISelectionDebugWidget* GetDefaultObj();

};

// 0xD0 (0x2F0 - 0x220)
// Class ReadyOrNot.AISpawn
class AAISpawn : public AActor
{
public:
	uint8                                        bEnabled : 1;                                      // Mask: 0x1, PropSize: 0x10x220(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_DE : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	bool                                         bAllowExplosiveVestSpawn;                          // 0x221(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_146A[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SpawnChance;                                       // 0x224(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        GroupID;                                           // 0x228(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_146B[0x8F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSpawnData>                    SpawnArray;                                        // 0x2B8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TSubclassOf<class ABaseWeapon>               GlobalWeaponOverride;                              // 0x2C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIArchetypeData*                      ArchetypeOverride;                                 // 0x2D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACyberneticCharacter*                  SpawnedCharacter;                                  // 0x2D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                       DefaultScene;                                      // 0x2E0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UArrowComponent*                       SpawnDirection;                                    // 0x2E8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AAISpawn* GetDefaultObj();

	enum class ETeamType GetSpawningTeamType(struct FSpawnData& Sd);
	bool DoSpawn();
};

// 0x58 (0x108 - 0xB0)
// Class ReadyOrNot.ResourceComponent
class UResourceComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnFullResource;                                    // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnLowResource;                                     // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDepletedResource;                                // 0xD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FName                                  ResourceName;                                      // 0xE0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        Resource;                                          // 0xE8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxResource;                                       // 0xEC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxResourceLimit;                                  // 0xF0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LowResourceThreshold;                              // 0xF4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        OriginalMaxResource;                               // 0xF8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LowResource;                                       // 0xFC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PreviousResource;                                  // 0x100(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUnlimited : 1;                                    // Mask: 0x1, PropSize: 0x10x104(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14A3[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UResourceComponent* GetDefaultObj();

	void UpdatePreviousResource();
	void ToggleUnlimitedResource();
	void SetUnlimitedResource(bool bEnabled);
	void SetResource(float NewResourceAmount);
	void SetMaxResource(float NewMaxResource);
	void SetCurrentResourceToMax();
	void Server_UpdatePreviousResource();
	void Server_ToggleUnlimitedResource();
	void Server_SetUnlimitedResource(bool bEnabled);
	void Server_SetResource(float NewResourceAmount);
	void Server_SetMaxResource(float NewMaxResource);
	void Server_SetCurrentResourceToMax();
	void Server_ResetResource();
	void Server_InitResource();
	void Server_IncreaseResource(float Amount);
	void Server_EnableUnlimitedResource();
	void Server_DisableUnlimitedResource();
	void Server_DepleteResource();
	void Server_DecreaseResource(float Amount);
	void ResetResource();
	void OnLowResourceSignature__DelegateSignature(float Resource);
	void OnFullResourceSignature__DelegateSignature();
	void OnDepletedResourceSignature__DelegateSignature();
	bool IsUnlimitedResourceEnabled();
	bool IsResourceBelow(float ResourceValue);
	bool IsResourceAtOrBelow(float ResourceValue);
	bool IsResourceAtOrAbove(float ResourceValue);
	bool IsResourceAt(float ResourceValue);
	bool IsResourceAbove(float ResourceValue);
	bool IsLowResource();
	bool IsHalfResource();
	bool IsFullResource();
	bool IsDepleted();
	void IncreaseResourceByRate(float Rate);
	float IncreaseResource_Expression(float Amount);
	void IncreaseResource(float Amount);
	bool HasResource();
	class FName GetResourceName();
	float GetPreviousResource();
	float GetOriginalMaxResource();
	float GetNormalizedResource();
	float GetMaxResource();
	float GetLowResourceThreshold();
	float GetLowResource();
	float GetHalfResource();
	float GetCurrentResource();
	void EnableUnlimitedResource();
	void DisableUnlimitedResource();
	void DepleteResource();
	void DecreaseResourceByRate(float Rate);
	float DecreaseResource_Expression(float Amount);
	void DecreaseResource(float Amount);
};

// 0x8 (0x110 - 0x108)
// Class ReadyOrNot.AmmoComponent
class UAmmoComponent : public UResourceComponent
{
public:
	float                                        AmmoUsagePerSecond;                                // 0x108(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14AB[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAmmoComponent* GetDefaultObj();

	float GetAmmoUsagePerSecond();
};

// 0x38 (0x258 - 0x220)
// Class ReadyOrNot.AmmoRefillBox
class AAmmoRefillBox : public AActor
{
public:
	uint8                                        Pad_14AD[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UInteractableComponent*                InteractableComponent;                             // 0x228(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_14AE[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AReadyOrNotCharacter*                  RefillCharacter;                                   // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14AF[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAmmoRefillBox* GetDefaultObj();

};

// 0x98 (0x2B8 - 0x220)
// Class ReadyOrNot.AnimatedDecal
class AAnimatedDecal : public AActor
{
public:
	class UDecalComponent*                       Decal;                                             // 0x220(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnimationTimescale;                                // 0x228(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14B2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    AnimationCurve;                                    // 0x230(0x88)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AAnimatedDecal* GetDefaultObj();

	void SetAnimatedDecalMaterial(class UMaterialInterface* Material);
	float GetRuntimeFloatCurveValue(struct FRuntimeFloatCurve& Curve, float Time);
};

// 0x100 (0x360 - 0x260)
// Class ReadyOrNot.AnimatedIconWidget
class UAnimatedIconWidget : public UUserWidget
{
public:
	TArray<class UImage*>                        IconImages;                                        // 0x260(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                        CurrentIndex;                                      // 0x270(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ElapsedTime;                                       // 0x274(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPaused : 1;                                       // Mask: 0x1, PropSize: 0x10x278(0x1)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_E3 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_14BB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UOverlay*                              InteractCircle_Overlay;                            // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USizeBox*                              InteractIcon_SizeBox;                              // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetSwitcher*                       IconSwitcher;                                      // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Frame_1;                                           // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Frame_2;                                           // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Frame_3;                                           // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Frame_4;                                           // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Frame_5;                                           // 0x2B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Frame_6;                                           // 0x2C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Frame_7;                                           // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                Frame_8;                                           // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                FrameImages[0x8];                                  // 0x2D8(0x40)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                ProgressCircle_Image;                              // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      Anim_Interact;                                     // 0x320(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      Anim_Focus;                                        // 0x328(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FLinearColor                          InteractionInvalidTintColor;                       // 0x330(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    ProgressCircleMaterial;                            // 0x340(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ProgressParamName;                                 // 0x348(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInteractableComponent*                ParentComponent;                                   // 0x350(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*              MID_ProgressCircle;                                // 0x358(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimatedIconWidget* GetDefaultObj();

	void UnPauseIconAnim();
	void StopInteractAnim();
	void StopFocusAnim();
	void SetInteractState(bool bValid);
	void SetInteractIconSize(float InInteractCircleSize, float InInteractIconSize);
	void SetCurrentProgress(float Percent);
	void SetActiveIcon(int32 Index);
	void PlayInteractAnim();
	void PlayFocusAnim(bool bReverse);
	void PauseIconAnim();
};

// 0x10 (0x270 - 0x260)
// Class ReadyOrNot.AnimatedIconWidget_Imprint
class UAnimatedIconWidget_Imprint : public UUserWidget
{
public:
	class UImage*                                Icon_Image;                                        // 0x260(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                      ImprintAnimation;                                  // 0x268(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimatedIconWidget_Imprint* GetDefaultObj();

	void SetIconImage(class UTexture2D* NewIconImage);
	void Init(const struct FVector& InWorldLocation, class UTexture2D* InIconImage);
};

// 0x40 (0x3A0 - 0x360)
// Class ReadyOrNot.AnimatedIconWidgetWithActionPrompt
class UAnimatedIconWidgetWithActionPrompt : public UAnimatedIconWidget
{
public:
	class UVerticalBox*                          VerticalBox;                                       // 0x360(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOverlay*                              InteractIcon_Overlay;                              // 0x368(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UScaleBox*                             PlayerActionPrompt_ScaleBox;                       // 0x370(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayerActionPromptWidget*             PlayerActionPrompt_Widget;                         // 0x378(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayerActionPromptWidget*             PlayerActionPrompt_Widget2;                        // 0x380(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayerActionPromptWidget*             PlayerActionPrompt_Widget3;                        // 0x388(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayerActionPromptWidget*             PlayerActionPrompt_Widget4;                        // 0x390(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                ActionPromptBackground_Image;                      // 0x398(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimatedIconWidgetWithActionPrompt* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class ReadyOrNot.AnimCharacterMovementLibrary
class UAnimCharacterMovementLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAnimCharacterMovementLibrary* GetDefaultObj();

	void UpdateCharacterMovementSnapshot(struct FTransform& WorldTransform, struct FVector& WorldVelocity, struct FVector& WorldAcceleration, bool bIsOnGround, float RootYawOffset, struct FAnimCharacterMovementSnapshot& Snapshot);
	class UAnimSequence* SelectAnimForCardinalDirection(enum class EAnimCardinalDirection CardinalDirection, struct FCardinalDirectionAnimSet& AnimSet);
	struct FVector PredictGroundMovementStopLocation(struct FAnimCharacterMovementSnapshot& MovementSnapshot, struct FAnimCharacterMovementPredictionSnapshot& PredictionSnapshot);
	struct FVector PredictGroundMovementPivotLocation(struct FAnimCharacterMovementSnapshot& MovementSnapshot, float GroundFriction);
	enum class EAnimCardinalDirection GetCardinalDirectionFromAngle(enum class EAnimCardinalDirection PreviousCardinalDirection, float DirectionAngleInDegrees, float DeadZoneAngle);
	float CalculateDirAngle(const struct FVector& CurVel, const struct FRotator& CurActorRotation, const struct FRotator& DirRotation, float ClampMin, float ClampMax, float CurDirAngle);
};

// 0x0 (0x28 - 0x28)
// Class ReadyOrNot.AnimDistanceMatchingLibrary
class UAnimDistanceMatchingLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAnimDistanceMatchingLibrary* GetDefaultObj();

	void CalculateDistanceMatchingStates(float DeltaTime, class ACharacter* CurrentCharacter, class UCharacterMovementComponent* CurrentMovementComponent, enum class EDistanceMatchingType* DistanceMatchingCurrentState, struct FAnimCharacterMovementSnapshot& MovementSnapshot, struct FAnimCharacterMovementPredictionSnapshot& PredictionSnapshot, class UWorld* TargetWorld, float MinPivotAngle, const TArray<class AActor*>& ActorsToIgnore, struct FVector* LastActorLocation, struct FCardinalDirectionSnapshot* PivotingCardinalDirSnapShot, struct FPredictionResult* StartMarker, struct FPredictionResult* StopMarker, struct FPredictionResult* PivotMarker, struct FPredictionResult* TakeOffMarker, struct FPredictionResult* ApexMarker, struct FPredictionResult* LandingMarker, bool* bSMStartRuleset, bool* bSMStopRuleset, bool bIsAICharacter, bool bShowDebug);
};

// 0x0 (0x28 - 0x28)
// Class ReadyOrNot.AnimInputCapsuleLocomotionBlueprintLibrary
class UAnimInputCapsuleLocomotionBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAnimInputCapsuleLocomotionBlueprintLibrary* GetDefaultObj();

	void UpdateCapsuleLocomotionAnimInput(class APawn* Pawn, struct FAnimInput_CapsuleLocomotion& CapsuleLocomotionAnimInput);
};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_AIDoorBreachKick
class UAnimNotify_AIDoorBreachKick : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_AIDoorBreachKick* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_AIDoorBreachRam
class UAnimNotify_AIDoorBreachRam : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_AIDoorBreachRam* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_AIDoorBreachShotgun
class UAnimNotify_AIDoorBreachShotgun : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_AIDoorBreachShotgun* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_AIThrowGrenade
class UAnimNotify_AIThrowGrenade : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_AIThrowGrenade* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_AIThrowGrenadeComplete
class UAnimNotify_AIThrowGrenadeComplete : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_AIThrowGrenadeComplete* GetDefaultObj();

};

// 0x58 (0x90 - 0x38)
// Class ReadyOrNot.AnimNotify_AIThrowPendingItem
class UAnimNotify_AIThrowPendingItem : public UAnimNotify
{
public:
	class FName                                  BoneToSpawnOn;                                     // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               LandingLocation;                                   // 0x40(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1514[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            RelativeTransform;                                 // 0x50(0x30)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        bCustomThrowDirection : 1;                         // Mask: 0x1, PropSize: 0x10x80(0x1)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_E6 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1516[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              ThrowDirection;                                    // 0x84(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_AIThrowPendingItem* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_ApplyArteryDamage
class UAnimNotify_ApplyArteryDamage : public UAnimNotify
{
public:
	class FName                                  ArteryBoneName;                                    // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAnimNotify_ApplyArteryDamage* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_ApplyMeleeDamage
class UAnimNotify_ApplyMeleeDamage : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_ApplyMeleeDamage* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_ArrestComplete
class UAnimNotify_ArrestComplete : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_ArrestComplete* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_Breach_C2Detonate
class UAnimNotify_Breach_C2Detonate : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_Breach_C2Detonate* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_Breach_C2Placed
class UAnimNotify_Breach_C2Placed : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_Breach_C2Placed* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class ReadyOrNot.AnimNotify_ChangeBodySocket
class UAnimNotify_ChangeBodySocket : public UAnimNotify
{
public:
	enum class EItemCategory                     ItemCategory;                                      // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_152A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Socket;                                            // 0x3C(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_152B[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_ChangeBodySocket* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_CollectEvidence
class UAnimNotify_CollectEvidence : public UAnimNotify
{
public:
	uint8                                        bCollectFinished : 1;                              // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_152F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_CollectEvidence* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_CompleteHeal
class UAnimNotify_CompleteHeal : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_CompleteHeal* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class ReadyOrNot.AnimNotify_DisableWeaponFOV
class UAnimNotify_DisableWeaponFOV : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_DisableWeaponFOV* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_DisarmTrap
class UAnimNotify_DisarmTrap : public UAnimNotify
{
public:
	uint8                                        bDisarmFinished : 1;                               // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1532[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_DisarmTrap* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_DoorKickBreak
class UAnimNotify_DoorKickBreak : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_DoorKickBreak* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_DoorKickFailure
class UAnimNotify_DoorKickFailure : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_DoorKickFailure* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class ReadyOrNot.AnimNotify_EquipItemOfClass
class UAnimNotify_EquipItemOfClass : public UAnimNotify
{
public:
	TSubclassOf<class ABaseItem>                 ItemClass;                                         // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bInstant : 1;                                      // Mask: 0x1, PropSize: 0x10x40(0x1)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAIOnly : 1;                                       // Mask: 0x2, PropSize: 0x10x40(0x1)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1539[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_EquipItemOfClass* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_EquipLastItem
class UAnimNotify_EquipLastItem : public UAnimNotify
{
public:
	uint8                                        bInstant : 1;                                      // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_153C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_EquipLastItem* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_ForceFireWeapon
class UAnimNotify_ForceFireWeapon : public UAnimNotify
{
public:
	float                                        Chance;                                            // 0x38(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bNoEnemyRequired;                                  // 0x3C(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1543[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_ForceFireWeapon* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_ForceRagdoll
class UAnimNotify_ForceRagdoll : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_ForceRagdoll* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_GetupComplete
class UAnimNotify_GetupComplete : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_GetupComplete* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_ItemSwitchSocket
class UAnimNotify_ItemSwitchSocket : public UAnimNotify
{
public:
	enum class EItemSocket                       DesiredItemSocket;                                 // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1546[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_ItemSwitchSocket* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_KillMyself
class UAnimNotify_KillMyself : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_KillMyself* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_LockPickDoor
class UAnimNotify_LockPickDoor : public UAnimNotify
{
public:
	uint8                                        bLockPickFinished : 1;                             // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1549[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_LockPickDoor* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_MirrorDoor
class UAnimNotify_MirrorDoor : public UAnimNotify
{
public:
	uint8                                        bMirrorFinish : 1;                                 // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_154B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_MirrorDoor* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_NextMag
class UAnimNotify_NextMag : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_NextMag* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_OnCheckedDoor
class UAnimNotify_OnCheckedDoor : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_OnCheckedDoor* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_OnLandmarkProxyUse
class UAnimNotify_OnLandmarkProxyUse : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_OnLandmarkProxyUse* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_PickupItemComplete
class UAnimNotify_PickupItemComplete : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_PickupItemComplete* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_PlayMontage
class UAnimNotify_PlayMontage : public UAnimNotify
{
public:
	class UAnimMontage*                          Montage;                                           // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAnimNotify_PlayMontage* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_PlayPostProcessEffect
class UAnimNotify_PlayPostProcessEffect : public UAnimNotify
{
public:
	class FName                                  PostProcessEffectName;                             // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_PlayPostProcessEffect* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_PreMissionWeaponVis
class UAnimNotify_PreMissionWeaponVis : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_PreMissionWeaponVis* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_PushQueuedDoor
class UAnimNotify_PushQueuedDoor : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_PushQueuedDoor* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_RemovePlacedC2
class UAnimNotify_RemovePlacedC2 : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_RemovePlacedC2* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class ReadyOrNot.AnimNotify_SearchLandmark
class UAnimNotify_SearchLandmark : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_SearchLandmark* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.SetControlRotationToCamBoneAnimNotify
class USetControlRotationToCamBoneAnimNotify : public UAnimNotify
{
public:
	class FName                                  CameraBoneName;                                    // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class USetControlRotationToCamBoneAnimNotify* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_SetCoverFirePose
class UAnimNotify_SetCoverFirePose : public UAnimNotify
{
public:
	class UAnimSequence*                         Pose;                                              // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_SetCoverFirePose* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_SetCoverHidePose
class UAnimNotify_SetCoverHidePose : public UAnimNotify
{
public:
	class UAnimSequence*                         Pose;                                              // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_SetCoverHidePose* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_SetCoverIdlePose
class UAnimNotify_SetCoverIdlePose : public UAnimNotify
{
public:
	class UAnimSequence*                         Pose;                                              // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_SetCoverIdlePose* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_SetHoleTraversalPose
class UAnimNotify_SetHoleTraversalPose : public UAnimNotify
{
public:
	class UAnimSequence*                         Pose;                                              // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_SetHoleTraversalPose* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_SetStrafe
class UAnimNotify_SetStrafe : public UAnimNotify
{
public:
	bool                                         bSetStrafe;                                        // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1566[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_SetStrafe* GetDefaultObj();

};

// 0x28 (0x60 - 0x38)
// Class ReadyOrNot.AnimNotify_SpawnThrownItem
class UAnimNotify_SpawnThrownItem : public UAnimNotify
{
public:
	TSubclassOf<class ABaseItem>                 ItemClass;                                         // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bLocalOnly : 1;                                    // Mask: 0x1, PropSize: 0x10x40(0x1)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bNonLocalOnly : 1;                                 // Mask: 0x2, PropSize: 0x10x40(0x1)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_E8 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_156B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  BoneToSpawnOn;                                     // 0x44(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCustomThrowDirection : 1;                         // Mask: 0x1, PropSize: 0x10x4C(0x1)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_E9 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_156D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              ThrowDirection;                                    // 0x50(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_156E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_SpawnThrownItem* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class ReadyOrNot.AnimNotify_SpawnWeapon
class UAnimNotify_SpawnWeapon : public UAnimNotify
{
public:
	TArray<TSubclassOf<class ABaseWeapon>>       PotentialWeapons;                                  // 0x38(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAnimNotify_SpawnWeapon* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class ReadyOrNot.AnimNotifyState_HideBoneVis
class UAnimNotifyState_HideBoneVis : public UAnimNotifyState
{
public:
	class FName                                  BoneNameToHide;                                    // 0x30(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAnimNotifyState_HideBoneVis* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_ToggleEquipmentVis
class UAnimNotify_ToggleEquipmentVis : public UAnimNotify
{
public:
	enum class EToggleInventoryVis               InventroyVis;                                      // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1576[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_ToggleEquipmentVis* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class ReadyOrNot.AnimNotify_WedgeDoor
class UAnimNotify_WedgeDoor : public UAnimNotify
{
public:
	uint8                                        bWedgeDeployFinished : 1;                          // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1579[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_WedgeDoor* GetDefaultObj();

};

// 0x38 (0x68 - 0x30)
// Class ReadyOrNot.AnimNotifyState_SpawnLight
class UAnimNotifyState_SpawnLight : public UAnimNotifyState
{
public:
	struct FLinearColor                          LightColor;                                        // 0x30(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StartIntensity;                                    // 0x40(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MiddleIntensity;                                   // 0x44(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        EndIntensity;                                      // 0x48(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        InterpSpeed;                                       // 0x4C(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APointLight*                           PointLight;                                        // 0x50(0x8)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxDuration;                                       // 0x58(0x4)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CurrentDuration;                                   // 0x5C(0x4)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  SocketName;                                        // 0x60(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotifyState_SpawnLight* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class ReadyOrNot.AnimTurnInPlaceLibrary
class UAnimTurnInPlaceLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAnimTurnInPlaceLibrary* GetDefaultObj();

	void UpdateTurnInPlace(float DeltaTime, bool bAllowTurnInPlace, bool bHoldYawOffset, bool bIsTurnTransitionStateRelevant, bool bClampYawOffset, float YawOffsetLimit, struct FRotator& MeshWorldRotation, struct FAnimTurnInPlaceAnimSet& AnimSet, struct FAnimTurnInPlaceState& TurnInPlaceState, float TurnInPlaceSpeedMultiplier);
	void PostProcessYawOffset(float DeltaSeconds, float& YawOffset, float& LastYawOffset, float& LastPostProcessedYawOffset, float& TurnAroundTimeToGo, float TurnAroundBlendTime);
};

// 0x10 (0x118 - 0x108)
// Class ReadyOrNot.ArmourResourceComponent
class UArmourResourceComponent : public UResourceComponent
{
public:
	int32                                        MaxTickets;                                        // 0x108(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        Resistance;                                        // 0x10C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        RemainingTickets;                                  // 0x110(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_159F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UArmourResourceComponent* GetDefaultObj();

	void SetResistance(float NewResistancePercentage);
	void SetMaxTickets(int32 NewMax);
	float GetResistancePercentage();
	int32 GetRemainingTickets();
	int32 GetMaxTickets();
};

// 0x4B0 (0x770 - 0x2C0)
// Class ReadyOrNot.ReadyOrNotGameMode
class AReadyOrNotGameMode : public AGameModeBase
{
public:
	uint8                                        Pad_1623[0x58];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   GameModeSettings;                                  // 0x318(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_1625[0x60];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class AReadyOrNotCharacter*, int32>     AbuseCountMap;                                     // 0x388(0x50)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bIsCampaignTransitioning;                          // 0x3D8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1626[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          Reinforcement_Handle;                              // 0x3E0(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRunWarmup;                                        // 0x3E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bArrestSpectator;                                  // 0x3E9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowLoadouts;                                    // 0x3EA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1629[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxPlayersAllowed;                                 // 0x3EC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnabledForPlay;                                   // 0x3F0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_162B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                UrlShortName;                                      // 0x3F8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Password;                                          // 0x408(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                    PlayerStartClass;                                  // 0x418(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASpectatePawn>             DeadSpectatorClass;                                // 0x420(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  LobbyStartTag;                                     // 0x428(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  RedCustomizationStartTag;                          // 0x430(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BlueCustomizationStartTag;                         // 0x438(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SWATBlueStartTag;                                  // 0x440(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SWATRedStartTag;                                   // 0x448(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SuspectStartTag;                                   // 0x450(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSpectateKillerOnDeath;                            // 0x458(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInitialPlayerRespawn;                             // 0x459(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDrawPlayerCameraSphere : 1;                       // Mask: 0x1, PropSize: 0x10x45A(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_EC : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1630[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnMatchStarted;                                    // 0x460(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class ERespawnMode                      RespawnMode;                                       // 0x470(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1632[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bTimelimitUsedInMode;                              // 0x472(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMatchState                       CurrentMatchState;                                 // 0x473(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1635[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnMatchStateChanged;                               // 0x478(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1637[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSavedLoadout                         DefaultLoadoutIfNothingLoaded;                     // 0x490(0x188)(Edit, NativeAccessSpecifierPublic)
	uint8                                        Pad_1639[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ModeName;                                          // 0x620(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  ModeDescription;                                   // 0x638(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bCanRespawn;                                       // 0x650(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_163B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MinimumPlayersToStart;                             // 0x654(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinimumPlayersForTimer;                            // 0x658(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_163D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class APlayerCharacter>        BlueCharacterClass;                                // 0x660(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class APlayerCharacter>        RedCharacterClass;                                 // 0x688(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_163E[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class APlayerController*>             DeadPlayers;                                       // 0x6F0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class APlayerController*>             RespawnableDeadPlayers;                            // 0x700(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                PlayerSpawnTag;                                    // 0x710(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPlayerRespawned;                                 // 0x720(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>               CharacterHUD;                                      // 0x730(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASpectatorPawn>            NormalSpectatorPawn;                               // 0x738(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMissionPlanManager*                   MissionPlanManager;                                // 0x740(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMissionExfiltrated;                               // 0x748(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsExfilEnabled;                                   // 0x749(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1648[0x26];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AReadyOrNotGameMode* GetDefaultObj();

	void SwapPlayerTeams();
	void StartMatch();
	class ASpectatorPawn* SpawnSpectator(class APlayerController* Controller, TSubclassOf<class ASpectatorPawn> Class, const struct FTransform& SpawnTransform);
	class APlayerCharacter* SpawnPlayerCharacter(class APlayerController* Controller, TSubclassOf<class APlayerCharacter> Class, const struct FTransform& SpawnTransform);
	bool ShouldCountDownTimelimitNow();
	void SetPassword(const class FString& NewPassword);
	void SetMatchState(enum class EMatchState NewMatchState);
	void SetExfilEnabled(bool bEnabled);
	void RestartGame();
	void RespawnPlayer(class APlayerController* Player, bool bForceSpectator);
	void RespawnDeadPlayersOnTeam(enum class ETeamType Team);
	void RespawnDeadPlayers();
	void RespawnAllPlayersOnTeam(enum class ETeamType Team);
	void RespawnAllPlayers();
	bool RemoveDeadPlayerAt(int32 Index);
	bool RemoveDeadPlayer(class APlayerController* InPlayerController);
	void RefreshSession();
	void ProcessServerTravel(const class FString& URL, bool bAbsolute);
	void PlayerTakenDamage(class AReadyOrNotCharacter* InstigatorCharacter, class AReadyOrNotCharacter* DamagedCharacter, class AActor* DamageCauser, float Damage, float HealthRemaining);
	void PlayerKilled(class AReadyOrNotCharacter* InstigatorCharacter, class AReadyOrNotCharacter* KilledCharacter);
	void PlayerFreed(class ACharacter* Freed, class ACharacter* Freer);
	void PlayerDowned(class AReadyOrNotCharacter* DownedCharacter, class AReadyOrNotCharacter* InstigatorCharacter);
	void PlayerArrested(class AReadyOrNotCharacter* ArrestedCharacter, class AReadyOrNotCharacter* InstigatorCharacter);
	void OnPlayerRespawned__DelegateSignature(class APawn* Pawn, class APlayerController* Controller);
	void OnOutOfBoundsTimeLimitEnded();
	void OnMatchStateChanged__DelegateSignature(enum class EMatchState NewMatchState);
	void OnMatchStarted__DelegateSignature();
	void OnExfiltrateMission__DelegateSignature();
	void OnExfilEnabledChange__DelegateSignature(bool bEnabled);
	void OnBanStatusChecked(const class FString& SteamId, bool bIsBanned, const class FString& BanReason, bool bIsMySteamId);
	void NextGame();
	bool KickPlayer(class APlayerController* KickedPlayer, class FText& KickReason);
	bool IsTeamDead(enum class ETeamType Team, bool bIncludeArrestedAsDead);
	class AActor* GetThisPlayersStartPointByTag(class APlayerController* Player, const class FString& IncomingName);
	class AReadyOrNotGameState* GetReadyOrNotGameState();
	class AReadyOrNotGameSession* GetReadyOrNotGameSession();
	enum class EMatchState GetMatchState();
	bool GetIsExfilEnabled();
	TArray<class APlayerCharacter*> GetAllPlayerCharactersInWorld();
	void ExfiltrateMission(const TArray<class ASWATCharacter*>& ExfilCharacters);
	bool DoesLevelRequireGeneration();
	void CheckToAnnounceTeamkill(class ACharacter* InstigatorCharacter, class ACharacter* KilledCharacter);
	bool AreAllPlayersDead();
	void AddAbuse(class AReadyOrNotCharacter* Abuser, class ACyberneticCharacter* Abused);
};

// 0x60 (0x7D0 - 0x770)
// Class ReadyOrNot.ReadyOrNotGameMode_PVP
class AReadyOrNotGameMode_PVP : public AReadyOrNotGameMode
{
public:
	FMulticastInlineDelegateProperty_            OnMatchStart;                                      // 0x770(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRoundWon;                                        // 0x780(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRoundStart;                                      // 0x790(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnRoundEnd;                                        // 0x7A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        RoundEndResetDelay;                                // 0x7B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MatchEndResetDelay;                                // 0x7B4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class URoundEndWidget_PVP>       RoundEndWidgetClass;                               // 0x7B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bIncrementedRoundCounterThisRound : 1;             // Mask: 0x1, PropSize: 0x10x7C0(0x1)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1675[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AReadyOrNotGameMode_PVP* GetDefaultObj();

	void TimeLimitVictoryConditions();
	void TimelimitReached();
	void RoundWonTeam(enum class ETeamType WinningTeam);
	void RoundWon(const TArray<class AReadyOrNotPlayerState*>& WinningPlayers);
	void RoundEnd();
	void OnRoundWon__DelegateSignature(enum class ETeamType WinningTeam);
	void OnRoundStarted();
	void OnRoundStart__DelegateSignature();
	void OnRoundEnded();
	void OnRoundEnd__DelegateSignature();
	void OnMatchStart__DelegateSignature();
	void NextRound();
	void Multicast_SetWinningTeam(enum class ETeamType WinningTeam);
	void MatchEnd();
	void CheckRoundEnd(float DeltaSeconds);
	bool AnyDeathsOnWinningTeam();
};

// 0x40 (0x810 - 0x7D0)
// Class ReadyOrNot.ArrestAndRescueGM
class AArrestAndRescueGM : public AReadyOrNotGameMode_PVP
{
public:
	bool                                         bSuddenDeath;                                      // 0x7D0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1677[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class APlayerCharacter*>              ArrestedBlueCharacters;                            // 0x7D8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class APlayerCharacter*>              ArrestedRedCharacters;                             // 0x7E8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UFMODEvent*                            VIPArrestedSound;                                  // 0x7F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODEvent*                            VIPKilledSound;                                    // 0x800(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_167D[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AArrestAndRescueGM* GetDefaultObj();

};

// 0x570 (0x7E0 - 0x270)
// Class ReadyOrNot.ReadyOrNotGameState
class AReadyOrNotGameState : public AGameStateBase
{
public:
	uint8                                        Pad_1733[0x34];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RandomStreamSeed;                                  // 0x2A4(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1735[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        NumSuspectsActive;                                 // 0x2B8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        NumCiviliansActive;                                // 0x2B9(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        NumSwatActive;                                     // 0x2BA(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1736[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UReadyOrNotVoiceConfig*                VoiceConfig;                                       // 0x2C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1737[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ULoadout_V2*                           Loadout_V2;                                        // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReadyOrNotLoadoutManager*             LoadoutFunctionLibrary;                            // 0x2D8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerState*                          NextHost;                                          // 0x2E0(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MigrationGUID;                                     // 0x2E8(0x10)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1738[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHasHostFinishedLoading;                           // 0x2FC(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1739[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABaseItem*>                     AllItems;                                          // 0x300(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AEvidenceActor*>                AllEvidenceActors;                                 // 0x310(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AReportableActor*>              AllReportableActors;                               // 0x320(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ATrapActorAttachedToDoor*>      AllDoorTrapActors;                                 // 0x330(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ACoverLandmark*>                AllCoverLandmarks;                                 // 0x340(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AWallHoleTraversal*>            AllWallHoles;                                      // 0x350(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class APairedInteractionDriver*>      AllPairedInteractionActors;                        // 0x360(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UDataTable*>                    LoadedDataTables;                                  // 0x370(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	class AScoringManager*                       ScoringManager;                                    // 0x380(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class AAIFactionManager*> AIFactionManagers;                                 // 0x388(0x50)(NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   Rep_GameModeSettings;                              // 0x3D8(0x10)(Net, NoDestructor, NativeAccessSpecifierPublic)
	float                                        TimeTillGameStartCountdown;                        // 0x3E8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_173A[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABadAIAction*>                  BadAIActionActors;                                 // 0x3F8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bHasLeftLoadOut;                                   // 0x408(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_173C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ULevelStreaming*                       PreMissionStreamedLevel;                           // 0x410(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UWorld>                 SubPreMissionPlanningLevel;                        // 0x418(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_173D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ModeName;                                          // 0x448(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  ModeRules;                                         // 0x460(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<class AObjective*>                    MissionObjectives;                                 // 0x478(0x10)(BlueprintVisible, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnMissionObjectivesUpdated;                        // 0x488(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObituaryData*                         ObituaryData;                                      // 0x498(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAnnounceReinforcements;                           // 0x4A0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRadioGlareEnabled;                                // 0x4A1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_173F[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFMODEvent*                            ReplenishAllAmmoSound;                             // 0x4A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ASpectatePawn*>                 SpectatePawns;                                     // 0x4B0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AReadyOrNotCharacter*>          RedTeamPlayers;                                    // 0x4C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AReadyOrNotCharacter*>          BlueTeamPlayers;                                   // 0x4D0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AThrownItem*>                   AllThrownItems;                                    // 0x4E0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ADoor*>                         AllDoors;                                          // 0x4F0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AReadyOrNotCharacter*>          AllReadyOrNotCharacters;                           // 0x500(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ACyberneticCharacter*>          AllAICharacters;                                   // 0x510(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UInteractableComponent*>        AllInteractableComponents;                         // 0x520(0x10)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UFMODAudioComponent*                   AnnouncerAudioComponent;                           // 0x530(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalMissionAbuseCount;                            // 0x538(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1741[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TScriptInterface<class IListenForDeath>> DeathListeners;                                    // 0x540(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TScriptInterface<class IListenForGameStart>> GameStartListeners;                                // 0x550(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TScriptInterface<class IListenForGameEnd>> GameEndListeners;                                  // 0x560(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         bDisableEquipment;                                 // 0x570(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableCommandChat;                                // 0x571(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseReinforcements;                                // 0x572(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1742[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Reinforcements_TimeRemaining;                      // 0x574(0x4)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRunWarmup;                                        // 0x578(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1743[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AActor>                    SceneCapturePlayerCameraClass;                     // 0x580(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowEnemiesAsSuspects;                            // 0x588(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1744[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FKillFeedData>                 KillFeedData;                                      // 0x590(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnUpdateKillFeed;                                  // 0x5A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        ServerTimeUntilNextMap;                            // 0x5B0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1745[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                GameRulesIntroAnnouncerRowName;                    // 0x5B8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWaitingForPlayers;                                // 0x5C8(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1746[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PlanningTimeLeft;                                  // 0x5CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RedTeamWins;                                       // 0x5D0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BlueTeamWins;                                      // 0x5D4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1747[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnWinsUpdated;                                     // 0x5E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        EndPlayTimer;                                      // 0x5F0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RoundTimeRemaining;                                // 0x5F4(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseTimelimit;                                     // 0x5F8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1748[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Scorelimit;                                        // 0x5FC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeSinceMatchStarted;                             // 0x600(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1749[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AReferendum*                           CurrentReferendum;                                 // 0x608(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class AReferendum>>       AllowedReferendumTypes;                            // 0x610(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         bCanShowScoreboard;                                // 0x620(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUsePlanningUICamera;                              // 0x621(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_174A[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RoundTimeElapsed;                                  // 0x624(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RoundsPlayed;                                      // 0x628(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RoundsToPlay;                                      // 0x62C(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETeamType                         RoundWinningTeam;                                  // 0x630(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETeamType                         MatchWinningTeam;                                  // 0x631(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_174B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AReadyOrNotPlayerState*>        RoundWinners;                                      // 0x638(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnChatMessageReceived;                             // 0x648(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                MissionName;                                       // 0x658(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  MissionDescription;                                // 0x668(0x18)(Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic)
	enum class EMatchState                       MatchState;                                        // 0x680(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_174D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCharacterArrested;                               // 0x688(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCharacterKilled;                                 // 0x698(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                NextURLReplicated;                                 // 0x6A8(0x10)(Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSequenceStarted;                                 // 0x6B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class FName>                          WhitelistedLabels;                                 // 0x6C8(0x10)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UDebugDisplayWidget>       DebugDisplayWidget;                                // 0x6D8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ModeURL_Replicated;                                // 0x6E0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFloorMapPointData>            DrawingPointData;                                  // 0x6F0(0x10)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	bool                                         bPvPMode;                                          // 0x700(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanReportToTOC;                                   // 0x701(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_174F[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GametypeDamageModifier;                            // 0x704(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeadDamageModifier;                                // 0x708(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FootDamageModifier;                                // 0x70C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LegDamageModifier;                                 // 0x710(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArmDamageModifier;                                 // 0x714(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OtherLimbDamageModifier;                           // 0x718(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFreeForAll;                                       // 0x71C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisablePickups;                                   // 0x71D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRevivesAllowed : 1;                               // Mask: 0x1, PropSize: 0x10x71E(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_F2 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1751[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRChatMessage>                 SavedChatMessages;                                 // 0x720(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bBallisticsDebug;                                  // 0x730(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDamageDebug;                                      // 0x731(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSpeechRecognitionDebug;                           // 0x732(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGOAPDebug;                                        // 0x733(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAnnounceTeamReinforcements;                       // 0x734(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1754[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Msg_BothTeamsReinforced;                           // 0x738(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  Msg_RedTeamReinforced;                             // 0x750(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  Msg_BlueTeamReinforced;                            // 0x768(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UChallenge>>        GameModeChallenges;                                // 0x780(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        bInPlanningMenu : 1;                               // Mask: 0x1, PropSize: 0x10x790(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_F3 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1755[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CustomTimeDilationApplied;                         // 0x794(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APlayerController*>             AdminPlayerControllers;                            // 0x798(0x10)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	class ATOCManager*                           TOCManager;                                        // 0x7A8(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideLevelEffectsInPreMission;                     // 0x7B0(0x1)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1758[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class APostProcessVolume*>            WorldPostProcessVolumes;                           // 0x7B8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class AExponentialHeightFog*>         WorldExponentialHeightFogs;                        // 0x7C8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1759[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AReadyOrNotGameState* GetDefaultObj();

	void UpdateDoorTickIntervals();
	void SkipMVPScreen();
	void SetTimeDilationSynced(float TimeDilation);
	void SetGlobalSuspendVoiceOver(bool bEnable);
	void ResetReplicatedTimers();
	void RemoveGameStartListener(TScriptInterface<class IListenForGameStart> GameStartListener);
	void RemoveGameEndListener(TScriptInterface<class IListenForGameEnd> GameEndListener);
	void RemoveDeathListener(TScriptInterface<class IListenForDeath> DeathListener);
	void PlayerKilled(class AReadyOrNotCharacter* InstigatorCharacter, class AReadyOrNotCharacter* KilledCharacter);
	void PlayerArrested(class AReadyOrNotCharacter* ArrestedCharacter, class AReadyOrNotCharacter* InstigatorCharacter);
	void OverWriteModeNameText(class FText NewModeName);
	void OnWinsUpdated__DelegateSignature();
	void OnUpdateKillFeed__DelegateSignature(class AActor* Causer, class ACharacter* InstigatorCharacter, class ACharacter* KilledCharacter);
	void OnSequenceStartedFunc(class ULevelSequence* LevelSequence);
	void OnSequenceStarted__DelegateSignature(class ULevelSequence* LevelSequence);
	void OnRep_WinsUpdated();
	void OnRep_StreamSeed();
	void OnRep_NextHost();
	void OnRep_MissionObjectives();
	void OnRep_MatchState();
	void OnRep_DrawPointDataChanged();
	void OnRep_CustomTimeDilation();
	void OnLoadoutFinished();
	void OnChatMessage__DelegateSignature(const struct FRChatMessage& Message);
	void OnCharacterKilled__DelegateSignature(class AReadyOrNotCharacter* Character, class AReadyOrNotCharacter* KilledBy);
	void OnCharacterArrested__DelegateSignature(class AReadyOrNotCharacter* Character, class AReadyOrNotCharacter* ArrestedBy);
	void OnAuthenticationResponse(bool bSuccess, bool bSerialFound, bool bSerialValid, const class FString& FailedReason);
	void OnAlphaAccessChecked(bool bBanned, const class FString& BanReason);
	void Multicast_StopSequence(class ULevelSequence* Sequence);
	void Multicast_PlaySequence(class ULevelSequence* Sequence);
	void Multicast_PlayAnnouncerForTeam(const class FString& SpeechRowName, enum class ETeamType TeamType);
	void Multicast_OnRoundReset();
	void Multicast_OnGameStarted();
	void Multicast_OnGameEnded();
	void Multicast_OnCharacterDied(class AReadyOrNotCharacter* Victim, class AReadyOrNotCharacter* Killer, class AActor* Inflictor);
	void Multicast_BroadcastChatMessage(const struct FRChatMessage& ChatMessage);
	void LoadStartupWidgetsAfterLoadingScreen();
	bool IsEveryoneReady();
	bool IsAdminPlayerController(class APlayerController* PlayerController);
	float GetWinningScore(bool* bUsesScoring);
	int32 GetTotalMissionAbuseCount();
	float GetTeamScore(enum class ETeamType Team);
	int32 GetRemainingRounds();
	void GetPlayerStatesOnTeamOrderedByScore(enum class ETeamType Team, TArray<class AReadyOrNotPlayerState*>* PlayerStates);
	TArray<class AReadyOrNotPlayerState*> GetPlayerStatesOfTeam(enum class ETeamType Team);
	TArray<class AReadyOrNotPlayerState*> GetPlayersAvailableForVote();
	void GetNextMapMode(class FString* Map, class FString* Mode);
	class ABadAIAction* GetMostRecentBadAIActionReport();
	class FText GetModeText();
	int32 GetMaxSwatScore();
	int32 GetMaxSuspectScore();
	class FString GetMapURL();
	struct FGameModeSettings GetGameModeSettings();
	TArray<struct FDeploymentStatus> GetDeploymentStatusOfPlayers();
	int32 GetCurrentSwatScore();
	int32 GetCurrentSuspectScore();
	class UReadyOrNotProfile* GetCurrentProfile();
	TArray<class AReadyOrNotPlayerController*> GetControllersAvailableForVote();
	void Client_BindCharacterEvents(class APlayerCharacter* Character);
	void AddGameStartListener(TScriptInterface<class IListenForGameStart> GameStartListener);
	void AddGameEndListener(TScriptInterface<class IListenForGameEnd> GameEndListener);
	void AddDeathListener(TScriptInterface<class IListenForDeath> DeathListener);
};

// 0x8 (0x7E8 - 0x7E0)
// Class ReadyOrNot.ArrestAndRescueGS
class AArrestAndRescueGS : public AReadyOrNotGameState
{
public:
	int32                                        BlueRespawnWaves;                                  // 0x7E0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RedRespawnWaves;                                   // 0x7E4(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AArrestAndRescueGS* GetDefaultObj();

};

// 0x170 (0x198 - 0x28)
// Class ReadyOrNot.BaseActivity
class UBaseActivity : public UObject
{
public:
	uint8                                        Pad_17A3[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnStartActivity;                                   // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPerformActivity;                                 // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFinishActivity;                                  // 0x50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFinishActivity_NoOwner;                          // 0x60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_17A4[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ActivityName;                                      // 0x88(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxActivityTime;                                   // 0x98(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActivityStartDelay;                                // 0x9C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoResetDataOnFinish : 1;                          // Mask: 0x1, PropSize: 0x10xA0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_F7 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_17A6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MoveAcceptanceRadius;                              // 0xA8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17A8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GlobalCooldown;                                    // 0xB0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bGlobalCooldownRandomRange : 1;                    // Mask: 0x1, PropSize: 0x10xB4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_F8 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_17AA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             GlobalCooldownRange;                               // 0xB8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsProgressActivity : 1;                           // Mask: 0x1, PropSize: 0x10xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bFinishActivityWhenOverriden : 1;                  // Mask: 0x2, PropSize: 0x10xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAbortMoveWhenActivityFinished : 1;                // Mask: 0x4, PropSize: 0x10xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAbortMoveWhenActivityOverriden : 1;               // Mask: 0x8, PropSize: 0x10xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAbortActivityIfCannotReachLocation : 1;           // Mask: 0x10, PropSize: 0x10xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAbortActivityIfProjectedLocationFailed : 1;       // Mask: 0x20, PropSize: 0x10xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAbortIfTrackingEnemy : 1;                         // Mask: 0x40, PropSize: 0x10xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPauseIfTrackingEnemy : 1;                         // Mask: 0x80, PropSize: 0x10xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPauseIfRecentlyInCombat : 1;                      // Mask: 0x1, PropSize: 0x10xC1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_F9 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_17AD[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RecentCombatTimeThreshold;                         // 0xC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowWhileArrested : 1;                           // Mask: 0x1, PropSize: 0x10xC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoMoveActivity : 1;                               // Mask: 0x2, PropSize: 0x10xC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bResetStateMachineWhenActivityResumed : 1;         // Mask: 0x4, PropSize: 0x10xC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowPartialMove : 1;                             // Mask: 0x8, PropSize: 0x10xC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowRePathOnInvalidation : 1;                    // Mask: 0x10, PropSize: 0x10xC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAbortIfNotMovingForAWhile : 1;                    // Mask: 0x20, PropSize: 0x10xC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysRequestMove : 1;                            // Mask: 0x40, PropSize: 0x10xC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAbortIfSurrendered : 1;                           // Mask: 0x80, PropSize: 0x10xC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17B0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ElapsedActivityTime;                               // 0xCC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeNotMoving;                                     // 0xD0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               Location;                                          // 0xD4(0xC)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                ProgressState;                                     // 0xE0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TimeSinceLastAsyncMove;                            // 0xF0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               LastRequestedLocation;                             // 0xF4(0xC)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17B1[0x5C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EActivityStatus                   ActivityStatus;                                    // 0x15C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17B2[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        BitPad_FA : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bSearchingPath : 1;                                // Mask: 0x2, PropSize: 0x10x162(0x1)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bLastRequestedLocationWaitingForRepath : 1;        // Mask: 0x4, PropSize: 0x10x162(0x1)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_FB : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_17B4[0x15];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LastPathLength;                                    // 0x178(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17B5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ACyberneticController*                 OwningController;                                  // 0x180(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACyberneticCharacter*                  OwningCharacter;                                   // 0x188(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UActivityFiniteStateMachine*           ActivityStateMachine;                              // 0x190(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBaseActivity* GetDefaultObj();

	void StartActivity_Blueprint(class AAIController* Owner);
	bool ShouldForceStrafe();
	bool ShouldForceNoStrafe();
	void SetLocation(struct FVector& NewLocation, bool bRequestMove, const struct FVector& CustomExtent);
	void ResetData();
	void PerformActivity_Blueprint(float DeltaTime);
	bool OverrideFocalPoint_Blueprint(struct FVector* FocalPoint);
	void OnStartActivity__DelegateSignature(class UBaseActivity* Activity, class ACyberneticController* Controller);
	void OnPerformActivity__DelegateSignature(class UBaseActivity* Activity, class ACyberneticController* Controller, float DeltaTime);
	void OnKilled(class AReadyOrNotCharacter* InstigatorCharacter, class AReadyOrNotCharacter* KilledCharacter);
	void OnIncapacitated(class AReadyOrNotCharacter* IncapacitatedCharacter, class AReadyOrNotCharacter* InstigatorCharacter);
	void OnFinishActivity__DelegateSignature(class UBaseActivity* Activity, class ACyberneticController* Controller);
	bool IsProgressActivity();
	bool IsNoMoveActivity();
	bool IsActivityPaused();
	bool IsActivityInitialized();
	bool IsActivityComplete();
	bool HasStartedActivity();
	bool HasReachedLocation(float Tolerance);
	class FString GetProgressState();
	class ACyberneticController* GetOwningController();
	class FName GetMoveStyleOverride();
	struct FVector GetLocation();
	class ACyberneticCharacter* GetCharacter();
	enum class EActivityStatus GetActivityStatus();
	float GetActiveStateUptime();
	class FString GetActiveStateName();
	int32 GetActiveStateID();
	void FinishedActivity_Blueprint(bool bSuccess);
	void EquipWeapon();
	void EquipItemOfClass(TSubclassOf<class ABaseItem> InItemClass);
	void EquipItem(enum class EItemCategory InItemCategory);
	bool CanOverrideActivity();
	bool CanBePushed();
};

// 0x20 (0x1B8 - 0x198)
// Class ReadyOrNot.ArrestTargetActivity
class UArrestTargetActivity : public UBaseActivity
{
public:
	class ACyberneticCharacter*                  ArrestTarget;                                      // 0x198(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInteractionsData*                     ArrestInteraction;                                 // 0x1A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17C8[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UArrestTargetActivity* GetDefaultObj();

	void TickArrestStage(float DeltaTime, float Uptime);
	void OnArresterKilled(class AReadyOrNotCharacter* InstigatorCharacter, class AReadyOrNotCharacter* KilledCharacter);
	void EnterMoveToStage();
	void EnterArrestStage();
	bool CanArrest();
};

// 0x88 (0x2A8 - 0x220)
// Class ReadyOrNot.Objective
class AObjective : public AInfo
{
public:
	class UScoringComponent*                     ScoringComponent;                                  // 0x220(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnObjectiveUpdated;                                // 0x228(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFMODEvent*                            ObjectiveCompleteAudio;                            // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODEvent*                            ObjectiveFailedAudio;                              // 0x240(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ObjectiveName;                                     // 0x248(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  ObjectiveDescription;                              // 0x260(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	enum class ECOOPMode                         LockedToMode;                                      // 0x278(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFailureEndsMission;                               // 0x279(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHiddenObjective;                                  // 0x27A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowCompletionWhileHidden;                       // 0x27B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHiddenObjectiveUnlockMethod      UnlockMethod;                                      // 0x27C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17E3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AReportableActor>          UnlockingReportableClass;                          // 0x280(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AObjective>                UnlockingObjectiveClass;                           // 0x288(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AReportableActor*                      UnlockingReportable;                               // 0x290(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AObjective*                            UnlockingObjective;                                // 0x298(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EObjectiveStatus                  ObjectiveStatus;                                   // 0x2A0(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17E4[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AObjective* GetDefaultObj();

	void TickObjective_BP();
	void OnUnlockingReportableReported(class AReportableActor* ReportableActor);
	void OnUnlockingObjectiveUpdated(class AObjective* Objective);
	void OnRep_ObjectiveStatus();
	void OnObjectiveFailed();
	void OnObjectiveCreated();
	void OnObjectiveCompleted();
	void ObjectiveFailed();
	void ObjectiveCompleted();
	void Multicast_UnlockObjective();
	bool IsObjectiveInProgress();
	bool IsObjectiveFailed();
	bool IsObjectiveCompleted();
	enum class EObjectiveStatus GetObjectiveStatus();
	class FText GetFormattedName();
	class FText GetFormattedDescription();
};

// 0x8 (0x2B0 - 0x2A8)
// Class ReadyOrNot.ArrestXSuspects
class AArrestXSuspects : public AObjective
{
public:
	int32                                        RequiredArrests;                                   // 0x2A8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17EA[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AArrestXSuspects* GetDefaultObj();

};

// 0x30 (0x2D8 - 0x2A8)
// Class ReadyOrNot.ASequenceInteraction
class AASequenceInteraction : public ALevelSequenceActor
{
public:
	uint8                                        Pad_17F5[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bAutoActivateInRange;                              // 0x2B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17F7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                ReferencedCharacterViewTarget;                     // 0x2C0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBoxComponent*                         RadiusComp;                                        // 0x2C8(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerCharacter*                      LastPlayedSequencerCharacter;                      // 0x2D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AASequenceInteraction* GetDefaultObj();

	void OnSequencerFinished();
	void OnBoxOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnBoxEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
};

// 0x18 (0x138 - 0x120)
// Class ReadyOrNot.AspectRatioConstraintBox
class UAspectRatioConstraintBox : public UContentWidget
{
public:
	bool                                         bUseFixedConstraint;                               // 0x120(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1802[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FixedAspectRatio;                                  // 0x124(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1803[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAspectRatioConstraintBox* GetDefaultObj();

	void SetFixedAspectRatio(float NewAspectRatio);
	void OnSettingsUpdated();
	void EnableConstraint();
	void DisableConstraint();
};

// 0x0 (0x28 - 0x28)
// Class ReadyOrNot.AsyncLoader
class UAsyncLoader : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAsyncLoader* GetDefaultObj();

	TSubclassOf<class UUserWidget> GetLazyLoadedWidget(TSoftClassPtr<class UUserWidget> Widget);
	TSubclassOf<class ABaseWeapon> GetLazyLoadedWeapon(TSoftClassPtr<class ABaseWeapon> Item);
	class USoundCue* GetLazyLoadedSoundCue(TSoftObjectPtr<class USoundCue> Cue);
	class USkeletalMesh* GetLazyLoadedSkeletalMesh(TSoftObjectPtr<class USkeletalMesh> Mesh);
	TArray<TSubclassOf<class AReadyOrNotGameMode>> GetLazyLoadedReadyOrNotGameModeArray(const TArray<TSoftClassPtr<class AReadyOrNotGameMode>>& Array);
	class UParticleSystem* GetLazyLoadedParticleSystem(TSoftObjectPtr<class UParticleSystem> Particle);
	class UObject* GetLazyLoadedObject(TSoftObjectPtr<class UObject> Object);
	class UStaticMesh* GetLazyLoadedMesh(TSoftObjectPtr<class UStaticMesh> Mesh);
	class UMaterialInstance* GetLazyLoadedMaterialInstance(TSoftObjectPtr<class UMaterialInstance> Material);
	TSubclassOf<class ABaseItem> GetLazyLoadedItem(TSoftClassPtr<class ABaseItem> Item);
	class UTexture2D* GetLazyLoadedImage(TSoftObjectPtr<class UTexture2D> Texture);
	TArray<TSubclassOf<class UClass>> GetLazyLoadedClassArray(const TArray<TSoftClassPtr<class UClass>>& Array);
	class UClass* GetLazyLoadedClass(TSoftClassPtr<class UClass> Class);
	class UAnimSequence* GetLazyLoadedAnimSequence(TSoftObjectPtr<class UAnimSequence> Anim);
	class UAnimMontage* GetLazyLoadedAnimMontage(TSoftObjectPtr<class UAnimMontage> Montage);
};

// 0x48 (0x2D0 - 0x288)
// Class ReadyOrNot.AttachmentSlot_V2
class UAttachmentSlot_V2 : public UCommonUserWidget
{
public:
	enum class EWeaponAttachmentType             AttachmentType;                                    // 0x288(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1842[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            ItemImage;                                         // 0x290(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                            EmptyImage;                                        // 0x298(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  ItemName;                                          // 0x2A0(0x18)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	class UTextBlock*                            ItemType;                                          // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWeaponAttachment*                     Attachment;                                        // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         Equipped;                                          // 0x2C8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1844[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAttachmentSlot_V2* GetDefaultObj();

	void SetEquipped(bool IsEquipped);
	void SetAttachmentType(enum class EWeaponAttachmentType Type);
	void SetAttachment(class UWeaponAttachment* WeaponAttachment);
	void RefreshAttachmentInfo();
	void OnEquipped();
	bool GetEquipped();
	enum class EWeaponAttachmentType GetAttachmentType();
	TSubclassOf<class UWeaponAttachment> GetAttachment();
};

// 0x60 (0x280 - 0x220)
// Class ReadyOrNot.BadAIAction
class ABadAIAction : public AActor
{
public:
	class FText                                  Summary;                                           // 0x220(0x18)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x238(0x18)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	uint8                                        Pad_1853[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBillboardComponent*                   BillboardComponent;                                // 0x258(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1854[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABadAIAction* GetDefaultObj();

	void ReportBadAIAction();
	void Report(bool bReportToLog, bool bDrawString);
	void RemoveReport(bool bReportToLog, bool bDrawString);
	void RemoveBadAIAction();
	void AddNote(class FText& InSummary, class FText& InDescription);
};

// 0x7B0 (0x9D0 - 0x220)
// Class ReadyOrNot.BaseItem
class ABaseItem : public AActor
{
public:
	uint8                                        Pad_1938[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ItemName;                                          // 0x260(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             ItemIcon;                                          // 0x278(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ItemDescription;                                   // 0x2A0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	enum class EItemClass                        ItemClass;                                         // 0x2B8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_193A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       CategoryFlags;                                     // 0x2BC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LoadoutPriority;                                   // 0x2C0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowInLoadout;                                    // 0x2C4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_193B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  CustomizationTag;                                  // 0x2C8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemsPerSlot;                                      // 0x2D0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  LookupTableIdx;                                    // 0x2D4(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ItemWeight;                                        // 0x2DC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MovementSpeedMultiplier;                           // 0x2E0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HolsterPlayRate;                                   // 0x2E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DrawPlayRate;                                      // 0x2E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeanOffset;                                        // 0x2EC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisallowKicking;                                  // 0x2F0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFreelookEnabled;                                  // 0x2F1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseLowReady;                                      // 0x2F2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_193E[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PushbackRange;                                     // 0x2F4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LowReadyRange;                                     // 0x2F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LowReadyRangeSightsModifier;                       // 0x2FC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableTickWhenNotEquipped;                       // 0x300(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_193F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EGameVersionRestriction>   LockedToDLC;                                       // 0x308(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FItemVisualData                       Visuals;                                           // 0x318(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UTexture2D*                            HudOutline;                                        // 0x348(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraBobScaleH;                                   // 0x350(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraBobScaleV;                                   // 0x354(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraBobSpeedScaleH;                              // 0x358(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraBobSpeedScaleV;                              // 0x35C(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraBobAmplitudeBaseSpeed;                       // 0x360(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraBobIntensitySprintScale;                     // 0x364(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraBobAmplitudeWalkScale;                       // 0x368(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraBobAmplitudeSprintScale;                     // 0x36C(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobScaleH;                                   // 0x370(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobScaleV;                                   // 0x374(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobScaleInjured;                             // 0x378(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobSpeedScaleH;                              // 0x37C(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobSpeedScaleV;                              // 0x380(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobSpeedScaleInjured;                        // 0x384(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobCrouchModifier;                           // 0x388(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobADSModifier;                              // 0x38C(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobRotPitchScale;                            // 0x390(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobRotRollScale;                             // 0x394(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobRotPitchSpeed;                            // 0x398(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobRotRollSpeed;                             // 0x39C(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobRotCrouchModifier;                        // 0x3A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponBobRotADSModifier;                           // 0x3A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                       SceneComp;                                         // 0x3A8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                ItemMesh;                                          // 0x3B0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBoxComponent*                         InteractionBox;                                    // 0x3B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODAudioComponent*                   FMODAudioComp;                                     // 0x3C0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInteractableComponent*                InteractableComponent;                             // 0x3C8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScoringComponent*                     ScoringComponent;                                  // 0x3D0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODEvent*                            PhysicsImpact;                                     // 0x3D8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1942[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AThrownItem>               ThrownItemClass;                                   // 0x3F0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1946[0x3C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bAttachOnDrawComplete;                             // 0x434(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1948[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMesh*                         Rep_CustomItemMeshFromAttachment;                  // 0x438(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UCustomizationSkin>     DefaultSkin;                                       // 0x440(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCustomizationSkin*                    Skin;                                              // 0x468(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_194A[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bInInventory;                                      // 0x471(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldTickAnimBPWhenNotEquipped;                  // 0x472(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_194B[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Server_ReplicatedPhysicsLocation;                  // 0x474(0xC)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               TargetWorldScale;                                  // 0x480(0xC)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetWorldScaleInterpSpeed;                       // 0x48C(0x4)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_194D[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bStartAsEvidence;                                  // 0x491(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsEvidence;                                       // 0x492(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMarkAsEvidenceWhenNoOwner;                        // 0x493(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsClearable;                                      // 0x494(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasBeenCleared;                                   // 0x495(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_194F[0xA];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class UDamageType>>       BlockAnyDamageFrom;                                // 0x4A0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UDamageType>>       BlockDirectHitsFrom;                               // 0x4B0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         bTaserDamageBlocked;                               // 0x4C0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1950[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<TSubclassOf<class UDamageType>, float>  MultiplyStunDamageFrom;                            // 0x4C8(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<TSubclassOf<class UDamageType>, struct FWeightStunMultiplier> MultiplyStunDamageByWeight;                        // 0x518(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceDynamic*>      Dynamic1PMaterialInstances;                        // 0x568(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_1951[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UMaterialInstanceDynamic*>      DynamicWeaponFovMats;                              // 0x580(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class USkeletalMesh*, struct FMeshFOVMaterials> SkeletalMeshToFOVMats;                             // 0x590(0x50)(NativeAccessSpecifierPublic)
	TMap<class UStaticMesh*, struct FMeshFOVMaterials> StaticMeshToFOVMats;                               // 0x5E0(0x50)(NativeAccessSpecifierPublic)
	uint8                                        Pad_1953[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UMaterialInstanceDynamic*>      FP_SkinMaterials;                                  // 0x638(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceDynamic*>      TP_SkinMaterials;                                  // 0x648(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                MasterPoseRep;                                     // 0x658(0x8)(ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowStaticMeshOnBody;                             // 0x660(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1954[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  WeaponWheelCategoryName;                           // 0x664(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1955[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnItemUseCompleted;                                // 0x670(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1956[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bCanReloadSameMagazine;                            // 0x698(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1957[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          LastReloadAnim_3P;                                 // 0x6A0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        QuickLeanMultiplier;                               // 0x6A8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FreeLeanMultiplier;                                // 0x6AC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEvidenceCollected;                               // 0x6B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EWeaponType                       WeaponType;                                        // 0x6C0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableMeshspaceMovement;                         // 0x6C1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_195B[0xE];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            MeshspaceTransform_Default;                        // 0x6D0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            MeshspaceTransform_Aiming;                         // 0x700(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            MeshspaceTransform_Back;                           // 0x730(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        InertiaDragAimRotation;                            // 0x760(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InertiaDragAimLocation;                            // 0x764(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InertiaDragStrafeRotation;                         // 0x768(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InertiaDragStrafeLocation;                         // 0x76C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               MovementSpeedScale;                                // 0x770(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              MovementSpeedRotationScalePitchYawRoll;            // 0x77C(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        MeshSpaceAimInterp;                                // 0x788(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_195F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            MeshspaceTransform_OnDraw;                         // 0x790(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        OnDrawMeshspaceInterp;                             // 0x7C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1961[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            MeshspaceTransform_OnHolster;                      // 0x7D0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        OnHolsterMeshspaceInterp;                          // 0x800(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BodySocket;                                        // 0x804(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  HandsSocket;                                       // 0x80C(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AnimationIndex1P;                                  // 0x814(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1964[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AnimationIndex3P;                                  // 0x81C(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1965[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bDeployable;                                       // 0x824(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldEquipToHands;                               // 0x825(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1969[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EItemCategory>             ItemCategories;                                    // 0x828(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                        Pad_196B[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnItemDrawComplete;                                // 0x848(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_196D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UMatineeCameraShake>       Reload_CameraShake;                                // 0x860(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>       ReloadEmpty_CameraShake;                           // 0x868(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>       DrawCameraShake;                                   // 0x870(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>       HolsterCameraShake;                                // 0x878(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AReadyOrNotCharacter*                  PreviousOwner;                                     // 0x880(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1971[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                LastFPAnimInstanceClass;                           // 0x8C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1972[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                LastTPAnimInstanceClass;                           // 0x900(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsBeingCollected;                                 // 0x908(0x1)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1975[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CurrentCollectionTime;                             // 0x90C(0x4)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxCollectionTime;                                 // 0x910(0x4)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1977[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AReadyOrNotCharacter*                  CollectingCharacter;                               // 0x918(0x8)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDropping;                                         // 0x920(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1978[0xF];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bDisableAnimInstanceWhenNotEquipped;               // 0x930(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_197B[0xF];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UReadyOrNotWeaponAnimData*             AnimationData;                                     // 0x940(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReadyOrNotWeaponAnimData*             DefaultAnimationData;                              // 0x948(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReadyOrNotWeaponAnimData*             GripAnimationData;                                 // 0x950(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReadyOrNotWeaponAnimData*             ShieldRaisedAnimationData;                         // 0x958(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReadyOrNotWeaponAnimData*             ShieldLoweredAnimationData;                        // 0x960(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FreeAimLimit;                                      // 0x968(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FreeAimLimitADS;                                   // 0x96C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LazySpringStrength;                                // 0x970(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LazySpringStrengthADS;                             // 0x974(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FreeAimInterpSpeed;                                // 0x978(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FreeAimInterpADSModifier;                          // 0x97C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FreeAimInterpHipModifier;                          // 0x980(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FreeAimSlowMoveModifier;                           // 0x984(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FreeAimSlowMoveTolerance;                          // 0x988(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1984[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UMatineeCameraShake>       MeleeUserCameraShake;                              // 0x990(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bADSCountsAsAbuse;                                 // 0x998(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1986[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HesitationBoostMultiplier;                         // 0x99C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAimingDownSights;                               // 0x9A0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1987[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LowReadyPitchThreshold;                            // 0x9A4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWeaponSound*                          SoundData;                                         // 0x9A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideBreathingEvent;                           // 0x9B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1988[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFMODEvent*                            BreathingAudioOverride;                            // 0x9B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEasyPickup;                                       // 0x9C0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bNoPickup;                                         // 0x9C1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bScriptedFPHidden;                                 // 0x9C2(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMotionBlockType                  ActiveMotionBlock;                                 // 0x9C3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsOneHandedItem;                                  // 0x9C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_198B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FP_ADS_Motion_Weight;                              // 0x9C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_198C[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABaseItem* GetDefaultObj();

	void StunTick(enum class EStunType StunType);
	void StunnedWhileEquipped();
	void StopTPMontage(class UAnimMontage* AnimMontage);
	void StopFPMontage(class UAnimMontage* AnimMontage);
	void SpawnThrownItemAtTransform(struct FTransform& Transform, struct FVector& ThrowDirection, struct FVector& ThrowLocation);
	bool ShouldHideInPictureInPictureScopes();
	void SetupBaseEvents();
	void Server_SetMasterPoseComponent(class USkeletalMeshComponent* Mesh);
	void Server_PlayTPMontage(class UAnimMontage* NewMontage, float PlayRate);
	void Server_ApplyPointDamage(class AActor* DamagedActor, float BaseDamage, struct FVector& HitFromDirection, struct FHitResult& HitInfo, class AController* EventInstigator, class AActor* DamageCauser, TSubclassOf<class UDamageType> DamageTypeClass);
	void PlayWeaponCleaning();
	void PlayTPMontage(class UAnimMontage* NewMontage, float PlayRate);
	void PlayFPMontage(class UAnimMontage* NewMontage, float PlayRate);
	void PlayFMODAudio(class UFMODEvent* Event);
	bool PlayDraw(bool bDrawFirst);
	void PlayDoorPushAnimation();
	void PlayButtonPushAnimation();
	void OnThrownFromInventory(class AReadyOrNotCharacter* Thrower, bool bMarkAsEvidence);
	void OnRep_Skin();
	void OnRep_MasterPoseComponent();
	void OnRep_IsDropping();
	void OnRep_AttachmentRep();
	void OnPhysicsImpact(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void OnOwnerPossessed();
	void OnMeshComponentHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void OnItemUsed();
	void OnItemUseCompleted__DelegateSignature(class ABaseItem* Item);
	void OnItemUseComplete();
	void OnItemPrimaryUseEnd();
	void OnItemPrimaryUse__DelegateSignature(class ABaseItem* Item);
	void OnItemPrimaryUse();
	void OnItemEndUse();
	void OnItemDrawComplete__DelegateSignature(class ABaseItem* Item);
	void OnItemAttachmentsChanged__DelegateSignature(enum class EItemAttachment AttachmentChanged);
	void OnEvidenceCollected__DelegateSignature();
	void NextFireMode();
	void Multicast_PlayTPMontage(class UAnimMontage* NewMontage, float PlayRate);
	void MarkAsEvidence(bool bMarkAsEvidence);
	void LastStunTick(enum class EStunType StunType);
	bool IsPlayingStunnedEndAnimation();
	bool IsPlayingStunnedAnimation();
	bool IsPlayingHolster();
	bool IsPlayingDraw();
	bool IsMontagePlaying(class UAnimMontage* Montage, bool bIncludeFP, bool bIncludeTP);
	bool IsLocallyControlled();
	bool IsEquipped();
	bool IsDoorPushAnimationPlaying();
	bool IsDepleted();
	bool IsCurrentlyReloading();
	bool IsCollidesWhileNotEquipped();
	bool IsButtonPushAnimationPlaying();
	bool IsBlockingAnimationPlaying(const TArray<enum class EBlockingAnimationExclusion>& Exclusions);
	void InterpToTargetScale(const struct FVector& NewScale, float InterpSpeed);
	bool HasDoorPushAnimation();
	bool HasButtonPushAnimation();
	float GetWeight();
	float GetLowReadyRange();
	class USkeletalMeshComponent* GetItemMesh();
	class FName GetEquipSocket();
	class UAnimMontage* GetCurrentTPMontage();
	class UAnimMontage* GetCurrentFPMontage();
	void EndStunWhileEquipped();
	void DrawOutline();
	void DisableOutline();
	void DisableOrEnableAnimation();
	void DetachStatic();
	bool ContainsItemCategory(enum class EItemCategory TestCategory);
	void ClientPlayDraw(bool bDrawFirst);
	void Client_StopItemAnimation(struct FWeaponAnim& InWeaponAnim, bool bOnlyTP);
	void Client_SetFPModelVisibility(bool bVisibility);
	void Client_PlayItemAnimation(struct FWeaponAnim& InWeaponAnim, bool bRestartIfAlreadyPlaying, bool bOnlyLocal, bool bOnlyTP);
	void Client_PlayFPMontage(class UAnimMontage* NewMontage, float PlayRate);
	void Client_OnItemPickedUp(class AActor* NewOwner, bool bEquipped);
	bool CanShowActionSlot1(class AReadyOrNotCharacter* PC);
	bool CanEquip(class AReadyOrNotCharacter* ToCharacter);
	void CancelCurrentReloadAction(bool bCancel);
	void BP_AttachmentRep();
	void AttachStatic();
};

// 0x0 (0x9D0 - 0x9D0)
// Class ReadyOrNot.BaseDeployableGear
class ABaseDeployableGear : public ABaseItem
{
public:

	static class UClass* StaticClass();
	static class ABaseDeployableGear* GetDefaultObj();

};

// 0x40 (0xA10 - 0x9D0)
// Class ReadyOrNot.BallisticsShield
class ABallisticsShield : public ABaseDeployableGear
{
public:
	class UMaterialInstanceDynamic*              GlassMaterialInstance;                             // 0x9D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABaseMagazineWeapon*                   PistolEquippedWithShield;                          // 0x9D8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19B4[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFMODEvent*                            ShieldHitEvent;                                    // 0x9E8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Damage;                                            // 0x9F0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GlassPhaseParam;                                   // 0x9F4(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19B6[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bLowered;                                          // 0x9FA(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19B8[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UMatineeCameraShake>       ShieldHitCameraShake;                              // 0xA00(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19B9[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABallisticsShield* GetDefaultObj();

	void Server_SetLowered(bool bShouldLower);
	void OnTPShieldHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void Client_SetPistol(class ABaseItem* NewPistol);
	void Client_PlayShieldHitSound();
};

// 0x70 (0xA40 - 0x9D0)
// Class ReadyOrNot.BaseArmour
class ABaseArmour : public ABaseItem
{
public:
	bool                                         bIsHeavy;                                          // 0x9D0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_19C3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ScaleLensFlare;                                    // 0x9D4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USkeletalMesh*>                 Variations;                                        // 0x9D8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UParticleSystem*                       ArmourHitParticle;                                 // 0x9E8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODEvent*                            ArmourHitSound;                                    // 0x9F0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODEvent*                            ArmourHitSoundFirstPerson;                         // 0x9F8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            PaperdollTexture;                                  // 0xA00(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            PaperdollTexture_Crouch;                           // 0xA08(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            PaperdollTexture_Carry;                            // 0xA10(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            PaperdollTexture_Carry_Crouch;                     // 0xA18(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>       InterceptShakeFront;                               // 0xA20(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>       InterceptShakeBack;                                // 0xA28(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>       InterceptShakeLeft;                                // 0xA30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>       InterceptShakeRight;                               // 0xA38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ABaseArmour* GetDefaultObj();

	bool HasRemainingProtection();
	float GetDurabilityPercentage();
};

// 0x278 (0x410 - 0x198)
// Class ReadyOrNot.BaseCombatActivity
class UBaseCombatActivity : public UBaseActivity
{
public:
	FMulticastInlineDelegateProperty_            OnTrackNewEnemy;                                   // 0x198(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FScriptedFireAt                       CurrentScriptedFireAt;                             // 0x1A8(0x28)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FScriptedLookAt                       CurrentScriptedLookAt;                             // 0x1D0(0x18)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A13[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FleeDesire;                                        // 0x1F0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeSincePerformingAnyCombatMove;                  // 0x1F4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimePerformingAnyCombatMove;                       // 0x1F8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A14[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTraverseHoleActivity*                 TraverseHoleActivity;                              // 0x200(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseCombatMoveActivity*               CombatMoveActivity;                                // 0x208(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseCombatMoveActivity*               PreviousCombatMoveActivity;                        // 0x210(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHardCoverCombatMove*                  HardCoverCombatMove;                               // 0x218(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDuelingCombatMove*                    DuelingCombatMove;                                 // 0x220(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFlankingCombatMove*                   FlankingCombatMove;                                // 0x228(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USuppressionCombatMove*                SuppressionCombatMove;                             // 0x230(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPushCombatMove*                       PushCombatMove;                                    // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChargeCombatMove*                     ChargeCombatMove;                                  // 0x240(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFleeingCombatMove*                    FleeingCombatMove;                                 // 0x248(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URepositionCombatMove*                 RepositionCombatMove;                              // 0x250(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A16[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CoverLandmarkEvaluationCooldown;                   // 0x270(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1A18[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AReadyOrNotCharacter*                  LastTrackedEnemy;                                  // 0x278(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1A19[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UPickupItemActivity*                   PickupItemActivity;                                // 0x290(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UReloadSafelyActivity*                 ReloadSafelyActivity;                              // 0x298(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPlayDeadActivity*                     PlayDeadActivity;                                  // 0x2A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommitSuicideActivity*                CommitSuicideActivity;                             // 0x2A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1A1A[0x160];                                   // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBaseCombatActivity* GetDefaultObj();

	void TrackEnemyKilled(class AReadyOrNotCharacter* InstigatorCharacter, class AReadyOrNotCharacter* KilledCharacter);
	void TrackEnemyFire(class AReadyOrNotCharacter* FromCharacter, class ABaseMagazineWeapon* Weapon, const struct FVector& FireDirection);
	void StopScriptedLook();
	void StopScriptedFire();
	void StartRunningCombatMove(class UBaseCombatMoveActivity* CombatMove);
	void ScriptedLookAtLocation(const struct FVector& InLocation, float InTime);
	void ScriptedLookAtActor(class AActor* InActor, float InTime);
	void ScriptedFireAtLocation(const struct FVector& InLocation, float InTime, bool bOverrideTarget, float AccuracyPenaltyMultiplier, bool bInfiniteAmmo);
	void ScriptedFireAtActor(class AActor* InActor, float InTime, bool bOverrideTarget, float AccuracyPenaltyMultiplier, bool bInfiniteAmmo);
	void PlayDeadStarted(class UBaseActivity* Activity, class ACyberneticController* Controller);
	void PlayDeadFinished(class UBaseActivity* Activity, class ACyberneticController* Controller);
	void PerformStrafeLogic(float DeltaTime, float Uptime);
	void PerformNoStrafeLogic(float DeltaTime, float Uptime);
	void OnTrackNewEnemy__DelegateSignature(class AReadyOrNotCharacter* NewTrackedEnemy);
	void OnTakeDamage(class AReadyOrNotCharacter* InstigatorCharacter, class AReadyOrNotCharacter* DamagedCharacter, class AActor* DamageCauser, float Damage, float HealthRemaining);
	void OnSuicideFakeOutSuccess();
	void OnStunned(class AReadyOrNotCharacter* StunnedCharacter, float Duration, enum class EStunType StunType, class AActor* DamageCauser);
	void OnRequestCoverLandmark();
	void OnRequestCover();
	void OnNoCoverFound();
	void OnCoverLandmarkExit();
	void OnCoverFound();
	void OnCoverExit();
	bool IsTryingToFireAtScriptedActor();
	bool IsRunningCombatMoveActivity(class UClass* Class);
	bool IsFocusingOnActor(class AActor* InActor);
	int32 GetFailureCountForCombatMove(TSubclassOf<class UBaseCombatMoveActivity> CombatMoveClass);
	class UBaseCombatMoveActivity* GetCombatMoveActivity();
	void FinishCombatMove(bool bSuccess);
	void EnterStrafeState();
	void EnterNoStrafeState();
};

// 0x30 (0x1C8 - 0x198)
// Class ReadyOrNot.BaseCombatMoveActivity
class UBaseCombatMoveActivity : public UBaseActivity
{
public:
	class UBaseCombatActivity*                   OwningCombatActivity;                              // 0x198(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FailureCount;                                      // 0x1A0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LastSuccessTime;                                   // 0x1A4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LastFailTime;                                      // 0x1A8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A2A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBaseActivity*                         InterruptActivity;                                 // 0x1B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1A2B[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bRequireMagazineWeapon;                            // 0x1C4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1A2C[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBaseCombatMoveActivity* GetDefaultObj();

	void RequestCombatMove_Blueprint(float DeltaTime);
	bool HasLOSToEnemy();
	bool HasAnyOtherCombatMoveGotLocation(struct FVector& TestLocation, float Tolerance);
	class UBaseActivity* GetInterruptActivity();
	void GenerateNavigablePoints(struct FVector& GenAroundLoc, struct FNavGenerationParameters& NavGenerationParameters, TArray<struct FVector>* OutLocations);
	void FinishCombatMove(bool bSuccess);
};

// 0x8 (0x268 - 0x260)
// Class ReadyOrNot.BaseCredit
class UBaseCredit : public UUserWidget
{
public:
	bool                                         bRevealed;                                         // 0x260(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A2E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FAnimationSpeed;                                   // 0x264(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBaseCredit* GetDefaultObj();

};

// 0x480 (0xE50 - 0x9D0)
// Class ReadyOrNot.BaseGrenade
class ABaseGrenade : public ABaseItem
{
public:
	uint8                                        Pad_1A42[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPointLightComponent*                  DetonationLight;                                   // 0x9D8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URadialForceComponent*                 DetonationRadialForce;                             // 0x9E0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODAudioComponent*                   FMODBounceSoundComponent;                          // 0x9E8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIPerceptionStimuliSourceComponent*   DetonationStimuliComp;                             // 0x9F0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GrenadeBounciness;                                 // 0x9F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDetonationTriggersStimuli;                        // 0x9FC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A4A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DetonationSoundMaxRange;                           // 0xA00(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DetonationLoudness;                                // 0xA04(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  DetonationTag;                                     // 0xA08(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ThrownTag;                                         // 0xA10(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BounceTag;                                         // 0xA18(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A4C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AThrownGrenade*                        Thrown;                                            // 0xA28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUsedFixedThrowTrajectory : 1;                     // Mask: 0x1, PropSize: 0x10xA30(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_119 : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1A50[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       FirstBouncePath;                                   // 0xA38(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FHitResult                            FirstBounceHit;                                    // 0xA48(0x88)(IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A53[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       SecondBouncePath;                                  // 0xAD8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FHitResult                            SecondBounceHit;                                   // 0xAE8(0x88)(IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A54[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       ThirdBouncePath;                                   // 0xB78(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FHitResult                            ThirdBounceHit;                                    // 0xB88(0x88)(IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A55[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector_NetQuantize>           CompletePath;                                      // 0xC18(0x10)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A56[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        BouncePt1;                                         // 0xC34(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BouncePt2;                                         // 0xC38(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BouncePt3;                                         // 0xC3C(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A58[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                DeployGrenadeVoiceLine;                            // 0xC48(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GrenadeSpeed;                                      // 0xC58(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A5A[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BounceSoundMinImpulse;                             // 0xC64(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundBase*>                    BounceSoundEffects;                                // 0xC68(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*              ActivationEffect;                                  // 0xC78(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       GrenadeBounceEffect;                               // 0xC80(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODEvent*                            ActivationSound;                                   // 0xC88(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActivationTime;                                    // 0xC90(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActivationElapsedTime;                             // 0xC94(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bActivated;                                        // 0xC98(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPlayDetonationEffectsExactlyOnce;                 // 0xC99(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDetonationEffectsPlayed;                          // 0xC9A(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A5D[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeSinceUsed;                                     // 0xC9C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeSinceDetonate;                                 // 0xCA0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A5E[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EDrawDebugTrace                   DrawDebugType;                                     // 0xCA5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bThrowAsQuickThrow;                                // 0xCA6(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFastThrowOnceEquipped;                            // 0xCA7(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFastThrowing;                                     // 0xCA8(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGrenadeReleased;                                  // 0xCA9(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A62[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ThrowImpulse;                                      // 0xCB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UpImpulse;                                         // 0xCB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTriggersActionMusic;                              // 0xCB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanThrowGrenade;                                  // 0xCB9(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A64[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DetonationTime;                                    // 0xCBC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIncreaseDamageRadiusOverTime;                     // 0xCC0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A65[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UnderarmForceScale;                                // 0xCC8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Drag;                                              // 0xCCC(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DragAppliedPerBounce;                              // 0xCD0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DetonationFlashIntensitiy;                         // 0xCD4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DetonationFlashInterp;                             // 0xCD8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReDetonationTime;                                  // 0xCDC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTriggerSFXOnRedetonate;                           // 0xCE0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A66[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ThrowDistance;                                     // 0xCE4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RedotonateCount;                                   // 0xCE8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoMoraleDamage : 1;                               // Mask: 0x1, PropSize: 0x10xCEC(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_11A : 7;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1A68[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ListenerTriggerDistance;                           // 0xCF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A69[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               MaxRandomizedForceOnDetonation;                    // 0xD00(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               FixedForceOnDetonation;                            // 0xD0C(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UParticleSystem*>               DetonationParticles;                               // 0xD18(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UParticleSystemComponent*>      SpawnedParticles;                                  // 0xD28(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRotator                              ParticleSpawnRotation;                             // 0xD38(0xC)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A6C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFMODEvent*                            DetonationFMODEvent;                               // 0xD48(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             DetonationEvent;                                   // 0xD50(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideGrenadeOnDetonate;                            // 0xD58(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EGrenadeType                      Type;                                              // 0xD59(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A6E[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnGrenadeDetonated;                                // 0xD60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnGrenadeThrown;                                   // 0xD70(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        RedrawDelayAfterThrow;                             // 0xD80(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUsed;                                             // 0xD84(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A72[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AReadyOrNotCharacter*                  ThrownBy;                                          // 0xD88(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A74[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGrenadeDamage>                DetonationDamage;                                  // 0xDA0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bUseScreenShake;                                   // 0xDB0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A79[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UMatineeCameraShake>       ExplosionScreenShake;                              // 0xDB8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraShakeRadius;                                 // 0xDC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseDetonationDecal;                               // 0xDC4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A7C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DetonationDecalTraceDistance;                      // 0xDC8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A7D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInterface*                    DetonationDecal;                                   // 0xDD0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               DetonationDecalSize;                               // 0xDD8(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A7E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          HideBonesOnUsed;                                   // 0xDE8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                        BounceActivationRadius;                            // 0xDF8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A80[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFMODEvent*                            FMODGrenadeBounce;                                 // 0xE00(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A81[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GrenadeOcclusionMultiplier;                        // 0xE10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GrenadeFullOcclusionDepth;                         // 0xE14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDistanceDifference;                             // 0xE18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        InterpStrength;                                    // 0xE1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ClientReplicationFrequency;                        // 0xE20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1A82[0x2C];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABaseGrenade* GetDefaultObj();

	void UpdateServerPath(TArray<struct FVector_NetQuantize>& Path, int32 Bounce1, int32 Bounce2, int32 Bounce3);
	void Throw(bool bLocalOnly, bool bOverarmThrow, struct FVector& ThrowDirection, struct FVector& ThrowStart);
	void SetFullyPrimed();
	void Server_UpdateThrowPosition(const struct FVector& Position, const struct FRotator& Rotation, const struct FVector& Velocity);
	void Server_ThrowGrenade(bool bOverarmThrow, const struct FVector& ThrowDirection, const struct FVector& ThrowStart);
	void Server_StartFastThrow();
	void Server_SetThrowOverarm(bool bThrowOverarm, bool bQuickThrow);
	void OnRep_GrenadeUsed();
	void OnRep_GrenadePath();
	void OnGrenadeThrown__DelegateSignature(class ABaseGrenade* ThrownGrenade);
	void OnGrenadeBounceSoundStopped();
	void OnDetonate__DelegateSignature(class ABaseGrenade* Grenade);
	void Multicast_OnDeadDropped();
	void Multicast_GrenadeThrow(bool bOverarmThrow, const struct FVector& ThrowDirection, const struct FVector& ThrowStart);
	void Multicast_DetonationEffects(const struct FVector& CalculatedForce);
	void Multicast_AddImpulse(const struct FVector& Impulse, const struct FVector& FromLocation);
	bool IsOutside();
	void DoThrowFast();
	void Detonate();
};

// 0x40 (0xE90 - 0xE50)
// Class ReadyOrNot.BaseGasGrenade
class ABaseGasGrenade : public ABaseGrenade
{
public:
	int32                                        MaxGasPoints;                                      // 0xE50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A89[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LocationRecordingRate;                             // 0xE68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RecordDistanceThreshold;                           // 0xE6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A8A[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABaseGasGrenade* GetDefaultObj();

	void RecordLocation();
};

// 0x630 (0x1000 - 0x9D0)
// Class ReadyOrNot.BaseWeapon
class ABaseWeapon : public ABaseItem
{
public:
	bool                                         bPistolGrip;                                       // 0x9D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFireMode                         FiremodeBeforeSafe;                                // 0x9D1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1AA5[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAmmoTypeData                         CurrentAmmoType;                                   // 0x9D8(0x160)(Edit, DisableEditOnTemplate, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1AA6[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            AmmoDataTable;                                     // 0xB40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                          AmmunitionTypes;                                   // 0xB48(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class UReadyOrNotLoadoutManager*             LoadoutFunctionLibrary;                            // 0xB58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UArrowComponent*                       BulletSpawn;                                       // 0xB60(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UArrowComponent*                       ShellSpawn;                                        // 0xB68(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*              ShellParticle;                                     // 0xB70(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpotLightComponent*                   Flashlight;                                        // 0xB78(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScopedWeaponAttachment*               ScopeAttachment;                                   // 0xB80(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWeaponAttachment*                     MuzzleAttachment;                                  // 0xB88(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWeaponAttachment*                     UnderbarrelAttachment;                             // 0xB90(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWeaponAttachment*                     OverbarrelAttachment;                              // 0xB98(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWeaponAttachment*                     StockAttachment;                                   // 0xBA0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWeaponAttachment*                     GripAttachment;                                    // 0xBA8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWeaponAttachment*                     IlluminatorAttachment;                             // 0xBB0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWeaponAttachment*                     AmmunitionAttachment;                              // 0xBB8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODAudioComponent*                   ADSAudioComponent;                                 // 0xBC0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODAudioComponent*                   ADSEndAudioComponent;                              // 0xBC8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODAudioComponent*                   ADSAudioComponents[0x5];                           // 0xBD0(0x28)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODAudioComponent*                   ADSEndAudioComponents[0x5];                        // 0xBF8(0x28)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1AA8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AttachmentPoints;                                  // 0xC24(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSupressed;                                        // 0xC28(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1AA9[0xF];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnFireModeChanged;                                 // 0xC38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EFireMode                         CurrentFireMode;                                   // 0xC48(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFireMode                         DefaultFireMode;                                   // 0xC49(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1AAA[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EFireMode>                 AvailableFireModes;                                // 0xC50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                        BurstBulletCount;                                  // 0xC60(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasSafeMode;                                      // 0xC64(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1AAB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AddedMagazineCountFromAttachments;                 // 0xC68(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Optics_UI_Socket;                                  // 0xC6C(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Grip_UI_Socket;                                    // 0xC74(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Muzzle_UI_Socket;                                  // 0xC7C(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Stock_UI_Socket;                                   // 0xC84(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Magazine_UI_Socket;                                // 0xC8C(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ADSZoom;                                           // 0xC94(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ADSZoomInSpeed;                                    // 0xC98(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ADSZoomOutSpeed;                                   // 0xC9C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDamageType>               DefaultDamageType;                                 // 0xCA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDamageType>               DamageType;                                        // 0xCA8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>       FireCameraShake;                                   // 0xCB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCameraShakeBase*                      FireCameraShakeInst;                               // 0xCB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                    DamageOverRange;                                   // 0xCC0(0x88)(Edit, NativeAccessSpecifierPublic)
	float                                        Damage;                                            // 0xD48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageSeverityMultiplier;                          // 0xD4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageSeverityChance;                              // 0xD50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BleedoutDamageMultiplier;                          // 0xD54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BleedoutDamageChance;                              // 0xD58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultDamage;                                     // 0xD5C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FireRate;                                          // 0xD60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinFireRateAI;                                     // 0xD64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxFireRateAI;                                     // 0xD68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BulletsFiredUntilFullyAccurate;                    // 0xD6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProjectileMovementSpeed;                           // 0xD70(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bArmorPiercing;                                    // 0xD74(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1AAC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AImpactEffect>             ImpactEffects;                                     // 0xD78(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AImpactEffect>             RicochetEffects;                                   // 0xD80(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
