#pragma once

/**
 * Name: ron
 * Version: 25346
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class ReadyOrNot.AIActionGate
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAIActionGate : public UObject
	{
	public:
		bool CanOpen(const struct FAIActionDecisionContext& Context);
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AccuracyVolume
	 * Size -> 0x0008 (FullSize[0x0260] - InheritedSize[0x0258])
	 */
	class AAccuracyVolume : public AVolume
	{
	public:
		float                                                        AccuracyNerfPercentage;                                  // 0x0258(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bAffectsSWAT : 1;                                        // 0x025C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bAffectsSuspects : 1;                                    // 0x025C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x3];                                   // 0x025D(0x0003) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AIActionPresetData
	 * Size -> 0x02C8 (FullSize[0x02F8] - InheritedSize[0x0030])
	 */
	class UAIActionPresetData : public UDataAsset
	{
	public:
		struct FAIActionData                                         Action;                                                  // 0x0030(0x02C8) Edit, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.ActivityState
	 * Size -> 0x0070 (FullSize[0x0098] - InheritedSize[0x0028])
	 */
	class UActivityState : public UObject
	{
	public:
		class FScriptDelegate                                        OnEnter;                                                 // 0x0028(0x0010) ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic
		class FScriptDelegate                                        OnExit;                                                  // 0x0038(0x0010) ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic
		class FScriptDelegate                                        OnTick;                                                  // 0x0048(0x0010) ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic
		class FString                                                Name;                                                    // 0x0058(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                      ID;                                                      // 0x0068(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                        Uptime;                                                  // 0x006C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UActivityFiniteStateMachine*                           StateMachineOwner;                                       // 0x0070(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x20];                                  // 0x0078(0x0020) MISSED OFFSET (PADDING)

	public:
		class UActivityState* CreateTransition(const struct FActivityStateTransition& InStateTransition);
		class UActivityState* BindEventTick(const class FScriptDelegate& Delegate);
		class UActivityState* BindEventExit(const class FScriptDelegate& Delegate);
		class UActivityState* BindEventEnter(const class FScriptDelegate& Delegate);
		void ActivityStateUpdate__DelegateSignature(float DeltaTime, float Uptime);
		void ActivityStateEvent__DelegateSignature();
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.ActorSpawnPoint
	 * Size -> 0x0018 (FullSize[0x0238] - InheritedSize[0x0220])
	 */
	class AActorSpawnPoint : public AActor
	{
	public:
		class USceneComponent*                                       SceneComponent;                                          // 0x0220(0x0008) Edit, ExportObject, ZeroConstructor, d.e.o.i, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UBillboardComponent*                                   BillboardComponent;                                      // 0x0228(0x0008) Edit, ExportObject, ZeroConstructor, d.e.o.i, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bHasVisited : 1;                                         // 0x0230(0x0001) BIT_FIELD BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x7];                                   // 0x0231(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AIArchetypeData
	 * Size -> 0x00B8 (FullSize[0x00E8] - InheritedSize[0x0030])
	 */
	class UAIArchetypeData : public UDataAsset
	{
	public:
		class FString                                                Name;                                                    // 0x0030(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bEnableAlertActions : 1;                                 // 0x0040(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x7];                                   // 0x0041(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAIActionData>                                 AlertActions;                                            // 0x0048(0x0010) Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		bool                                                         bEnableUnalertActions : 1;                               // 0x0058(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0001[0x7];                                   // 0x0059(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAIActionData>                                 UnalertActions;                                          // 0x0060(0x0010) Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		bool                                                         bEnableSuspiciousActions : 1;                            // 0x0070(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0002[0x7];                                   // 0x0071(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAIActionData>                                 SuspiciousActions;                                       // 0x0078(0x0010) Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		bool                                                         bEnableContinuousActions : 1;                            // 0x0088(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0003[0x7];                                   // 0x0089(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAIActionData_NameOnly>                        ContinuousActions;                                       // 0x0090(0x0010) Edit, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FAIActionData>                                 ContinuousActionsCache;                                  // 0x00A0(0x0010) ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		bool                                                         bEnableCombatMoveActions : 1;                            // 0x00B0(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0004[0x7];                                   // 0x00B1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAIActionData>                                 CombatMoveActions;                                       // 0x00B8(0x0010) Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		bool                                                         bOverrideAimSpeed : 1;                                   // 0x00C8(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0005[0x3];                                   // 0x00C9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                        FocalPointInterpSpeed;                                   // 0x00CC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                        ActorRotationInterpStandingSpeed;                        // 0x00D0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                        ActorRotationInterpMovingSpeed;                          // 0x00D4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                        AimOffsetInterpSpeed;                                    // 0x00D8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bIgnoreDamageHitReactions : 1;                           // 0x00DC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bOnlyAllowCombatMovesWhilstAlert : 1;                    // 0x00DC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bAccuracyOverride : 1;                                   // 0x00DC(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0006[0x3];                                   // 0x00DD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                        Accuracy;                                                // 0x00E0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0007[0x4];                                   // 0x00E4(0x0004) MISSED OFFSET (PADDING)

	public:
		void AssignActionPreset();
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.ActivityFiniteStateMachine
	 * Size -> 0x0020 (FullSize[0x0048] - InheritedSize[0x0028])
	 */
	class UActivityFiniteStateMachine : public UObject
	{
	public:
		TArray<class UActivityState*>                                States;                                                  // 0x0028(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		class UActivityState*                                        ActiveState;                                             // 0x0038(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                                UnknownData_0000[0x8];                                   // 0x0040(0x0008) MISSED OFFSET (PADDING)

	public:
		bool IsMachineInitialized();
		class UActivityState* GetStateByName(const class FString& InStateName);
		class UActivityState* GetStateByID(int32_t InStateID);
		class UActivityState* GetActiveState();
		class UActivityState* AddState(const class FString& NewStateName, TArray<struct FActivityStateTransition> Transitions);
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AITest
	 * Size -> 0x0018 (FullSize[0x0238] - InheritedSize[0x0220])
	 */
	class AAITest : public AActor
	{
	public:
		class UBillboardComponent*                                   BillboardComponent;                                      // 0x0220(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class APlayerCharacter*                                      TestCharacter;                                           // 0x0228(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                      GiveToNearestXAI;                                        // 0x0230(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x4];                                   // 0x0234(0x0004) MISSED OFFSET (PADDING)

	public:
		void Investigate();
		void DestroyTestCharacter();
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.ActivityManager
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	class UActivityManager : public UObject
	{
	public:
		float                                                        GlobalStartDelay;                                        // 0x0028(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0000[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (PADDING)

	public:
		void SetStartDelay(float NewDelayTime);
		bool GiveActivityTo(class UBaseActivity* InActivity, class ACyberneticCharacter* InCharacter, bool bOverrideCurrentActivity, bool bClearActivityList);
		bool GiveActivitiesTo(TArray<class UBaseActivity*> InActivities, class ACyberneticCharacter* InCharacter, bool bOverrideCurrentActivity, bool bClearActivityList);
		float GetStartDelay();
		class UActivityManager* Get();
		class UBaseActivity* CreateActivity(class UObject* ContextObject, class UBaseActivity* InActivityClass, const class FString& InActivityName, float InActivityStartDelay);
		bool CanGiveActivityTo(class UBaseActivity* InActivity, class ACyberneticCharacter* InCharacter);
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AISpawn
	 * Size -> 0x0470 (FullSize[0x0690] - InheritedSize[0x0220])
	 */
	class AAISpawn : public AActor
	{
	public:
		float                                                        SpawnChance;                                             // 0x0220(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x4];                                   // 0x0224(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FSpawnData                                            SpawnData;                                               // 0x0228(0x00B8) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		TArray<struct FSpawnData>                                    RosterSpawnData;                                         // 0x02E0(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                         bIsExplosiveVestSpawn;                                   // 0x02F0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bIsRoamerSpawn;                                          // 0x02F1(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0001[0x6];                                   // 0x02F2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USceneComponent*                                       DefaultScene;                                            // 0x02F8(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, d.e.o.i, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UArrowComponent*                                       SpawnDirection;                                          // 0x0300(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, d.e.o.i, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FAIDataLookupTable                                    SavedAIData;                                             // 0x0308(0x0380) BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected
		class ACyberneticCharacter*                                  SpawnedCharacterDeffered;                                // 0x0688(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void TransferSpawnDataToRosterSpawnData();
		bool GetSuspectSpawnData(TArray<struct FSpawnData>* OutSpawnData);
		ETeamType GetSpawningTeamType(const struct FSpawnData& Sd);
		class ACyberneticCharacter* GetSpawnedCharacterDeffered();
		ETeamType GetDefaultSpawningTeamType();
		bool GetCivilianSpawnData(TArray<struct FSpawnData>* OutSpawnData);
		bool DoSpawn();
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AIData
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAIData : public UDataAsset
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AdminGameControls
	 * Size -> 0x0000 (FullSize[0x0260] - InheritedSize[0x0260])
	 */
	class UAdminGameControls : public UUserWidget
	{
	public:
		void KickPlayer(class APlayerState* KickingPlayerState, const class FText& reason);
		bool IsAdmin();
		void GetKickablePlayers(TArray<class APlayerState*>* KickablePlayers);
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.ActivityRouteActor
	 * Size -> 0x0018 (FullSize[0x0238] - InheritedSize[0x0220])
	 */
	class AActivityRouteActor : public AActor
	{
	public:
		TArray<struct FActivityRoute>                                ActivityRoute;                                           // 0x0220(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		struct PCoreUObject_FColor                                   PathColor;                                               // 0x0230(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                      ActivityIdx;                                             // 0x0234(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AIFactionManager
	 * Size -> 0x0058 (FullSize[0x0278] - InheritedSize[0x0220])
	 */
	class AAIFactionManager : public AActor
	{
	public:
		bool                                                         bGroupIntoTeams : 1;                                     // 0x0220(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, d.e.o.i, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0000[0x3];                                   // 0x0221(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                      TeamsOf;                                                 // 0x0224(0x0004) Edit, BlueprintVisible, ZeroConstructor, d.e.o.i, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                         bAssignRandomTeamTactics : 1;                            // 0x0228(0x0001) BIT_FIELD Edit, BlueprintVisible, d.e.o.i, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0001[0x7];                                   // 0x0229(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FFactionTeamTactics>                           TacticsPool;                                             // 0x0230(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, d.e.o.i, Protected, NativeAccessSpecifierProtected
		TArray<struct FFactionSuspectTeam>                           SuspectTeams;                                            // 0x0240(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, d.e.o.tate, EditConst, Protected, NativeAccessSpecifierProtected
		TArray<class ACyberneticCharacter*>                          Characters;                                              // 0x0250(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, d.e.o.tate, EditConst, Protected, NativeAccessSpecifierProtected
		TArray<class ACyberneticCharacter*>                          Leaders;                                                 // 0x0260(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, d.e.o.tate, EditConst, Protected, NativeAccessSpecifierProtected
		float                                                        TeamBehaviourStrengthReductionSpeed;                     // 0x0270(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        TeamBehaviourOverrideStrength;                           // 0x0274(0x0004) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void OnAllAISpawned_Blueprint();
		void OnAISpottedNeutral_Blueprint(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Neutral);
		void OnAISpottedNeutral(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Neutral);
		void OnAISpottedFriendly_Blueprint(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Friendly);
		void OnAISpottedFriendly(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Friendly);
		void OnAISpottedEnemy_Blueprint(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Enemy);
		void OnAISpottedEnemy(class ACyberneticCharacter* Spotter, class AReadyOrNotCharacter* Enemy);
		void OnAIAdded_Blueprint(class ACyberneticCharacter* Character);
		bool IsTeamFull(const struct FFactionSuspectTeam& InTeam);
		bool IsSuspectInTeam(class ASuspectCharacter* InSuspect, struct FFactionSuspectTeam* OutTeam);
		bool GetTeamTacticFor(class ASuspectCharacter* InSuspect, EAITeamTactic* OutTactic);
		int32_t GetTeamIndex(class ASuspectCharacter* InSuspect);
		bool GetSuspectsInTeam(class ASuspectCharacter* InSuspect, TArray<class ASuspectCharacter*>* OutSuspects, bool bIncludeSelf);
		TArray<class ASuspectCharacter*> GetAllSuspects();
		TArray<class ACyberneticCharacter*> GetAllLeaders();
		TArray<class ACivilianCharacter*> GetAllCivilians();
		TArray<class ACyberneticCharacter*> GetAllCharacters();
		class ASuspectCharacter* FindClosestSuspect(TArray<class ASuspectCharacter*> OtherSuspects, class ASuspectCharacter* Suspect, float MaxDistance);
		bool AreTeamSpotsAvailable(int32_t* OutIndex);
		void AlertOtherSuspectsInTeam_Blueprint(class ASuspectCharacter* Suspect, class AReadyOrNotCharacter* Enemy);
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimInputCapsuleLocomotionBlueprintLibrary
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAnimInputCapsuleLocomotionBlueprintLibrary : public UBlueprintFunctionLibrary
	{
	public:
		void UpdateCapsuleLocomotionAnimInput(class APawn* Pawn, struct FAnimInput_CapsuleLocomotion* CapsuleLocomotionAnimInput);
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_AIDoorBreachKick
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_AIDoorBreachKick : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.ResourceComponent
	 * Size -> 0x0058 (FullSize[0x0108] - InheritedSize[0x00B0])
	 */
	class UResourceComponent : public UActorComponent
	{
	public:
		class UMulticastInlineDelegate                               OnFullResource;                                          // 0x00B0(0x0001) ELEMENT_SIZE_MISMATCH ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0xF];                                   // 0x00B1(0x000F) FIX WRONG SIZE OF PREVIOUS PROPERTY
		class UMulticastInlineDelegate                               OnLowResource;                                           // 0x00C0(0x0001) ELEMENT_SIZE_MISMATCH ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0001[0xF];                                   // 0x00C1(0x000F) FIX WRONG SIZE OF PREVIOUS PROPERTY
		class UMulticastInlineDelegate                               OnDepletedResource;                                      // 0x00D0(0x0001) ELEMENT_SIZE_MISMATCH ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0002[0xF];                                   // 0x00D1(0x000F) FIX WRONG SIZE OF PREVIOUS PROPERTY
		class FName                                                  ResourceName;                                            // 0x00E0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, d.e.o.i, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        Resource;                                                // 0x00E8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        MaxResource;                                             // 0x00EC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, d.e.o.i, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        MaxResourceLimit;                                        // 0x00F0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, d.e.o.i, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        LowResourceThreshold;                                    // 0x00F4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, d.e.o.i, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        OriginalMaxResource;                                     // 0x00F8(0x0004) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        LowResource;                                             // 0x00FC(0x0004) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        PreviousResource;                                        // 0x0100(0x0004) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                         bUnlimited : 1;                                          // 0x0104(0x0001) BIT_FIELD BlueprintVisible, BlueprintReadOnly, Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0003[0x3];                                   // 0x0105(0x0003) MISSED OFFSET (PADDING)

	public:
		void UpdatePreviousResource();
		void ToggleUnlimitedResource();
		void SetUnlimitedResource(bool bEnabled);
		void SetResource(float NewResourceAmount);
		void SetMaxResource(float NewMaxResource);
		void SetCurrentResourceToMax();
		void Server_UpdatePreviousResource();
		void Server_ToggleUnlimitedResource();
		void Server_SetUnlimitedResource(bool bEnabled);
		void Server_SetResource(float NewResourceAmount);
		void Server_SetMaxResource(float NewMaxResource);
		void Server_SetCurrentResourceToMax();
		void Server_ResetResource();
		void Server_InitResource();
		void Server_IncreaseResource(float Amount);
		void Server_EnableUnlimitedResource();
		void Server_DisableUnlimitedResource();
		void Server_DepleteResource();
		void Server_DecreaseResource(float Amount);
		void ResetResource();
		void OnLowResourceSignature__DelegateSignature(float Resource);
		void OnFullResourceSignature__DelegateSignature();
		void OnDepletedResourceSignature__DelegateSignature();
		bool IsUnlimitedResourceEnabled();
		bool IsResourceBelow(float ResourceValue);
		bool IsResourceAtOrBelow(float ResourceValue);
		bool IsResourceAtOrAbove(float ResourceValue);
		bool IsResourceAt(float ResourceValue);
		bool IsResourceAbove(float ResourceValue);
		bool IsLowResource();
		bool IsHalfResource();
		bool IsFullResource();
		bool IsDepleted();
		void IncreaseResourceByRate(float Rate);
		float IncreaseResource_Expression(float Amount);
		void IncreaseResource(float Amount);
		bool HasResource();
		class FName GetResourceName();
		float GetPreviousResource();
		float GetOriginalMaxResource();
		float GetNormalizedResource();
		float GetMaxResource();
		float GetLowResourceThreshold();
		float GetLowResource();
		float GetHalfResource();
		float GetCurrentResource();
		void EnableUnlimitedResource();
		void DisableUnlimitedResource();
		void DepleteResource();
		void DecreaseResourceByRate(float Rate);
		float DecreaseResource_Expression(float Amount);
		void DecreaseResource(float Amount);
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AIAction
	 * Size -> 0x0020 (FullSize[0x0048] - InheritedSize[0x0028])
	 */
	class UAIAction : public UObject
	{
	public:
		unsigned char                                                UnknownData_0000[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ACyberneticController*                                 OwningController;                                        // 0x0030(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0001[0x4];                                   // 0x0038(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                      LastMoveRequestPathID;                                   // 0x003C(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                      LastMoveRequestMoveID;                                   // 0x0040(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0002[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (PADDING)

	public:
		bool WantsAbort();
		void Tick_Blueprint(float DeltaTime);
		bool ShouldPerformAction();
		void RequestMove(const struct FVector& Location);
		void OnSucceededToConsider_Blueprint();
		void OnPathFound_Blueprint(int32_t PathId, ERonNavigationQueryResult Result);
		void OnPathFound(int32_t PathId, ERonNavigationQueryResult Result);
		void OnMoveComplete_Blueprint(class AAIController* Controller, int32_t RequestID);
		void OnMoveComplete(class AAIController* Controller, int32_t RequestID);
		void OnFailedToConsider_Blueprint();
		void OnCreate_Blueprint(class ACyberneticController* Controller);
		void InitAction_Blueprint(class ACyberneticController* Controller);
		class ACyberneticCharacter* GetCharacter();
		int32_t GetActionRunCount();
		struct FAIActionData GetActionData();
		void EndAction_Blueprint();
		void BeginAction_Blueprint();
		void AbortAction();
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_AIDoorBreachShotgun
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_AIDoorBreachShotgun : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AISafeZone
	 * Size -> 0x0000 (FullSize[0x0228] - InheritedSize[0x0228])
	 */
	class AAISafeZone : public ATriggerBox
	{
	public:
		void OnOverlapEnd(class AActor* OverlappedActor, class AActor* OtherActor);
		void OnOverlapBegin(class AActor* OverlappedActor, class AActor* OtherActor);
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_Breach_C2Placed
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_Breach_C2Placed : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_AIThrowGrenadeComplete
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_AIThrowGrenadeComplete : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_ChangeBodySocket
	 * Size -> 0x0010 (FullSize[0x0048] - InheritedSize[0x0038])
	 */
	class UAnimNotify_ChangeBodySocket : public UAnimNotify
	{
	public:
		EItemCategory                                                ItemCategory;                                            // 0x0038(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                                UnknownData_0000[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                  Socket;                                                  // 0x003C(0x0008) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                                UnknownData_0001[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_AIThrowPendingItem
	 * Size -> 0x0048 (FullSize[0x0080] - InheritedSize[0x0038])
	 */
	class UAnimNotify_AIThrowPendingItem : public UAnimNotify
	{
	public:
		class FName                                                  BoneToSpawnOn;                                           // 0x0038(0x0008) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct PCoreUObject_FTransform                               RelativeTransform;                                       // 0x0040(0x0030) Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected
		bool                                                         bCustomThrowDirection : 1;                               // 0x0070(0x0001) BIT_FIELD Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0000[0x3];                                   // 0x0071(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRotator                                 ThrowDirection;                                          // 0x0074(0x000C) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AIActionConsideration
	 * Size -> 0x00B0 (FullSize[0x00D8] - InheritedSize[0x0028])
	 */
	class UAIActionConsideration : public UObject
	{
	public:
		bool                                                         bManualCurveEdit : 1;                                    // 0x0028(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                         bCustomCurveFunction : 1;                                // 0x0028(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EEasingFunc                                                  CurveType;                                               // 0x0029(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                         bInverseX : 1;                                           // 0x002A(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                         bInverseY : 1;                                           // 0x002A(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                         bClamp : 1;                                              // 0x002A(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0000[0x5];                                   // 0x002B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRuntimeFloatCurve                                    Curve;                                                   // 0x0030(0x0088) Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected
		bool                                                         bCustomRange : 1;                                        // 0x00B8(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, d.e.o.tate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0001[0x3];                                   // 0x00B9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                        MinRange;                                                // 0x00BC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, d.e.o.tate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        MaxRange;                                                // 0x00C0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, d.e.o.tate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        OffsetX;                                                 // 0x00C4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        OffsetY;                                                 // 0x00C8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                        Exponent;                                                // 0x00CC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                      SubStep;                                                 // 0x00D0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ERichCurveInterpMode                                         InterpMode;                                              // 0x00D4(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ERichCurveTangentMode                                        TangentMode;                                             // 0x00D5(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0002[0x2];                                   // 0x00D6(0x0002) MISSED OFFSET (PADDING)

	public:
		float Score(const struct FAIActionDecisionContext& Context, bool* bSuccess);
		float EvaluateResponseCurve(float Score);
		float CalculateCurve(float X);
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_EquipItemOfClass
	 * Size -> 0x0010 (FullSize[0x0048] - InheritedSize[0x0038])
	 */
	class UAnimNotify_EquipItemOfClass : public UAnimNotify
	{
	public:
		class ABaseItem*                                             ItemClass;                                               // 0x0038(0x0008) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                         bInstant : 1;                                            // 0x0040(0x0001) BIT_FIELD Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                         bAIOnly : 1;                                             // 0x0040(0x0001) BIT_FIELD Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0000[0x7];                                   // 0x0041(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_ApplyArteryDamage
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_ApplyArteryDamage : public UAnimNotify
	{
	public:
		class FName                                                  ArteryBoneName;                                          // 0x0038(0x0008) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_ChangeCombatMove
	 * Size -> 0x0010 (FullSize[0x0048] - InheritedSize[0x0038])
	 */
	class UAnimNotify_ChangeCombatMove : public UAnimNotify
	{
	public:
		TArray<class UBaseCombatMoveActivity*>                       PossibleCombatMoves;                                     // 0x0038(0x0010) Edit, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_EquipLastItem
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_EquipLastItem : public UAnimNotify
	{
	public:
		bool                                                         bInstant : 1;                                            // 0x0038(0x0001) BIT_FIELD Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                                UnknownData_0000[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_MirrorDoor
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_MirrorDoor : public UAnimNotify
	{
	public:
		bool                                                         bMirrorFinish : 1;                                       // 0x0038(0x0001) BIT_FIELD Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0000[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_ApplyMeleeDamage
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_ApplyMeleeDamage : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_ForceFireWeapon
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_ForceFireWeapon : public UAnimNotify
	{
	public:
		float                                                        Chance;                                                  // 0x0038(0x0004) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                         bNoEnemyRequired;                                        // 0x003C(0x0001) Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0000[0x3];                                   // 0x003D(0x0003) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AmmoComponent
	 * Size -> 0x0008 (FullSize[0x0110] - InheritedSize[0x0108])
	 */
	class UAmmoComponent : public UResourceComponent
	{
	public:
		float                                                        AmmoUsagePerSecond;                                      // 0x0108(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, d.e.o.i, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0000[0x4];                                   // 0x010C(0x0004) MISSED OFFSET (PADDING)

	public:
		float GetAmmoUsagePerSecond();
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_NextMag
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_NextMag : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_GetupComplete
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_GetupComplete : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_ForceRagdoll
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_ForceRagdoll : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_CollectEvidence
	 * Size -> 0x0008 (FullSize[0x0040] - InheritedSize[0x0038])
	 */
	class UAnimNotify_CollectEvidence : public UAnimNotify
	{
	public:
		bool                                                         bCollectFinished : 1;                                    // 0x0038(0x0001) BIT_FIELD Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                                UnknownData_0000[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_OnCheckedDoor
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_OnCheckedDoor : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_CompleteHeal
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_CompleteHeal : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AnimNotify_Breach_C2Detonate
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UAnimNotify_Breach_C2Detonate : public UAnimNotify
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.AmmoRefillBox
	 * Size -> 0x0038 (FullSize[0x0258] - InheritedSize[0x0220])
	 */
	class AAmmoRefillBox : public AActor
	{
	public:
		unsigned char                                                UnknownData_0000[0x8];                                   // 0x0220(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UInteractableComponent*                                InteractableComponent;                                   // 0x0228(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, d.e.o.i, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                                UnknownData_0001[0x8];                                   // 0x0230(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AReadyOrNotCharacter*                                  RefillCharacter;                                         // 0x0238(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0002[0x18];                                  // 0x0240(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ReadyOrNot.ReadyOrNotGameMode
	 * Size -> 0x0490 (FullSize[0x0750] - InheritedSize[0x02C0])
	 */
	class AReadyOrNotGameMode : public AGameModeBase
	{
	public:
		unsigned char                                                UnknownData_0000[0x58];                                  // 0x02C0(0x0058) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDataTableRowHandle                                   GameModeSettings;                                        // 0x0318(0x0010) Edit, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0001[0x60];                                  // 0x0328(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class AReadyOrNotCharacter*, int32_t>                   AbuseCountMap;                                           // 0x0388(0x0050) BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
		bool                                                         bIsCampaignTransitioning;                                // 0x03D8(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0002[0x7];                                   // 0x03D9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTimerHandle                                          Reinforcement_Handle;                                    // 0x03E0(0x0008) NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bRunWarmup;                                              // 0x03E8(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bArrestSpectator;                                        // 0x03E9(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bAllowLoadouts;                                          // 0x03EA(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0003[0x1];                                   // 0x03EB(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                      MaxPlayersAllowed;                                       // 0x03EC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bEnabledForPlay;                                         // 0x03F0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0004[0x7];                                   // 0x03F1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                                urlShortName;                                            // 0x03F8(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                                Password;                                                // 0x0408(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor*                                                PlayerStartClass;                                        // 0x0418(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class ASpectatePawn*                                         DeadSpectatorClass;                                      // 0x0420(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                  LobbyStartTag;                                           // 0x0428(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                  RedCustomizationStartTag;                                // 0x0430(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                  BlueCustomizationStartTag;                               // 0x0438(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                  SWATBlueStartTag;                                        // 0x0440(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                  SWATRedStartTag;                                         // 0x0448(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                  SuspectStartTag;                                         // 0x0450(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bSpectateKillerOnDeath;                                  // 0x0458(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bInitialPlayerRespawn;                                   // 0x0459(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bDrawPlayerCameraSphere : 1;                             // 0x045A(0x0001) BIT_FIELD BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0005[0x5];                                   // 0x045B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UMulticastInlineDelegate                               OnMatchStarted;                                          // 0x0460(0x0001) ELEMENT_SIZE_MISMATCH ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0006[0xF];                                   // 0x0461(0x000F) FIX WRONG SIZE OF PREVIOUS PROPERTY
		ERespawnMode                                                 RespawnMode;                                             // 0x0470(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
