#pragma once

/**
 * Name: ron
 * Version: 25346
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace SDK
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum ReadyOrNot.EItemCategory
	 */
	enum class EItemCategory : uint8_t
	{
		IC_None              = 0,
		IC_Primary           = 1,
		IC_Secondary         = 2,
		IC_Grenade           = 3,
		IC_Gadget            = 4,
		IC_Magazine          = 5,
		IC_Helmet            = 6,
		IC_Helmet_Light      = 7,
		IC_Headset           = 8,
		IC_Goggles           = 9,
		IC_Chest             = 10,
		IC_Watch             = 11,
		IC_Radio             = 12,
		IC_NVG               = 13,
		IC_UseableWithShield = 14,
		IC_Grenade_Keybind1  = 15,
		IC_Grenade_Keybind2  = 16,
		IC_Grenade_Keybind3  = 17,
		IC_Grenade_Keybind4  = 18,
		IC_Device_Keybind1   = 19,
		IC_Device_Keybind2   = 20,
		IC_Device_Keybind3   = 21,
		IC_Device_Keybind4   = 22,
		IC_Badge_Armour      = 23,
		IC_OCSpray           = 24,
		IC_Multitool         = 25,
		IC_Zipcuffs          = 26,
		IC_Armor             = 27,
		IC_Chemlight         = 28,
		IC_Shield            = 29,
		IC_Flashbang         = 30,
		IC_Ninebang          = 31,
		IC_CSGas             = 32,
		IC_Stingball         = 33,
		IC_Optiwand          = 34,
		IC_Beanbag           = 35,
		IC_Taser             = 36,
		IC_Pepperball        = 37,
		IC_C2Explosive       = 38,
		IC_Detonator         = 39,
		IC_Doorjam           = 40,
		IC_BatteringRam      = 41,
		IC_BreachingShotgun  = 42,
		IC_Tablet            = 43,
		IC_TacticalDevice    = 44,
		IC_LongTactical      = 45,
		IC_GasMask           = 46,
		IC_Launcher          = 47,
		IC_MedicalKit        = 48,
		IC_LockpickGun       = 49,
		IC_Shotgun           = 50,
		IC_MAX               = 51
	};

	/**
	 * Enum ReadyOrNot.EBlockingAnimationExclusion
	 */
	enum class EBlockingAnimationExclusion : uint8_t
	{
		BAE_None       = 0,
		BAE_Holster    = 1,
		BAE_Draw       = 2,
		BAE_FireSelect = 3,
		BAE_MagCheck   = 4,
		BAE_PullPin    = 5,
		BAE_Throw      = 6,
		BAE_MAX        = 7
	};

	/**
	 * Enum ReadyOrNot.EActorOutlineType
	 */
	enum class EActorOutlineType : uint8_t
	{
		Outline     = 0,
		Outline01   = 1,
		Outline02   = 2,
		Outline03   = 3,
		Outline04   = 4,
		Outline05   = 5,
		Outline06   = 6,
		Outline_MAX = 7
	};

	/**
	 * Enum ReadyOrNot.EStunType
	 */
	enum class EStunType : uint8_t
	{
		ST_None          = 0,
		ST_Tased         = 1,
		ST_Gassed        = 2,
		ST_Flash         = 3,
		ST_Stung         = 4,
		ST_Peppersprayed = 5,
		ST_Beanbag       = 6,
		ST_MAX           = 7
	};

	/**
	 * Enum ReadyOrNot.EMotionBlockType
	 */
	enum class EMotionBlockType : uint8_t
	{
		MB_None      = 0,
		MB_Rifle     = 1,
		MB_Pistol    = 2,
		MB_Item      = 3,
		MB_HeavyItem = 4,
		MB_Special   = 5,
		MB_Unarmed   = 6,
		MB_MAX       = 7
	};

	/**
	 * Enum ReadyOrNot.EItemAttachment
	 */
	enum class EItemAttachment : uint8_t
	{
		IA_None       = 0,
		IA_Flashlight = 1,
		IA_NVG        = 2,
		IA_MAX        = 3
	};

	/**
	 * Enum ReadyOrNot.EWeaponType
	 */
	enum class EWeaponType : uint8_t
	{
		WT_None             = 0,
		WT_Rifles           = 1,
		WT_SubmachineGun    = 2,
		WT_Shotgun          = 3,
		WT_PistolsLethal    = 4,
		WT_PistolsNonLethal = 5,
		WT_PrimaryNonLethal = 6,
		WT_Launcher         = 7,
		WT_Special          = 8,
		WT_Unarmed          = 9,
		WT_MAX              = 10
	};

	/**
	 * Enum ReadyOrNot.EDoorDamageType
	 */
	enum class EDoorDamageType : uint8_t
	{
		DDT_None        = 0,
		DDT_Blasting    = 1,
		DDT_Shotgunning = 2,
		DDT_Ramming     = 3,
		DDT_Kicking     = 4,
		DDT_MAX         = 5
	};

	/**
	 * Enum ReadyOrNot.EItemClass
	 */
	enum class EItemClass : uint8_t
	{
		IC_NoClass        = 0,
		IC_AssaultRifle   = 1,
		IC_SMG            = 2,
		IC_LMG            = 3,
		IC_Pistol         = 4,
		IC_Sniper         = 5,
		IC_Melee          = 6,
		IC_LessLethal     = 7,
		IC_Shotgun        = 8,
		IC_Launcher       = 9,
		IC_Grenade        = 10,
		IC_Shield         = 11,
		IC_Armor          = 12,
		IC_Headgear       = 13,
		IC_TacticalDevice = 14,
		IC_LongTactical   = 15,
		IC_Officer        = 16,
		IC_Uniform        = 17,
		IC_Plates         = 18,
		IC_Patches        = 19,
		IC_MAX            = 20
	};

	/**
	 * Enum ReadyOrNot.EDLC
	 */
	enum class EDLC : uint8_t
	{
		DLC_None          = 0,
		DLC_Supporter     = 1,
		DLC_PreorderBonus = 2,
		DLC_MAX           = 3
	};

	/**
	 * Enum ReadyOrNot.EDoorInteraction
	 */
	enum class EDoorInteraction : uint8_t
	{
		None      = 0,
		Open      = 1,
		Close     = 2,
		Peek      = 3,
		Push      = 4,
		Kick      = 5,
		Kick_Fail = 6,
		Ram       = 7,
		MAX       = 8
	};

	/**
	 * Enum ReadyOrNot.EReloadAnimEvent
	 */
	enum class EReloadAnimEvent : uint8_t
	{
		RAE_MagIn           = 0,
		RAE_MagOut          = 1,
		RAE_MagInQuick      = 2,
		RAE_MagOutQuick     = 3,
		RAE_BoltClosed      = 4,
		RAE_BoltClosedQuick = 5,
		RAE_BoltOpened      = 6,
		RAE_BoltOpenedQuick = 7,
		RAE_MAX             = 8
	};

	/**
	 * Enum ReadyOrNot.EStackupGenArea
	 */
	enum class EStackupGenArea : uint8_t
	{
		SGA_None       = 0,
		SGA_FrontLeft  = 1,
		SGA_FrontRight = 2,
		SGA_BackLeft   = 3,
		SGA_BackRight  = 4,
		SGA_All        = 5,
		SGA_MAX        = 6
	};

	/**
	 * Enum ReadyOrNot.EStackupGenType
	 */
	enum class EStackupGenType : uint8_t
	{
		SG_90DegreeLine = 0,
		SG_0DegreeLine  = 1,
		SG_MAX          = 2
	};

	/**
	 * Enum ReadyOrNot.ETrapType
	 */
	enum class ETrapType : uint8_t
	{
		Alarm     = 0,
		Flashbang = 1,
		Explosive = 2,
		Unknown   = 3,
		MAX       = 4
	};

	/**
	 * Enum ReadyOrNot.ETrapSetup
	 */
	enum class ETrapSetup : uint8_t
	{
		Automatic = 0,
		Manual    = 1,
		MAX       = 2
	};

	/**
	 * Enum ReadyOrNot.EBombState
	 */
	enum class EBombState : uint8_t
	{
		BS_None     = 0,
		BS_Active   = 1,
		BS_Disabled = 2,
		BS_Exploded = 3,
		BS_MAX      = 4
	};

	/**
	 * Enum ReadyOrNot.EClueState
	 */
	enum class EClueState : uint8_t
	{
		Unclaimed = 0,
		Collected = 1,
		Dropped   = 2,
		MAX       = 3
	};

	/**
	 * Enum ReadyOrNot.ETeamType
	 */
	enum class ETeamType : uint8_t
	{
		TT_NONE      = 0,
		TT_SERT_RED  = 1,
		TT_SERT_BLUE = 2,
		TT_SUSPECT   = 3,
		TT_CIVILIAN  = 4,
		TT_SQUAD     = 5,
		TT_MAX       = 6
	};

	/**
	 * Enum ReadyOrNot.EVoiceType
	 */
	enum class EVoiceType : uint8_t
	{
		VT_Local = 0,
		VT_Team  = 1,
		VT_MAX   = 2
	};

	/**
	 * Enum ReadyOrNot.EArmourCoverage
	 */
	enum class EArmourCoverage : uint8_t
	{
		AC_None           = 0,
		AC_FrontOnly      = 1,
		AC_FrontBack      = 2,
		AC_FrontBackSides = 3,
		AC_MAX            = 4
	};

	/**
	 * Enum ReadyOrNot.ELimbType
	 */
	enum class ELimbType : uint8_t
	{
		LT_None     = 0,
		LT_RightLeg = 1,
		LT_LeftLeg  = 2,
		LT_RightArm = 3,
		LT_LeftArm  = 4,
		LT_Head     = 5,
		LT_MAX      = 6
	};

	/**
	 * Enum ReadyOrNot.EPlayerHealthStatus
	 */
	enum class EPlayerHealthStatus : uint8_t
	{
		HS_Healthy       = 0,
		HS_Injured       = 1,
		HS_Downed        = 2,
		HS_Incapacitated = 3,
		HS_Dead          = 4,
		HS_Arrested      = 5,
		HS_NotAvailable  = 6,
		HS_MAX           = 7
	};

	/**
	 * Enum ReadyOrNot.EAnimWeaponType
	 */
	enum class EAnimWeaponType : uint8_t
	{
		CWT_Unarmed     = 0,
		CWT_Pistol      = 1,
		CWT_Rifle       = 2,
		CWT_Arrested    = 3,
		CWT_Surrendered = 4,
		CWT_Any         = 5,
		CWT_MAX         = 6
	};

	/**
	 * Enum ReadyOrNot.ECharacterEmotion
	 */
	enum class ECharacterEmotion : uint8_t
	{
		None   = 0,
		Angry  = 1,
		Wince  = 2,
		Sad    = 3,
		Afraid = 4,
		Alert  = 5,
		MAX    = 6
	};

	/**
	 * Enum ReadyOrNot.ESquadPosition
	 */
	enum class ESquadPosition : uint8_t
	{
		SP_Alpha   = 0,
		SP_Beta    = 1,
		SP_Charlie = 2,
		SP_Delta   = 3,
		SP_Foxtrot = 4,
		SP_NONE    = 5,
		SP_MAX     = 6
	};

	/**
	 * Enum ReadyOrNot.ECharacterDeathReason
	 */
	enum class ECharacterDeathReason : uint8_t
	{
		None                   = 0,
		PrimaryWeapon          = 1,
		SecondaryWeapon        = 2,
		TasedToDeath           = 3,
		FellFromHighHeight     = 4,
		Suicide                = 5,
		Headshot               = 6,
		Bleedout               = 7,
		Grenade                = 8,
		Explosion              = 9,
		MultipleUnhealedWounds = 10,
		MAX                    = 11
	};

	/**
	 * Enum ReadyOrNot.EGibAreas
	 */
	enum class EGibAreas : uint8_t
	{
		GA_None     = 0,
		GA_LeftLeg  = 1,
		GA_RightLeg = 2,
		GA_LeftArm  = 3,
		GA_RightArm = 4,
		GA_Head     = 5,
		GA_MAX      = 6
	};

	/**
	 * Enum ReadyOrNot.ELedgeHeight
	 */
	enum class ELedgeHeight : uint8_t
	{
		LH_None   = 0,
		LH_Step   = 1,
		LH_Vault  = 2,
		LH_Mantle = 3,
		LH_MAX    = 4
	};

	/**
	 * Enum ReadyOrNot.ELedgeWidth
	 */
	enum class ELedgeWidth : uint8_t
	{
		LW_None  = 0,
		LW_Ledge = 1,
		LW_Rail  = 2,
		LW_Fall  = 3,
		LW_MAX   = 4
	};

	/**
	 * Enum ReadyOrNot.EHolsterAnimationType
	 */
	enum class EHolsterAnimationType : uint8_t
	{
		HAT_Normal            = 0,
		HAT_SkipHolster       = 1,
		HAT_AlwaysPlayHolster = 2,
		HAT_MAX               = 3
	};

	/**
	 * Enum ReadyOrNot.EMultitoolFunctions
	 */
	enum class EMultitoolFunctions : uint8_t
	{
		MF_None       = 0,
		MF_Lockpick   = 1,
		MF_Knife      = 2,
		MF_Wirecutter = 3,
		MF_MAX        = 4
	};

	/**
	 * Enum ReadyOrNot.ELightRadialSelection
	 */
	enum class ELightRadialSelection : uint8_t
	{
		LR_None        = 0,
		LR_NVGs        = 1,
		LR_WeaponLight = 2,
		LR_Chemlight   = 3,
		LR_MAX         = 4
	};

	/**
	 * Enum ReadyOrNot.EMatchState
	 */
	enum class EMatchState : uint8_t
	{
		MS_None             = 0,
		MS_Warmup           = 1,
		MS_Playing          = 2,
		MS_RoundEnded       = 3,
		MS_MatchEnded       = 4,
		MS_GoingToNextLevel = 5,
		MS_MAX              = 6
	};

	/**
	 * Enum ReadyOrNot.ETrapState
	 */
	enum class ETrapState : uint8_t
	{
		TS_Live      = 0,
		TS_Activated = 1,
		TS_Disabled  = 2,
		TS_MAX       = 3
	};

	/**
	 * Enum ReadyOrNot.EAIAwarenessState
	 */
	enum class EAIAwarenessState : uint8_t
	{
		Unalerted  = 0,
		Suspicious = 1,
		Alerted    = 2,
		MAX        = 3
	};

	/**
	 * Enum ReadyOrNot.ERonNavigationQueryResult
	 */
	enum class ERonNavigationQueryResult : uint8_t
	{
		Invalid = 0,
		Error   = 1,
		Fail    = 2,
		Success = 3,
		MAX     = 4
	};

	/**
	 * Enum ReadyOrNot.ESwatCommand
	 */
	enum class ESwatCommand : uint8_t
	{
		SC_None                   = 0,
		SC_MoveTo                 = 1,
		SC_FallIn                 = 2,
		SC_Cover                  = 3,
		SC_Hold                   = 4,
		SC_Resume                 = 5,
		SC_DeployFlashbang        = 6,
		SC_DeployStinger          = 7,
		SC_DeployCSGas            = 8,
		SC_DeployChemlight        = 9,
		SC_ConfirmArrest          = 10,
		SC_ConfirmCollectEvidence = 11,
		SC_ConfirmDisarmTrap      = 12,
		SC_DoArrestTarget         = 13,
		SC_DoCollectEvidence      = 14,
		SC_DoReportTarget         = 15,
		SC_DisarmStandaloneTrap   = 16,
		SC_KillMe                 = 17,
		SC_StackUp                = 18,
		SC_CheckDoor              = 19,
		SC_PickLock               = 20,
		SC_RemoveDoorJam          = 21,
		SC_DeployMirrorgun        = 22,
		SC_DeployDoorJam          = 23,
		SC_CheckForTrap           = 24,
		SC_DisarmTrap             = 25,
		SC_OpenDoor               = 26,
		SC_CloseDoor              = 27,
		SC_MoveAndClear           = 28,
		SC_MoveAndClearFlashbang  = 29,
		SC_MoveAndClearStinger    = 30,
		SC_MoveAndClearCSGas      = 31,
		SC_OpenAndClear           = 32,
		SC_OpenAndClearFlashbang  = 33,
		SC_OpenAndClearStinger    = 34,
		SC_OpenAndClearCSGas      = 35,
		SC_KickAndClear           = 36,
		SC_KickAndClearFlashbang  = 37,
		SC_KickAndClearStinger    = 38,
		SC_KickAndClearCSGas      = 39,
		SC_ShotgunClear           = 40,
		SC_ShotgunClearFlashbang  = 41,
		SC_ShotgunClearStinger    = 42,
		SC_ShotgunClearCSGas      = 43,
		SC_C2Clear                = 44,
		SC_C2ClearFlashbang       = 45,
		SC_C2ClearStinger         = 46,
		SC_C2ClearCSGas           = 47,
		SC_Execute                = 48,
		SC_Cancel                 = 49,
		SC_ProceedToNextStage     = 50,
		SC_ClearFully             = 51,
		SC_AbortClear             = 52,
		SC_DeployShield           = 53,
		SC_MAX                    = 54
	};

	/**
	 * Enum ReadyOrNot.ERespawnMode
	 */
	enum class ERespawnMode : uint8_t
	{
		NoRespawn        = 0,
		ImmediateRespawn = 1,
		DelayedRespawn   = 2,
		MAX              = 3
	};

	/**
	 * Enum ReadyOrNot.ESurrenderExitType
	 */
	enum class ESurrenderExitType : uint8_t
	{
		None    = 0,
		Default = 1,
		Gun     = 2,
		Knife   = 3,
		MAX     = 4
	};

	/**
	 * Enum ReadyOrNot.ESelectedSpawn
	 */
	enum class ESelectedSpawn : uint8_t
	{
		SS_None        = 0,
		SS_FirstSpawn  = 1,
		SS_SecondSpawn = 2,
		SS_ThirdSpawn  = 3,
		SS_FourthSpawn = 4,
		SS_MAX         = 5
	};

	/**
	 * Enum ReadyOrNot.EPlanningLineTeam
	 */
	enum class EPlanningLineTeam : uint8_t
	{
		PLT_Gold = 0,
		PLT_Red  = 1,
		PLT_Blue = 2,
		PLT_MAX  = 3
	};

	/**
	 * Enum ReadyOrNot.EVoteState
	 */
	enum class EVoteState : uint8_t
	{
		Undecided = 0,
		Yes       = 1,
		No        = 2,
		MAX       = 3
	};

	/**
	 * Enum ReadyOrNot.EFreeDrawColor
	 */
	enum class EFreeDrawColor : uint8_t
	{
		FDC_Black  = 0,
		FDC_Red    = 1,
		FDC_Blue   = 2,
		FDC_Gold   = 3,
		FDC_Green  = 4,
		FDC_Purple = 5,
		FDC_Orange = 6,
		FDC_Cyan   = 7,
		FDC_MAX    = 8
	};

	/**
	 * Enum ReadyOrNot.EWeaponUnderbarrelAnimationType
	 */
	enum class EWeaponUnderbarrelAnimationType : uint8_t
	{
		WU_None     = 0,
		WU_VFG      = 1,
		WU_AFG      = 2,
		WU_Handstop = 3,
		WU_MAX      = 4
	};

	/**
	 * Enum ReadyOrNot.EKillfeedType
	 */
	enum class EKillfeedType : uint8_t
	{
		KT_None      = 0,
		KT_Kill      = 1,
		KT_Arrest    = 2,
		KT_Free      = 3,
		KT_Recovered = 4,
		KT_Death     = 5,
		KT_MAX       = 6
	};

	/**
	 * Enum ReadyOrNot.EFireMode
	 */
	enum class EFireMode : uint8_t
	{
		FM_Single     = 0,
		FM_Auto       = 1,
		FM_Burst      = 2,
		FM_Continuous = 3,
		FM_Safe       = 4,
		FM_MAX        = 5
	};

	/**
	 * Enum ReadyOrNot.EEvidenceActorState
	 */
	enum class EEvidenceActorState : uint8_t
	{
		Unclaimed  = 0,
		Collected  = 1,
		Extraction = 2,
		Dropped    = 3,
		MAX        = 4
	};

	/**
	 * Enum ReadyOrNot.ELastMenuStateBeforeJoin
	 */
	enum class ELastMenuStateBeforeJoin : uint8_t
	{
		LM_None          = 0,
		LM_ServerBrowser = 1,
		LM_FromFriends   = 2,
		LM_SinglePlayer  = 3,
		LM_MAX           = 4
	};

	/**
	 * Enum ReadyOrNot.EPersonnel
	 */
	enum class EPersonnel : uint8_t
	{
		PERS_None               = 0,
		PERS_TruckDriver        = 1,
		PERS_NoisemakerOperator = 2,
		PERS_VentilationExpert  = 3,
		PERS_Spotter            = 4,
		PERS_Marksman           = 5,
		PERS_Sniper             = 6,
		PERS_FloodlightOperator = 7,
		PERS_PowerCrew          = 8,
		PERS_Negotiator         = 9,
		PERS_MAX                = 10
	};

	/**
	 * Enum ReadyOrNot.ELoginState
	 */
	enum class ELoginState : uint8_t
	{
		LS_None      = 0,
		LS_LoggingIn = 1,
		LS_LoggedIn  = 2,
		LS_LoggedOut = 3,
		LS_LoginFail = 4,
		LS_MAX       = 5
	};

	/**
	 * Enum ReadyOrNot.ERadialCursorBehaviour
	 */
	enum class ERadialCursorBehaviour : uint8_t
	{
		RCB_Clamped    = 0,
		RCB_Continuous = 1,
		RCB_MAX        = 2
	};

	/**
	 * Enum ReadyOrNot.ESessionType
	 */
	enum class ESessionType : uint8_t
	{
		ST_None         = 0,
		ST_SinglePlayer = 1,
		ST_Public       = 2,
		ST_Friends      = 3,
		ST_MAX          = 4
	};

	/**
	 * Enum ReadyOrNot.EToggleBoneVis
	 */
	enum class EToggleBoneVis : uint8_t
	{
		TBV_None     = 0,
		TBV_HideBone = 1,
		TBV_ShowBone = 2,
		TBV_MAX      = 3
	};

	/**
	 * Enum ReadyOrNot.EActorAnalyticsState
	 */
	enum class EActorAnalyticsState : uint8_t
	{
		AAS_None     = 0,
		AAS_Wounded  = 1,
		AAS_Dead     = 2,
		AAS_Arrested = 3,
		AAS_MAX      = 4
	};

	/**
	 * Enum ReadyOrNot.EMusicState
	 */
	enum class EMusicState : uint8_t
	{
		MS_Preplanning = 0,
		MS_Ambient     = 1,
		MS_Action      = 2,
		MS_Scripted    = 3,
		MS_MAX         = 4
	};

	/**
	 * Enum ReadyOrNot.EMirrorContactType
	 */
	enum class EMirrorContactType : uint8_t
	{
		AI     = 0,
		Trap   = 1,
		Custom = 2,
		Both   = 3,
		MAX    = 4
	};

	/**
	 * Enum ReadyOrNot.ERadialMenuCloseReason
	 */
	enum class ERadialMenuCloseReason : uint8_t
	{
		MCR_UserClosed  = 0,
		MCR_ForceClosed = 1,
		MCR_MAX         = 2
	};

	/**
	 * Enum ReadyOrNot.EScenarioImportance
	 */
	enum class EScenarioImportance : uint8_t
	{
		SI_None        = 0,
		SI_AlwaysSpawn = 1,
		SI_Pooled      = 2,
		SI_MAX         = 3
	};

	/**
	 * Enum ReadyOrNot.EMatchmakingStatus
	 */
	enum class EMatchmakingStatus : uint8_t
	{
		MS_None        = 0,
		MS_Matchmaking = 1,
		MS_Success     = 2,
		MS_Failure     = 3,
		MS_Cancelled   = 4,
		MS_MAX         = 5
	};

	/**
	 * Enum ReadyOrNot.EEquippingSwat
	 */
	enum class EEquippingSwat : uint8_t
	{
		ES_None    = 0,
		ES_BlueOne = 1,
		ES_BlueTwo = 2,
		ES_RedOne  = 3,
		ES_RedTwo  = 4,
		ES_MAX     = 5
	};

	/**
	 * Enum ReadyOrNot.EThreatLevel
	 */
	enum class EThreatLevel : uint8_t
	{
		TL_None    = 0,
		TL_Low     = 1,
		TL_Medium  = 2,
		TL_High    = 3,
		TL_Extreme = 4,
		TL_MAX     = 5
	};

	/**
	 * Enum ReadyOrNot.EPathedAwareness
	 */
	enum class EPathedAwareness : uint8_t
	{
		PA_None                   = 0,
		PA_Noise                  = 1,
		PA_LastKnownEnemyPosition = 2,
		PA_MAX                    = 3
	};

	/**
	 * Enum ReadyOrNot.EObjectiveStatus
	 */
	enum class EObjectiveStatus : uint8_t
	{
		Objective_InProgress = 0,
		Objective_Complete   = 1,
		Objective_Failed     = 2,
		Objective_MAX        = 3
	};

	/**
	 * Enum ReadyOrNot.ETrackingStage
	 */
	enum class ETrackingStage : uint8_t
	{
		TS_FindingCover            = 0,
		TS_InvestigatingPoints     = 1,
		TS_ReturningToOriginalSpot = 2,
		TS_MAX                     = 3
	};

	/**
	 * Enum ReadyOrNot.EPlanningMapTool
	 */
	enum class EPlanningMapTool : uint8_t
	{
		PMT_Draw = 0,
		PMT_Pan  = 1,
		PMT_MAX  = 2
	};

	/**
	 * Enum ReadyOrNot.ETargetingCompTracking
	 */
	enum class ETargetingCompTracking : uint8_t
	{
		TCT_None                           = 0,
		TCT_TrackingActivity               = 1,
		TCT_TrackingCombatMoveActivity     = 2,
		TCT_TrackingCoverAreaCommand       = 3,
		TCT_TrackingVisibleNeutrals        = 4,
		TCT_TrackingEnemyLastKnownPosition = 5,
		TCT_TrackingNoiseStimulus          = 6,
		TCT_TrackingThreatAwarenessActor   = 7,
		TCT_TrackingLatestStimulus         = 8,
		TCT_TrackingVisibleTarget          = 9,
		TCT_TrackingMoveVector             = 10,
		TCT_TrackScriptedFireAtActor       = 11,
		TCT_TrackNearestDoor               = 12,
		TCT_TrackUncheckedThreatAwareness  = 13,
		TCT_TrackHesitateTarget            = 14,
		TCT_TrackMontagePosition           = 15,
		TCT_TrackCustomLocation            = 16,
		TCT_MAX                            = 17
	};

	/**
	 * Enum ReadyOrNot.EItemType
	 */
	enum class EItemType : uint8_t
	{
		IT_None                    = 0,
		IT_Rifles                  = 1,
		IT_SubmachineGun           = 2,
		IT_LightMachineGun         = 3,
		IT_Shotgun                 = 4,
		IT_Sniper                  = 5,
		IT_PistolsLethal           = 6,
		IT_PistolsNonLethal        = 7,
		IT_PrimaryNonLethal        = 8,
		IT_Launcher                = 9,
		IT_Melee                   = 10,
		IT_LessLethal              = 11,
		IT_Headwear                = 12,
		IT_BodyArmor               = 13,
		IT_Grenade                 = 14,
		IT_GrenadeNonLethal        = 15,
		IT_TacticalDevice          = 16,
		IT_TacticalDeviceNonLethal = 17,
		IT_TacticalOne             = 18,
		IT_TacticalTwo             = 19,
		IT_TacticalThree           = 20,
		IT_TacticalFour            = 21,
		IT_TacticalFive            = 22,
		IT_TacticalSix             = 23,
		IT_TacticalSeven           = 24,
		IT_TacticalEight           = 25,
		IT_LongTactical            = 26,
		IT_Skins                   = 27,
		IT_Loadouts                = 28,
		IT_MAX                     = 29
	};

	/**
	 * Enum ReadyOrNot.EPlanningMapStage
	 */
	enum class EPlanningMapStage : uint8_t
	{
		PMS_Overview          = 0,
		PMS_Spawn             = 1,
		PMS_Deployables       = 2,
		PMS_PersonnelMain     = 3,
		PMS_PersonnelPoint    = 4,
		PMS_PersonnelMapZones = 5,
		PMS_FreeDraw          = 6,
		PMS_MAX               = 7
	};

	/**
	 * Enum ReadyOrNot.EPlanningStage
	 */
	enum class EPlanningStage : uint8_t
	{
		PS_None      = 0,
		PS_Planning  = 1,
		PS_Situation = 2,
		PS_Loadout   = 3,
		PS_MAX       = 4
	};

	/**
	 * Enum ReadyOrNot.ESituationPage
	 */
	enum class ESituationPage : uint8_t
	{
		SP_None       = 0,
		SP_Objectives = 1,
		SP_Suspects   = 2,
		SP_Civilians  = 3,
		SP_Timeline   = 4,
		SP_MAX        = 5
	};

	/**
	 * Enum ReadyOrNot.ESwatCommandPriority
	 */
	enum class ESwatCommandPriority : uint8_t
	{
		SCP_PrioritizeCommands = 0,
		SCP_PrioritizeThreats  = 1,
		SCP_MAX                = 2
	};

	/**
	 * Enum ReadyOrNot.ETutorialMissionType
	 */
	enum class ETutorialMissionType : uint8_t
	{
		ETM_None          = 0,
		ETM_ShootingRange = 1,
		ETM_KillHouse     = 2,
		ETM_BasicControls = 3,
		ETM_Mirrorgun     = 4,
		ETM_StackUp       = 5,
		ETM_Arrest        = 6,
		ETM_Grenades      = 7,
		ETM_Movement      = 8,
		ETM_MAX           = 9
	};

	/**
	 * Enum ReadyOrNot.EPlanningPage
	 */
	enum class EPlanningPage : uint8_t
	{
		PP_None         = 0,
		PP_Overview     = 1,
		PP_Spawn        = 2,
		PP_Deployables  = 3,
		PP_Tactics      = 4,
		PP_FreePlanning = 5,
		PP_MAX          = 6
	};

	/**
	 * Enum ReadyOrNot.EWeaponAttachmentType
	 */
	enum class EWeaponAttachmentType : uint8_t
	{
		Null         = 0,
		Optics       = 1,
		Muzzle       = 2,
		Underbarrel  = 3,
		Overbarrel   = 4,
		Stock        = 5,
		Grip         = 6,
		Illuminators = 7,
		Ammunition   = 8,
		MAX          = 9
	};

	/**
	 * Enum ReadyOrNot.EDoorCheckResult
	 */
	enum class EDoorCheckResult : uint8_t
	{
		None     = 0,
		Unlocked = 1,
		Locked   = 2,
		Jammed   = 3,
		Blocked  = 4,
		MAX      = 5
	};

	/**
	 * Enum ReadyOrNot.ECompletedActionType
	 */
	enum class ECompletedActionType : uint8_t
	{
		CAT_ArrestedTarget  = 0,
		CAT_ReportedTarget  = 1,
		CAT_FreedTarget     = 2,
		CAT_LockPicked      = 3,
		CAT_LadderRetracted = 4,
		CAT_ItemRetrieved   = 5,
		CAT_MagInserted     = 6,
		CAT_MagRemoved      = 7,
		CAT_MagChanged      = 8,
		CAT_InteractActor   = 9,
		CAT_WedgeDeployed   = 10,
		CAT_C2Deployed      = 11,
		CAT_WedgeRemoved    = 12,
		CAT_TrapDisarmed    = 13,
		CAT_C2Removed       = 14,
		CAT_MAX             = 15
	};

	/**
	 * Enum ReadyOrNot.EItemVisualizationType
	 */
	enum class EItemVisualizationType : uint8_t
	{
		IVT_None         = 0,
		IVT_Primary      = 1,
		IVT_Secondary    = 2,
		IVT_LongTactical = 3,
		IVT_Helmet       = 4,
		IVT_Equipped     = 5,
		IVT_MAX          = 6
	};

	/**
	 * Enum ReadyOrNot.EPlayerObjectiveMarkerType
	 */
	enum class EPlayerObjectiveMarkerType : uint8_t
	{
		POMT_None       = 0,
		POMT_VipRescue  = 1,
		POMT_VipExecute = 2,
		POMT_Free       = 3,
		POMT_MAX        = 4
	};

	/**
	 * Enum ReadyOrNot.EItemVisualizationStatus
	 */
	enum class EItemVisualizationStatus : uint8_t
	{
		IVS_None       = 0,
		IVS_FPEquipped = 1,
		IVS_MAX        = 2
	};

	/**
	 * Enum ReadyOrNot.EMapType
	 */
	enum class EMapType : uint8_t
	{
		Axis   = 0,
		Action = 1,
		Auto   = 2,
		MAX    = 3
	};

	/**
	 * Enum ReadyOrNot.EToggleInventoryVis
	 */
	enum class EToggleInventoryVis : uint8_t
	{
		TIV_None         = 0,
		TIV_HideAll      = 1,
		TIV_ShowAll      = 2,
		TIV_HideEquipped = 3,
		TIV_ShowEquipped = 4,
		TIV_MAX          = 5
	};

	/**
	 * Enum ReadyOrNot.EIKStateEnum
	 */
	enum class EIKStateEnum : uint8_t
	{
		IKE_None     = 0,
		IKE_Optimize = 1,
		IKE_Full     = 2,
		IKE_MAX      = 3
	};

	/**
	 * Enum ReadyOrNot.ERecoilModifierOption
	 */
	enum class ERecoilModifierOption : uint8_t
	{
		RMO_ModifyRecoil   = 0,
		RMO_AddRecoil      = 1,
		RMO_SubtractRecoil = 2,
		RMO_MAX            = 3
	};

	/**
	 * Enum ReadyOrNot.EInterfaceSoundType
	 */
	enum class EInterfaceSoundType : uint8_t
	{
		IST_None      = 0,
		IST_Checkmark = 1,
		IST_Button    = 2,
		IST_MAX       = 3
	};

	/**
	 * Enum ReadyOrNot.EPreMissionSubCategory
	 */
	enum class EPreMissionSubCategory : uint8_t
	{
		None          = 0,
		Primary       = 1,
		Secondary     = 2,
		Tactical      = 3,
		Appearance    = 4,
		Protection    = 5,
		ItemSelection = 6,
		Grenades      = 7,
		Clean         = 8,
		MAX           = 9
	};

	/**
	 * Enum ReadyOrNot.EOptiwandViewMode
	 */
	enum class EOptiwandViewMode : uint8_t
	{
		PiP        = 0,
		Fullscreen = 1,
		MAX        = 2
	};

	/**
	 * Enum ReadyOrNot.EPostProcessState
	 */
	enum class EPostProcessState : uint8_t
	{
		Hold              = 0,
		Forward           = 1,
		Reverse           = 2,
		WaitingForReverse = 3,
		Ended             = 4,
		MAX               = 5
	};

	/**
	 * Enum ReadyOrNot.ECoverQueryTestPurpose
	 */
	enum class ECoverQueryTestPurpose : uint8_t
	{
		FilterOnly     = 0,
		ScoreOnly      = 1,
		FilterAndScore = 2,
		MAX            = 3
	};

	/**
	 * Enum ReadyOrNot.EPostProcessEndOptions
	 */
	enum class EPostProcessEndOptions : uint8_t
	{
		End     = 0,
		Hold    = 1,
		Loop    = 2,
		Reverse = 3,
		MAX     = 4
	};

	/**
	 * Enum ReadyOrNot.EPostProcessStartingState
	 */
	enum class EPostProcessStartingState : uint8_t
	{
		Forward = 0,
		Reverse = 1,
		MAX     = 2
	};

	/**
	 * Enum ReadyOrNot.ECoverFireType_FirePoint
	 */
	enum class ECoverFireType_FirePoint : uint8_t
	{
		CT_Front = 0,
		CT_Left  = 1,
		CT_Right = 2,
		CT_MAX   = 3
	};

	/**
	 * Enum ReadyOrNot.EPostProcessPlayDirection
	 */
	enum class EPostProcessPlayDirection : uint8_t
	{
		Forwards  = 0,
		Backwards = 1,
		MAX       = 2
	};

	/**
	 * Enum ReadyOrNot.EMoveDirectionExt
	 */
	enum class EMoveDirectionExt : uint8_t
	{
		F   = 0,
		L   = 1,
		R   = 2,
		B   = 3,
		FL  = 4,
		FR  = 5,
		BR  = 6,
		BL  = 7,
		MAX = 8
	};

	/**
	 * Enum ReadyOrNot.EMoveDirection
	 */
	enum class EMoveDirection : uint8_t
	{
		F   = 0,
		L   = 1,
		R   = 2,
		B   = 3,
		MAX = 4
	};

	/**
	 * Enum ReadyOrNot.EHighScoreCategory
	 */
	enum class EHighScoreCategory : uint8_t
	{
		HSC_None        = 0,
		HSC_COOP_DAILY  = 1,
		HSC_COOP_SEASON = 2,
		HSC_PVP_DAILY   = 3,
		HSC_PVP_SEASON  = 4,
		HSC_MAX         = 5
	};

	/**
	 * Enum ReadyOrNot.EHUDStyle
	 */
	enum class EHUDStyle : uint8_t
	{
		Default   = 0,
		Minimal   = 1,
		Detail    = 2,
		Immersive = 3,
		MAX       = 4
	};

	/**
	 * Enum ReadyOrNot.PTTKey
	 */
	enum class EPTTKey : uint8_t
	{
		PTTKeyPTTNoChannel   = 0,
		PTTKeyPTTAreaChannel = 1,
		PTTKeyPTTTeamChannel = 2,
		PTTKeyPTTKey_MAX     = 3
	};

	/**
	 * Enum ReadyOrNot.ENVGStyle
	 */
	enum class ENVGStyle : uint8_t
	{
		GreenPhosphor = 0,
		WhitePhosphor = 1,
		MAX           = 2
	};

	/**
	 * Enum ReadyOrNot.EMaskMagState
	 */
	enum class EMaskMagState : uint8_t
	{
		Show = 0,
		Hide = 1,
		MAX  = 2
	};

	/**
	 * Enum ReadyOrNot.EScoreReadoutMode
	 */
	enum class EScoreReadoutMode : uint8_t
	{
		AllScores    = 0,
		OnlyPositive = 1,
		OnlyNegative = 2,
		Disabled     = 3,
		MAX          = 4
	};

	/**
	 * Enum ReadyOrNot.EEmptyMagReloadType
	 */
	enum class EEmptyMagReloadType : uint8_t
	{
		RegularReload = 0,
		FastReload    = 1,
		MAX           = 2
	};

	/**
	 * Enum ReadyOrNot.EShotgunReloadType
	 */
	enum class EShotgunReloadType : uint8_t
	{
		SRT_SingleLoad = 0,
		SRT_MultiLoad  = 1,
		SRT_MAX        = 2
	};

	/**
	 * Enum ReadyOrNot.EMaskMag
	 */
	enum class EMaskMag : uint8_t
	{
		Mag01 = 0,
		Mag02 = 1,
		Dummy = 2,
		MAX   = 3
	};

	/**
	 * Enum ReadyOrNot.EGrenadeThrowSettingType
	 */
	enum class EGrenadeThrowSettingType : uint8_t
	{
		GUT_QuickGrenadeThrow   = 0,
		GUT_ClassicGrenadeThrow = 1,
		GUT_MAX                 = 2
	};

	/**
	 * Enum ReadyOrNot.ECommandInterfaceType
	 */
	enum class ECommandInterfaceType : uint8_t
	{
		CI_GraphicCommandInterface = 0,
		CI_ClassicCommandInterface = 1,
		CI_MAX                     = 2
	};

	/**
	 * Enum ReadyOrNot.EAnimationType
	 */
	enum class EAnimationType : uint8_t
	{
		AT_Gun_FP  = 0,
		AT_Gun_TP  = 1,
		AT_Body_FP = 2,
		AT_Body_TP = 3,
		AT_MAX     = 4
	};

	/**
	 * Enum ReadyOrNot.ESuspectStateData
	 */
	enum class ESuspectStateData : uint8_t
	{
		SSD_NONE                        = 0,
		SSD_IS_TRACKING                 = 1,
		SSD_HAS_BEST_ACTION             = 2,
		SSD_HAS_BEST_CONTINUOUS_ACTION  = 3,
		SSD_HAS_BEST_COMBAT_MOVE_ACTION = 4,
		SSD_MAX                         = 5
	};

	/**
	 * Enum ReadyOrNot.EBaseAnimType_TP
	 */
	enum class EBaseAnimType_TP : uint8_t
	{
		IdlePose_Low_TP           = 0,
		IdlePose_Up_TP            = 1,
		IdlePose_Shld_TP          = 2,
		IdlePose_Sights_TP        = 3,
		IdlePose_Ret_TP           = 4,
		IdlePose_Ovr_TP           = 5,
		Crouch_IdlePose_Low_TP    = 6,
		Crouch_IdlePose_Up_TP     = 7,
		Crouch_IdlePose_Shld_TP   = 8,
		Crouch_IdlePose_Sights_TP = 9,
		Crouch_IdlePose_Ret_TP    = 10,
		Crouch_IdlePose_Ovr_TP    = 11,
		IdlePose_AFG_TP           = 12,
		IdlePose_VFG_TP           = 13,
		IdlePose_HSTOP_TP         = 14,
		ENone                     = 15,
		EBaseAnimType_MAX         = 16
	};

	/**
	 * Enum ReadyOrNot.EBaseBlendspaces_FP
	 */
	enum class EBaseBlendspaces_FP : uint8_t
	{
		Look_BS_FP           = 0,
		ENone                = 1,
		EBaseBlendspaces_MAX = 2
	};

	/**
	 * Enum ReadyOrNot.EBaseAnimType_FP
	 */
	enum class EBaseAnimType_FP : uint8_t
	{
		IdlePose_FP          = 0,
		Idle_FP              = 1,
		Run_FP               = 2,
		Walk_FP              = 3,
		Run_Limp_FP          = 4,
		Walk_Limp_FP         = 5,
		Lowered_Up_Pose_FP   = 6,
		Lowered_Down_Pose_FP = 7,
		ADS_Run_FP           = 8,
		ADS_Walk_FP          = 9,
		ADS_Run_Limp_FP      = 10,
		ADS_Walk_Limp_FP     = 11,
		IdlePose_AFG_FP      = 12,
		IdlePose_VFG_FP      = 13,
		IdlePose_HSTOP_FP    = 14,
		ENone                = 15,
		EBaseAnimType_MAX    = 16
	};

	/**
	 * Enum ReadyOrNot.EStrafeDirection
	 */
	enum class EStrafeDirection : uint8_t
	{
		F   = 0,
		L   = 1,
		R   = 2,
		B   = 3,
		FL  = 4,
		FR  = 5,
		BR  = 6,
		BL  = 7,
		MAX = 8
	};

	/**
	 * Enum ReadyOrNot.EItemOverrideRule
	 */
	enum class EItemOverrideRule : uint8_t
	{
		NONE             = 0,
		ADDITIVE_ONLY    = 1,
		LAYERED_ONLY     = 2,
		ADDITIVE_LAYERED = 3,
		MAX              = 4
	};

	/**
	 * Enum ReadyOrNot.ERoNGaitState
	 */
	enum class ERoNGaitState : uint8_t
	{
		RON_TURN   = 0,
		RON_WALK   = 1,
		RON_RUN    = 2,
		RON_SPRINT = 3,
		RON_MAX    = 4
	};

	/**
	 * Enum ReadyOrNot.EObjectiveLevel
	 */
	enum class EObjectiveLevel : uint8_t
	{
		PrimaryObjective   = 0,
		SecondaryObjective = 1,
		TertiaryObjective  = 2,
		MAX                = 3
	};

	/**
	 * Enum ReadyOrNot.EAbortCoverReason
	 */
	enum class EAbortCoverReason : uint8_t
	{
		Success               = 0,
		Forced                = 1,
		EnemySensed           = 2,
		SeenEnemyApproaching  = 3,
		HeardEnemyApproaching = 4,
		EnemyMovingTowardsUs  = 5,
		EnemyFiredNearUs      = 6,
		MAX                   = 7
	};

	/**
	 * Enum ReadyOrNot.ELightType
	 */
	enum class ELightType : uint8_t
	{
		LT_None  = 0,
		LT_Day   = 1,
		LT_Night = 2,
		LT_MAX   = 3
	};

	/**
	 * Enum ReadyOrNot.EGenerationType
	 */
	enum class EGenerationType : uint8_t
	{
		GT_None            = 0,
		GT_Scenarios       = 1,
		GT_RandomScenarios = 2,
		GT_MAX             = 3
	};

	/**
	 * Enum ReadyOrNot.EPVPEvent
	 */
	enum class EPVPEvent : uint8_t
	{
		None             = 0,
		PlayerKilled     = 1,
		PlayerArrested   = 2,
		PlayerFreed      = 3,
		KillConfirmed    = 4,
		ReportedEvidence = 5,
		VIPSecured       = 6,
		VIPArrested      = 7,
		VIPFreed         = 8,
		VIPKilled        = 9,
		FlagCaptured     = 10,
		FlagDropped      = 11,
		IntelCollected   = 12,
		IntelDropped     = 13,
		IntelExtracting  = 14,
		IntelExtracted   = 15,
		IncrimClueFound  = 16,
		MAX              = 17
	};

	/**
	 * Enum ReadyOrNot.EAIConsiderationScoringMethod
	 */
	enum class EAIConsiderationScoringMethod : uint8_t
	{
		Additive       = 0,
		Subtractive    = 1,
		Multiplicative = 2,
		Divisive       = 3,
		MAX            = 4
	};

	/**
	 * Enum ReadyOrNot.EAIAction
	 */
	enum class EAIAction : uint8_t
	{
		None             = 0,
		FireWeapon       = 1,
		Melee            = 2,
		HardCover        = 3,
		Hide             = 4,
		Surrender        = 5,
		FakeSurrender    = 6,
		PlayDead         = 7,
		Flee             = 8,
		Rush             = 9,
		Flank            = 10,
		Duel             = 11,
		Suppress         = 12,
		Push             = 13,
		Investigate      = 14,
		PickUpItem       = 15,
		Suicide          = 16,
		NeverFakeSuicide = 17,
		Custom           = 18,
		MAX              = 19
	};

	/**
	 * Enum ReadyOrNot.EAITeamTactic
	 */
	enum class EAITeamTactic : uint8_t
	{
		None     = 0,
		Suppress = 1,
		Cover    = 2,
		Flank    = 3,
		Push     = 4,
		Charge   = 5,
		Custom   = 6,
		MAX      = 7
	};

	/**
	 * Enum ReadyOrNot.EAnimCardinalDirection
	 */
	enum class EAnimCardinalDirection : uint8_t
	{
		North = 0,
		East  = 1,
		South = 2,
		West  = 3,
		MAX   = 4
	};

	/**
	 * Enum ReadyOrNot.EDistanceMatchingType
	 */
	enum class EDistanceMatchingType : uint8_t
	{
		Start = 0,
		Stop  = 1,
		Pivot = 2,
		Jump  = 3,
		Fall  = 4,
		None  = 5,
		MAX   = 6
	};

	/**
	 * Enum ReadyOrNot.EItemSocket
	 */
	enum class EItemSocket : uint8_t
	{
		Body = 0,
		Hand = 1,
		MAX  = 2
	};

	/**
	 * Enum ReadyOrNot.EActivityStatus
	 */
	enum class EActivityStatus : uint8_t
	{
		Uninitialized = 0,
		Initialized   = 1,
		Started       = 2,
		Paused        = 3,
		SoftComplete  = 4,
		Complete      = 5,
		MAX           = 6
	};

	/**
	 * Enum ReadyOrNot.ECombatEngagementType
	 */
	enum class ECombatEngagementType : uint8_t
	{
		FireWeapon    = 0,
		Melee         = 1,
		ExplosiveVest = 2,
		Custom        = 3,
		MAX           = 4
	};

	/**
	 * Enum ReadyOrNot.ENavLOS
	 */
	enum class ENavLOS : uint8_t
	{
		NL_Any                = 0,
		NL_BreakLOS           = 1,
		NL_RequireLOS         = 2,
		NL_RequireLOSToMyself = 3,
		NL_MAX                = 4
	};

	/**
	 * Enum ReadyOrNot.ENavType
	 */
	enum class ENavType : uint8_t
	{
		NT_SinglePoint = 0,
		NT_Circle      = 1,
		NT_Grid        = 2,
		NT_MAX         = 3
	};

	/**
	 * Enum ReadyOrNot.EStructureCastPathway
	 */
	enum class EStructureCastPathway : uint8_t
	{
		CastSuccess = 0,
		CastFailed  = 1,
		MAX         = 2
	};

	/**
	 * Enum ReadyOrNot.EBioType
	 */
	enum class EBioType : uint8_t
	{
		BT_None     = 0,
		BT_Suspect  = 1,
		BT_Civilian = 2,
		BT_MAX      = 3
	};

	/**
	 * Enum ReadyOrNot.EProjectileReaction
	 */
	enum class EProjectileReaction : uint8_t
	{
		PR_None      = 0,
		PR_Richochet = 1,
		PR_Pierce    = 2,
		PR_MAX       = 3
	};

	/**
	 * Enum ReadyOrNot.ECoverLandmarkAnimDirection
	 */
	enum class ECoverLandmarkAnimDirection : uint8_t
	{
		Forward = 0,
		Left    = 1,
		Right   = 2,
		MAX     = 3
	};

	/**
	 * Enum ReadyOrNot.ECommandStatus
	 */
	enum class ECommandStatus : uint8_t
	{
		CS_None     = 0,
		CS_Inactive = 1,
		CS_Active   = 2,
		CS_Complete = 3,
		CS_Failed   = 4,
		CS_MAX      = 5
	};

	/**
	 * Enum ReadyOrNot.EPseudoSpeedType
	 */
	enum class EPseudoSpeedType : uint8_t
	{
		Null     = 0,
		Slow     = 1,
		Walk     = 2,
		Run      = 3,
		Sprint   = 4,
		LimpWalk = 5,
		LimpRun  = 6,
		Last     = 7,
		MAX      = 8
	};

	/**
	 * Enum ReadyOrNot.EActorSenseType
	 */
	enum class EActorSenseType : uint8_t
	{
		Sight  = 0,
		Sound  = 1,
		Damage = 2,
		MAX    = 3
	};

	/**
	 * Enum ReadyOrNot.ETacticalAuthorityVoice
	 */
	enum class ETacticalAuthorityVoice : uint8_t
	{
		TAV_None                = 0,
		TAV_Surrender           = 1,
		TAV_PickUpItem          = 2,
		TAV_DropTheGun          = 3,
		TAV_GetOnTheFloor       = 4,
		TAV_ComeHere            = 5,
		TAV_Wait                = 6,
		TAV_PutHandsUp          = 7,
		TAV_MoveOverThere       = 8,
		TAV_ReportDead          = 9,
		TAV_ReportArrested      = 10,
		TAV_ReportIncapacitated = 11,
		TAV_ReportEvidence      = 12,
		TAV_MAX                 = 13
	};

	/**
	 * Enum ReadyOrNot.EDroneDamageSpeed
	 */
	enum class EDroneDamageSpeed : uint8_t
	{
		DDS_10PercentSpeed = 0,
		DDS_20PercentSpeed = 1,
		DDS_30PercentSpeed = 2,
		DDS_40PercentSpeed = 3,
		DDS_50PercentSpeed = 4,
		DDS_60PercentSpeed = 5,
		DDS_70PercentSpeed = 6,
		DDS_80PercentSpeed = 7,
		DDS_90PercentSpeed = 8,
		DDS_MAX            = 9
	};

	/**
	 * Enum ReadyOrNot.EGameEventMetric
	 */
	enum class EGameEventMetric : uint8_t
	{
		GEM_NONE                 = 0,
		GEM_GAME_STARTED         = 1,
		GEM_GAME_JOINED          = 2,
		GEM_GAME_FINISHED        = 3,
		GEM_GAME_CRASHED         = 4,
		GEM_PLAYER_GAME_FINISHED = 5,
		GEM_MAX                  = 6
	};

	/**
	 * Enum ReadyOrNot.ETutorialMessageContext
	 */
	enum class ETutorialMessageContext : uint8_t
	{
		Movement = 0,
		MAX      = 1
	};

	/**
	 * Enum ReadyOrNot.ERONBuildConfiguration
	 */
	enum class ERONBuildConfiguration : uint8_t
	{
		Unknown      = 0,
		Editor       = 1,
		Debug        = 2,
		Development  = 3,
		Shipping     = 4,
		FinalRelease = 5,
		Test         = 6,
		MAX          = 7
	};

	/**
	 * Enum ReadyOrNot.ECommWheelLockOnBehaviour
	 */
	enum class ECommWheelLockOnBehaviour : uint8_t
	{
		LB_LockOnToObstruction        = 0,
		LB_KeepLockOn                 = 1,
		LB_CancelLockOnWhenObstructed = 2,
		LB_MAX                        = 3
	};

	/**
	 * Enum ReadyOrNot.EFootConstEnum
	 */
	enum class EFootConstEnum : uint8_t
	{
		FCE_Forward = 0,
		FCE_Inverse = 1,
		FCE_MAX     = 2
	};

	/**
	 * Enum ReadyOrNot.EMedicalHealScreen
	 */
	enum class EMedicalHealScreen : uint8_t
	{
		MHS_Healer          = 0,
		MHS_Healee          = 1,
		MHS_MortallyWounded = 2,
		MHS_NoBrokenLimbs   = 3,
		MHS_MAX             = 4
	};

	/**
	 * Enum ReadyOrNot.EDoorBreachType
	 */
	enum class EDoorBreachType : uint8_t
	{
		None    = 0,
		Open    = 1,
		Move    = 2,
		Kick    = 3,
		Shotgun = 4,
		Ram     = 5,
		C2      = 6,
		Custom  = 7,
		MAX     = 8
	};

	/**
	 * Enum ReadyOrNot.EFilterMovePointGeneration
	 */
	enum class EFilterMovePointGeneration : uint8_t
	{
		FMNP_None      = 0,
		FNMP_LeftOnly  = 1,
		FNMP_RightOnly = 2,
		FNMP_HardLeft  = 3,
		FNMP_HardRight = 4,
		MAX            = 5
	};

	/**
	 * Enum ReadyOrNot.EChangeBehaviour
	 */
	enum class EChangeBehaviour : uint8_t
	{
		CB_Add    = 0,
		CB_Remove = 1,
		CB_MAX    = 2
	};

	/**
	 * Enum ReadyOrNot.ETOCPriority
	 */
	enum class ETOCPriority : uint8_t
	{
		ETP_Flush          = 0,
		ETP_HighPriority   = 1,
		ETP_MediumPriority = 2,
		ETP_LowPriority    = 3,
		ETP_MAX            = 4
	};

	/**
	 * Enum ReadyOrNot.EPlayerStatus
	 */
	enum class EPlayerStatus : uint8_t
	{
		PS_None     = 0,
		PS_NotReady = 1,
		PS_Ready    = 2,
		PS_Deployed = 3,
		PS_MAX      = 4
	};

	/**
	 * Enum ReadyOrNot.ECOOPMode
	 */
	enum class ECOOPMode : uint8_t
	{
		CM_None               = 0,
		CM_BombThreat         = 1,
		CM_ActiveShooter      = 2,
		CM_HostageRescue      = 3,
		CM_BarricadedSuspects = 4,
		CM_Raid               = 5,
		CM_MAX                = 6
	};

	/**
	 * Enum ReadyOrNot.ECombatState
	 */
	enum class ECombatState : uint8_t
	{
		CS_Unaware           = 0,
		CS_Suspicious        = 1,
		CS_Fleeing           = 2,
		CS_Hesitation        = 3,
		CS_Cover             = 4,
		CS_ArmedAndDangerous = 5,
		CS_MAX               = 6
	};

	/**
	 * Enum ReadyOrNot.EItemSelectionInterfaceType
	 */
	enum class EItemSelectionInterfaceType : uint8_t
	{
		Wheel = 0,
		Panel = 1,
		MAX   = 2
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct ReadyOrNot.AIActionData_NameOnly
	 * Size -> 0x0008
	 */
	struct FAIActionData_NameOnly
	{
	public:
		class FName                                                  Name;                                                    // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ReadyOrNot.AIActionGateData
	 * Size -> 0x0068
	 */
	struct FAIActionGateData
	{
	public:
		class UAIActionGate*                                         Type;                                                    // 0x0000(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bNot : 1;                                                // 0x0008(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bUseCooldown : 1;                                        // 0x0008(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                        Cooldown;                                                // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bLockGateOnCooldown : 1;                                 // 0x0010(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bContributeToFailCount : 1;                              // 0x0010(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0001[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class ACyberneticController*, float>                    Cooldowns;                                               // 0x0018(0x0050) Edit, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ReadyOrNot.AIActionConsiderationData
	 * Size -> 0x0060
	 */
	struct FAIActionConsiderationData
	{
	public:
		float                                                        Weight;                                                  // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAIConsiderationScoringMethod                                ScoringMethod;                                           // 0x0004(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x3];                                   // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAIActionConsideration*                                Type;                                                    // 0x0008(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TMap<class ACyberneticController*, float>                    Scores;                                                  // 0x0010(0x0050) Edit, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ReadyOrNot.AIActionData
	 * Size -> 0x02C8
	 */
	struct FAIActionData
	{
	public:
		class FName                                                  Name;                                                    // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAIAction                                                    ActionType;                                              // 0x0008(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAIAction*                                             CustomActionClass;                                       // 0x0010(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                        Weight;                                                  // 0x0018(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bDisallowWhenLastAlive : 1;                              // 0x001C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bDoOnce : 1;                                             // 0x001C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bDisableActionWhenFailedToConsider : 1;                  // 0x001C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0001[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                      DisableActionConsiderCount;                              // 0x0020(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bCommitUntilEnd : 1;                                     // 0x0024(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0002[0x3];                                   // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                        CommitTime;                                              // 0x0028(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bCommitTimeFromConfig : 1;                               // 0x002C(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0003[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                                CommitTimeConfigKey;                                     // 0x0030(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FAIActionData_NameOnly>                        CommitInterrupts;                                        // 0x0040(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                         bUseCooldown : 1;                                        // 0x0050(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0004[0x3];                                   // 0x0051(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                        Cooldown;                                                // 0x0054(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bCooldownFromConfig : 1;                                 // 0x0058(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0005[0x7];                                   // 0x0059(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                                CooldownConfigKey;                                       // 0x0060(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FAIActionGateData>                             Gates;                                                   // 0x0070(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<struct FAIActionConsiderationData>                    Considerations;                                          // 0x0080(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		TMap<class ACyberneticController*, float>                    Scores;                                                  // 0x0090(0x0050) Edit, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPublic
		TMap<class ACyberneticController*, float>                    Cooldowns;                                               // 0x00E0(0x0050) Edit, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPublic
		TMap<class ACyberneticController*, float>                    CommitTimes;                                             // 0x0130(0x0050) Edit, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPublic
		TMap<class ACyberneticController*, int32_t>                  SuccessConsiderCount;                                    // 0x0180(0x0050) Edit, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPublic
		TMap<class ACyberneticController*, int32_t>                  FailConsiderCount;                                       // 0x01D0(0x0050) Edit, EditFixedSize, DisableEditOnTemplate, Transient, EditConst, NativeAccessSpecifierPublic
		TMap<class ACyberneticController*, class UAIAction*>         CustomActions;                                           // 0x0220(0x0050) Transient, NativeAccessSpecifierPublic
		TMap<class ACyberneticController*, uint32_t>                 RunCount;                                                // 0x0270(0x0050) Transient, NativeAccessSpecifierPublic
		class UAIActionPresetData*                                   Preset;                                                  // 0x02C0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ReadyOrNot.ActivityRoute
	 * Size -> 0x0020
	 */
	struct FActivityRoute
	{
	public:
		float                                                        TimeDoingActivity;                                       // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AWorldBuildingPlacementActor*                          WorldBuildingPlacementActor;                             // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bAllowFemale;                                            // 0x0010(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0001[0x7];                                   // 0x0011(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UWorldBuildingActivityData*                            WorldBuildingActivityData;                               // 0x0018(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct ReadyOrNot.ActivityRouteCollection
	 * Size -> 0x0030
	 */
	struct FActivityRouteCollection
	{
	public:
		TArray<struct FActivityRoute>                                ActivityRoutes;                                          // 0x0000(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		struct PCoreUObject_FColor                                   PathColor;                                               // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bReturnToOriginalSpot;                                   // 0x0014(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                      ActivityIdx;                                             // 0x0018(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bOnlyRunWhenCharacterRelevant;                           // 0x001C(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0001[0x13];                                  // 0x001D(0x0013) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ReadyOrNot.SpawnTweakables
	 * Size -> 0x0048
	 */
	struct FSpawnTweakables
	{
	public:
		class UBaseCombatMoveActivity*                               DefaultCombatMoveActivity;                               // 0x0000(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bForceNoWeapon : 1;                                      // 0x0008(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ABaseWeapon*                                           ForceWeaponOverride;                                     // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                  ForceBodyArmourOverride;                                 // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETeamType                                                    ForceTeamTypeOverride;                                   // 0x0020(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0001[0x7];                                   // 0x0021(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAIArchetypeData*                                      ArchetypeOverride;                                       // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class FName>                                          SpawnWithTags;                                           // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                         bForceAlwaysJustified;                                   // 0x0040(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bDeactivated;                                            // 0x0041(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0002[0x6];                                   // 0x0042(0x0006) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ReadyOrNot.SuspectTweakables
	 * Size -> 0x0018
	 */
	struct FSuspectTweakables
	{
	public:
		struct FVector2D                                TimeUntilRaisingGun;                                     // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                TimeUntilDraw;                                           // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                        FakeSurrenderChance;                                     // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                         bNoTaunt;                                                // 0x0014(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ReadyOrNot.SpawnData
	 * Size -> 0x00B8
	 */
	struct FSpawnData
	{
	public:
		bool                                                         bEnabled : 1;                                            // 0x0000(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                                UnknownData_0000[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDataTableRowHandle                                   SpawnedAI;                                               // 0x0008(0x0010) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
