#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x110 (0x388 - 0x278)
// WidgetBlueprintGeneratedClass W_LoadoutCustomizationMenu.W_LoadoutCustomizationMenu_C
class UW_LoadoutCustomizationMenu_C : public UBaseWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x278(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      Anim_LoadoutItemInfo_SlideOut;                     // 0x280(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Anim_LoadoutItemInfo_SlideIn;                      // 0x288(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Anim_Quartermaster_ButtonPressed;                  // 0x290(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                            CurrentMenuDirectory_Text;                         // 0x298(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardCombobox_New_C*             DefaultFireMode_ComboBox;                          // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        EquipTeamMate_HBox;                                // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardButton_C*                   GoToQuartermaster_Button;                          // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                ItemIcon_Image;                                    // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ItemIcon_ScaleBox;                                 // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                             Lbl_GoToQuartermaster;                             // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                            Loadout_ScrollBox;                                 // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          LoadoutCategories_Container;                       // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          LoadoutItemInfo_Container;                         // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          LoadoutItemInfoMenu;                               // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadoutItem_Presets_C*              LoadoutPresets;                                    // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              Quatermaster_Box;                                  // 0x2F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                             Txt_ItemDescription;                               // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Text_C*                             Txt_ItemName;                                      // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EquipTeamMateCategory_C*            W_EquipTeamMateCategory;                           // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EquipTeamMateCategory_C*            W_EquipTeamMateCategory_1;                         // 0x318(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EquipTeamMateCategory_C*            W_EquipTeamMateCategory_2;                         // 0x320(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EquipTeamMateCategory_C*            W_EquipTeamMateCategory_3;                         // 0x328(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EquipTeamMateCategory_C*            W_EquipTeamMateCategory_4;                         // 0x330(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_HotkeyBar_Entry_C*                  W_HotkeyBar_Entry;                                 // 0x338(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                  LoadoutSlotName;                                   // 0x340(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        SelectedRow;                                       // 0x358(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bLoadoutCategorySelected;                          // 0x35C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bLoadoutItemSelected;                              // 0x35D(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bAnyKeyDown;                                       // 0x35E(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bInPresetsMenu;                                    // 0x35F(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UW_PreMission_C*                       Owner;                                             // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_LoadoutCategory_C*                  LastSelectedLoadoutCategory;                       // 0x368(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_LoadoutItem_C*                      LastSelectedLoadoutItem;                           // 0x370(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_LoadoutItem_Preset_C*               LastSelectedLoadoutItemPreset;                     // 0x378(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                LastSelectedLoadoutItemClass;                      // 0x380(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UW_LoadoutCustomizationMenu_C* GetDefaultObj();

	bool Get_Quatermaster_Box_IsEnabled();
	void FindIconFromItemClass(class UClass* ItemClass, class UTexture2D** Return_Value, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UTexture2D* CallFunc_FindIconFromItemClass_Return_Value);
	void StopItemInfoCardAnimation();
	void FadeOutItemInfoCard(bool CallFunc_IsAnimationPlaying_ReturnValue, bool CallFunc_IsVisible_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1);
	void FadeInItemInfoCard(class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	class FText Get_CurrentMenuDirectory_Text(bool CallFunc_IsValid_ReturnValue, class FText CallFunc_GetCurrentMenuDirectory_Return_Value, bool CallFunc_IsValid_ReturnValue_1, class FText CallFunc_GetCurrentMenuDirectory_Return_Value_1, class FText CallFunc_GetCurrentMenuDirectory_Return_Value_2, const class FString& CallFunc_Conv_TextToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue);
	void CanRenamePreset(bool* Return_Value, bool CallFunc_CanRenamePreset_Return_Value, bool CallFunc_BooleanAND_ReturnValue);
	void Escape(bool CallFunc_CanExit_ReturnValue);
	void UnselectLoadoutPreset();
	void SelectLoadoutPreset();
	void UnhoverLoadoutPreset();
	void HoverLoadoutPreset();
	void OnLoadoutItemPresetButtonClicked__Internal_(class UW_LoadoutItem_Preset_C* Loadout_Item_Preset);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent, bool CallFunc_HandleMenuWideMultiInput__Up__Return_Value, const struct FEventReply& CallFunc_Handled_ReturnValue);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent, const struct FKey& CallFunc_GetKey_ReturnValue, bool CallFunc_HandleMenuWideMultiInput__Down__Return_Value, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue_2, const struct FKey& CallFunc_GetKey_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_2, const struct FKey& CallFunc_GetKey_ReturnValue_2, bool CallFunc_EqualEqual_KeyKey_ReturnValue_5, bool CallFunc_EqualEqual_KeyKey_ReturnValue_6, bool CallFunc_EqualEqual_KeyKey_ReturnValue_7, bool CallFunc_EqualEqual_KeyKey_ReturnValue_8, const struct FKey& CallFunc_GetKey_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_EqualEqual_KeyKey_ReturnValue_9, bool CallFunc_BooleanOR_ReturnValue_4, bool CallFunc_EqualEqual_KeyKey_ReturnValue_10, bool CallFunc_BooleanOR_ReturnValue_5, bool CallFunc_EqualEqual_KeyKey_ReturnValue_11, bool CallFunc_EqualEqual_KeyKey_ReturnValue_12, const struct FKey& CallFunc_GetKey_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_6, bool CallFunc_EqualEqual_KeyKey_ReturnValue_13, bool CallFunc_BooleanOR_ReturnValue_7, bool CallFunc_EqualEqual_KeyKey_ReturnValue_14, bool CallFunc_BooleanOR_ReturnValue_8, bool CallFunc_EqualEqual_KeyKey_ReturnValue_15, bool CallFunc_BooleanOR_ReturnValue_9, const struct FKey& CallFunc_GetKey_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_10, bool CallFunc_EqualEqual_KeyKey_ReturnValue_16, bool CallFunc_EqualEqual_KeyKey_ReturnValue_17, bool CallFunc_EqualEqual_KeyKey_ReturnValue_18, bool CallFunc_EqualEqual_KeyKey_ReturnValue_19, const struct FKey& CallFunc_GetKey_ReturnValue_6, bool CallFunc_BooleanOR_ReturnValue_11, bool CallFunc_EqualEqual_KeyKey_ReturnValue_20, bool CallFunc_BooleanOR_ReturnValue_12, bool CallFunc_EqualEqual_KeyKey_ReturnValue_21, bool CallFunc_BooleanOR_ReturnValue_13, bool CallFunc_EqualEqual_KeyKey_ReturnValue_22, bool CallFunc_EqualEqual_KeyKey_ReturnValue_23, const struct FKey& CallFunc_GetKey_ReturnValue_7, bool CallFunc_BooleanOR_ReturnValue_14, bool CallFunc_EqualEqual_KeyKey_ReturnValue_24, bool CallFunc_BooleanOR_ReturnValue_15, bool CallFunc_EqualEqual_KeyKey_ReturnValue_25, bool CallFunc_BooleanOR_ReturnValue_16, bool CallFunc_BooleanOR_ReturnValue_17, const struct FEventReply& CallFunc_Unhandled_ReturnValue, const struct FEventReply& CallFunc_Unhandled_ReturnValue_1, const struct FEventReply& CallFunc_Handled_ReturnValue, bool CallFunc_HandleMenuWideInput_Return_Value, const struct FEventReply& CallFunc_Handled_ReturnValue_1, bool CallFunc_IsUIHidden_Return_Value, const struct FEventReply& CallFunc_Handled_ReturnValue_2, const struct FEventReply& CallFunc_Handled_ReturnValue_3);
	void GetCurrentlyFocusedWidget(class UWidget** Return_Value, bool CallFunc_IsValid_ReturnValue);
	enum class ESlateVisibility Get_Quatermaster_Box_Visibility(bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool CallFunc_IsAnimationPlaying_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, enum class ESlateVisibility K2Node_Select_Default);
	void AnyLoadoutCategoryWidgetHovered(bool* Return_Value, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UW_LoadoutCategory_C* K2Node_DynamicCast_AsW_Loadout_Category, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue);
	void CanUnselect(bool* Return_Value, bool CallFunc_CanUnselect_ReturnValue);
	void ApplyPresetToPreviewCharacterWeapon(class UClass* ItemClass, class UW_LoadoutItem_Preset_C* Loadout_Item_Preset, bool bDeselectAll, TArray<enum class EItemCategory>& Temp_byte_Variable, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_IsValidClass_ReturnValue_1, enum class EItemCategory Temp_byte_Variable_1, TArray<enum class EItemCategory>& Temp_byte_Variable_2, enum class EItemCategory Temp_byte_Variable_3, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_Array_Contains_ReturnValue_1);
	void UpdateFireModeOptions(const class FString& Temp_string_Variable, const class FString& Temp_string_Variable_1, const class FString& Temp_string_Variable_2, TArray<enum class EFireMode>& Temp_byte_Variable, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, const class FString& Temp_string_Variable_3, bool CallFunc_IsValidClass_ReturnValue, class UClass* K2Node_ClassDynamicCast_AsBase_Weapon, bool K2Node_ClassDynamicCast_bSuccess, enum class EFireMode CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, int32 CallFunc_Array_Find_ReturnValue, int32 CallFunc_Array_Find_ReturnValue_1, int32 CallFunc_Array_Find_ReturnValue_2, int32 CallFunc_Array_Find_ReturnValue_3, int32 CallFunc_Array_Length_ReturnValue, enum class EFireMode CallFunc_Array_Get_Item, bool CallFunc_Greater_IntInt_ReturnValue, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const class FString& CallFunc_Replace_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1);
	void RenamePreset(bool CallFunc_IsValid_ReturnValue);
	void UnhoverAll(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UW_LoadoutCategory_C* K2Node_DynamicCast_AsW_Loadout_Category, bool K2Node_DynamicCast_bSuccess);
	enum class ESlateVisibility Get_LoadoutItemInfo_Container_Visibility(bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, enum class ESlateVisibility K2Node_Select_Default);
	void UnhoverLoadoutCategory(TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutCategory_C* K2Node_DynamicCast_AsW_Loadout_Category, bool K2Node_DynamicCast_bSuccess);
	void HoverLoadoutCategory(TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutCategory_C* K2Node_DynamicCast_AsW_Loadout_Category, bool K2Node_DynamicCast_bSuccess);
	void UnselectLoadoutCategory(int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, bool CallFunc_IsValid_ReturnValue, int32 Temp_int_Array_Index_Variable_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutCategory_C* K2Node_DynamicCast_AsW_Loadout_Category, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_CanUnselect_Return_Value, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_1, class UWidget* CallFunc_Array_Get_Item_1, class UW_LoadoutCategory_C* K2Node_DynamicCast_AsW_Loadout_Category_1, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_1, class UWidget* CallFunc_Array_Get_Item_2, bool CallFunc_Less_IntInt_ReturnValue_1, class UW_LoadoutCategory_C* K2Node_DynamicCast_AsW_Loadout_Category_2, bool K2Node_DynamicCast_bSuccess_2);
	void SelectLoadoutCategory(TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutCategory_C* K2Node_DynamicCast_AsW_Loadout_Category, bool K2Node_DynamicCast_bSuccess, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_Not_PreBool_ReturnValue);
	void PreviousColumn();
	void NextColumn();
	void PreviousRow(bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 K2Node_Select_Default, int32 CallFunc_GetChildrenCount_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, int32 CallFunc_Clamp_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void NextRow(int32 CallFunc_GetChildrenCount_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Clamp_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue);
	void UpdateItemInfoCard(class UClass* ItemClass, enum class EStretch Temp_byte_Variable, class UTexture2D* CallFunc_FindIconFromItemClass_Return_Value, enum class EItemCategory Temp_byte_Variable_1, enum class EItemCategory Temp_byte_Variable_2, TArray<enum class EItemCategory>& Temp_byte_Variable_3, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_Array_Contains_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, enum class EStretch Temp_byte_Variable_4, class UDataTable* CallFunc_GetItemLookupDataTable_ReturnValue, bool Temp_bool_Variable, const struct FItemLookupTable& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, enum class EStretch K2Node_Select_Default);
	void FocusOnWidget(class UWidget* WidgetToFocus);
	void ScrollIntoView(class UWidget* WidgetToFind);
	void ScrollIntoTop(class UWidget* WidgetToFind);
	void ScrollIntoCenter(class UWidget* WidgetToFind);
	void ScrollToBottom();
	void ScrollToTop();
	void OnLoadoutItemButtonClicked__Internal_(enum class EItemClass ItemClass, class UClass* ItemObjectClass, bool bIsTactical, int32 TacticalSlot, bool bIsMultipleTacticalSlots, int32 MaxTacticalSlots, int32 Starting_Tactical_Slot, class UW_LoadoutItem_C* LastSelectedLoadoutItem, const TArray<class UClass*>& InvalidTacticals, const TArray<class UClass*>& ValidTacticals, bool CallFunc_NotEqual_ClassClass_ReturnValue, class UPreMissionPlanning* CallFunc_GetPremissionPlanning_ReturnValue);
	void OnLoadoutCategoryButtonHovered__Internal_(class UW_LoadoutCategory_C* LoadoutCategory, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_1, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Find_ReturnValue, class UW_LoadoutCategory_C* K2Node_DynamicCast_AsW_Loadout_Category, bool K2Node_DynamicCast_bSuccess, bool CallFunc_NotEqual_IntInt_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void OnLoadoutCategoryButtonClicked__Internal_(class UW_LoadoutCategory_C* LoadoutCategory, enum class ESlateVisibility Temp_byte_Variable, bool CallFunc_Can_Interact_Pre_Mission_Planning_CanInteract, enum class ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UW_LoadoutCategory_C*>& CallFunc_GetAllWidgetsOfClass_FoundWidgets, class UW_LoadoutCategory_C* CallFunc_Array_Get_Item, bool CallFunc_NotEqual_ObjectObject_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool Temp_bool_Variable_1, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_Variable_2, bool K2Node_SwitchEnum_CmpSuccess, enum class ESlateVisibility K2Node_Select_Default, int32 K2Node_Select_Default_1, bool CallFunc_Not_PreBool_ReturnValue, class UWidget* K2Node_Select_Default_2, class UVerticalBoxSlot* CallFunc_SlotAsVerticalBoxSlot_ReturnValue);
	void OnLoadoutCategoryButtonClicked(class UW_LoadoutCategory_C* LoadoutCategory);
	void OnLoadoutCategoryButtonHovered(class UW_LoadoutCategory_C* LoadoutCategory);
	void InitializeWidget();
	void OnLoadoutLoaded();
	void BndEvt__GoToQuartermaster_Button_K2Node_ComponentBoundEvent_11_OnPressed__DelegateSignature();
	void BndEvt__GoToQuartermaster_Button_K2Node_ComponentBoundEvent_12_OnReleased__DelegateSignature();
	void BndEvt__GoToQuartermaster_Button_K2Node_ComponentBoundEvent_16_OnClicked__DelegateSignature(class UW_StandardButton_C* CallingButton);
	void ResetAttachments();
	void OnLoadoutItemButtonClicked(enum class EItemClass ItemClass, class UClass* ItemObjectClass, bool bIsTactical, int32 TacticalSlot, bool bIsMultipleTacticalSlots, int32 MaxTacticalSlots, int32 Starting_Tactical_Slot, class UW_LoadoutItem_C* Loadout_Item_Widget);
	void OnPresetsLoaded();
	void Anim_OnSlideInFinished();
	void Anim_OnSlideOutFinished();
	void BndEvt__DefaultFireMode_ComboBox_K2Node_ComponentBoundEvent_0_OnNewOptionSelected__DelegateSignature(int32 NewOption);
	void OnDefaultWeaponFireModesLoaded();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnLoadoutCategoryButtonUnhovered(class UW_LoadoutCategory_C* LoadoutCategory);
	void Initialize_Team_mate_buttons();
	void SwapSelectedEquippingCharacter(enum class EEquippingSwat NewEquippingSwat);
	void SwapPlayer(class UW_Button_C* Button);
	void SwapAlpha(class UW_Button_C* Button);
	void SwapBeta(class UW_Button_C* Button);
	void SwapCharlie(class UW_Button_C* Button);
	void SwapDelta(class UW_Button_C* Button);
	void ExecuteUbergraph_W_LoadoutCustomizationMenu(int32 EntryPoint, class AReadyOrNotGameMode* CallFunc_GetReadyOrNotGameMode_ReturnValue, int32 CallFunc_GetNumPlayers_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool CallFunc_EqualEqual_IntInt_ReturnValue, TArray<enum class EItemCategory>& Temp_byte_Variable, enum class EItemCategory Temp_byte_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, int32 Temp_int_Array_Index_Variable, class UW_LoadoutCategory_C* K2Node_CustomEvent_LoadoutCategory_2, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UW_LoadoutCategory_C* K2Node_CustomEvent_LoadoutCategory_1, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutCategory_C* K2Node_DynamicCast_AsW_Loadout_Category, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, class UWidget* CallFunc_Array_Get_Item_1, class UW_LoadoutCategory_C* K2Node_DynamicCast_AsW_Loadout_Category_1, bool K2Node_DynamicCast_bSuccess_1, class UW_StandardButton_C* K2Node_ComponentBoundEvent_CallingButton, bool CallFunc_Array_Contains_ReturnValue, enum class EItemClass K2Node_CustomEvent_ItemClass, class UClass* K2Node_CustomEvent_ItemObjectClass, bool K2Node_CustomEvent_bIsTactical, int32 K2Node_CustomEvent_TacticalSlot, bool K2Node_CustomEvent_bIsMultipleTacticalSlots, int32 K2Node_CustomEvent_MaxTacticalSlots, int32 K2Node_CustomEvent_Starting_Tactical_Slot, class UW_LoadoutItem_C* K2Node_CustomEvent_Loadout_Item_Widget, int32 K2Node_ComponentBoundEvent_NewOption, class UClass* K2Node_ClassDynamicCast_AsBase_Weapon, bool K2Node_ClassDynamicCast_bSuccess, bool K2Node_SwitchString_CmpSuccess, class UClass* K2Node_ClassDynamicCast_AsBase_Weapon_1, bool K2Node_ClassDynamicCast_bSuccess_1, class UClass* K2Node_ClassDynamicCast_AsBase_Weapon_2, bool K2Node_ClassDynamicCast_bSuccess_2, class UClass* K2Node_ClassDynamicCast_AsBase_Weapon_3, bool K2Node_ClassDynamicCast_bSuccess_3, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, class UW_LoadoutCategory_C* K2Node_CustomEvent_LoadoutCategory, enum class EEquippingSwat K2Node_CustomEvent_NewEquippingSwat, class UW_Button_C* K2Node_CustomEvent_Button_4, class UW_Button_C* K2Node_CustomEvent_Button_3, class UPreMissionPlanning* CallFunc_GetPremissionPlanning_ReturnValue, class UW_Button_C* K2Node_CustomEvent_Button_2, class UW_Button_C* K2Node_CustomEvent_Button_1, class UW_Button_C* K2Node_CustomEvent_Button, class UPreMissionPlanning* CallFunc_GetPremissionPlanning_ReturnValue_1, bool CallFunc_IsInLobby_ReturnValue);
};

}


