#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2A8 (0xA20 - 0x778)
// WidgetBlueprintGeneratedClass W_Loadout_V2.W_Loadout_V2_C
class UW_Loadout_V2_C : public ULoadout_V2
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x778(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                BackgroundGradient;                                // 0x780(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Customization_C*                    CustomizationWidget;                               // 0x788(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          LoadoutCanvas;                                     // 0x790(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*      LoadoutCustomizationSwitcher;                      // 0x798(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          MainCanvas;                                        // 0x7A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PageWrapper_C*                      PageHeader;                                        // 0x7A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*         PresetPreviewStack;                                // 0x7B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadoutInformationBox_C*            W_LoadoutInformationBox;                           // 0x7B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                ItemData;                                          // 0x7C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	enum class EItemType                         EquippingItemType;                                 // 0x7C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                        Pad_4D0[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnPrimaryWeaponEquipped;                           // 0x7D0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnSidearmWeaponEquipped;                           // 0x7E0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnArmorMaterialEquipped;                           // 0x7F0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ACameraActor*                          WorkbenchCamera;                                   // 0x800(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FRotator                              DefaultWorkbenchCameraRotation;                    // 0x808(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	struct FRotator                              CurrentWorkbenchCameraRotation;                    // 0x814(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	struct FRotator                              TargetWorkbenchCameraRotation;                     // 0x820(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	struct FRotator                              WorkbenchCameraRotation;                           // 0x82C(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                         bWorkbenchCameraRotating;                          // 0x838(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                         bUseGamepad;                                       // 0x839(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                        Pad_4D1[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnChangedInput;                                    // 0x840(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<class FName, class UClass*>             PageMap;                                           // 0x850(0x50)(Edit, BlueprintVisible)
	TMap<class FName, class UClass*>             PageMap_Gamepad;                                   // 0x8A0(0x50)(Edit, BlueprintVisible)
	class UCommonActivatableWidget*              CurrentPage;                                       // 0x8F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class FName                                  CurrentPageID;                                     // 0x8F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	TMap<class FName, class FName>               Page_to_Camera_Tag_Map;                            // 0x900(0x50)(Edit, BlueprintVisible)
	TMap<class FName, class FString>             Page_to_Pose_Tag_Map;                              // 0x950(0x50)(Edit, BlueprintVisible)
	bool                                         bCustomization;                                    // 0x9A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bOpenedInCustomization;                            // 0x9A1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4D2[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, class FText>               MainNavigationOptions;                             // 0x9A8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                  MainNavSelection;                                  // 0x9F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_StandardModal_C*                    PresetModal;                                       // 0xA00(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        PresetCharacterLimit;                              // 0xA08(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4D3[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnPresetModified;                                  // 0xA10(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

	static class UClass* StaticClass();
	static class UW_Loadout_V2_C* GetDefaultObj();

	void BackPage(bool* Handled, class UCommonActivatableWidget* CallFunc_GetActiveWidget_ReturnValue, class UW_Overview_V2_C* K2Node_DynamicCast_AsW_Overview_V2, bool K2Node_DynamicCast_bSuccess, TScriptInterface<class IReadyOrNotUI_C> CallFunc_BackPage_self_CastInput, bool CallFunc_BackPage_Handled, TScriptInterface<class IReadyOrNotUI_C> K2Node_DynamicCast_AsReady_or_Not_UI, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_BackPage_Handled_1, class UCommonActivatableWidget* CallFunc_GetActiveWidget_ReturnValue_1);
	void GetFocusTarget(class UWidget** Focus);
	void AmmoHovered(class FName AmmoName, class FText CategoryText);
	void ClosePresetPreview(class UCommonActivatableWidget* CallFunc_GetActiveWidget_ReturnValue, class UW_Loadout_Preset_Preview_C* K2Node_DynamicCast_AsW_Loadout_Preset_Preview, bool K2Node_DynamicCast_bSuccess, TScriptInterface<class IReadyOrNotUI_C> CallFunc_Hide_self_CastInput);
	void PreviewPreset(const struct FSavedLoadout& PreviewLoadout, class UW_Loadout_Preset_Preview_C* CallFunc_BP_AddWidget_ReturnValue, class UCommonActivatableWidget* CallFunc_GetActiveWidget_ReturnValue, class UW_Loadout_Preset_Preview_C* K2Node_DynamicCast_AsW_Loadout_Preset_Preview, bool K2Node_DynamicCast_bSuccess);
	void PresetModified(bool PresetDirty);
	void CancelSavePreset(class UStandardModal* CallingModal);
	void DeleteLoadoutPreset(class UW_StandardModal_C* TriggeringModal, class FText TextEntry, const struct FSavedLoadout& CurrentLoadout, const class FString& PresetName, bool Overwriting, bool ConfirmOverwrite, const class FString& CallFunc_Conv_TextToString_ReturnValue, class AReadyOrNotGameState* CallFunc_GetReadyOrNotGameState_ReturnValue, bool CallFunc_StringIsEmpty_ReturnValue, bool CallFunc_NotEqual_StrStr_ReturnValue);
	void SaveLoadoutPreset(class UW_StandardModal_C* TriggeringModal, class FText TextEntry, const struct FSavedLoadout& CurrentLoadout, const class FString& PresetName, bool Overwriting, bool ConfirmOverwrite, const class FString& CallFunc_Conv_TextToString_ReturnValue, class AReadyOrNotGameState* CallFunc_GetReadyOrNotGameState_ReturnValue, class AReadyOrNotGameState* CallFunc_GetReadyOrNotGameState_ReturnValue_1, bool CallFunc_NotEqual_StrStr_ReturnValue, TArray<class FString>& CallFunc_GetAllPresetNames_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void OpenPresetSaveModal(const class FString& CurrentPreset, bool bDelete, class FText Temp_text_Variable, class FText Temp_text_Variable_1, bool Temp_bool_Variable, bool Temp_bool_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, const struct FAnchors& K2Node_MakeStruct_Anchors, bool Temp_bool_Variable_2, class FText Temp_text_Variable_4, class UW_StandardModal_C* CallFunc_Create_ReturnValue, class AReadyOrNotGameState* CallFunc_GetReadyOrNotGameState_ReturnValue, TArray<class FString>& CallFunc_GetAllPresetNames_ReturnValue, class FText K2Node_Select_Default, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, class FText K2Node_Select_Default_1, class FText CallFunc_Conv_StringToText_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class FText CallFunc_Format_ReturnValue, const struct FVector2D& Temp_struct_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, FDelegateProperty_ K2Node_Select_Default_2, class UCanvasPanelSlot* CallFunc_AddChildToCanvas_ReturnValue);
	void ShowMainNav();
	void ShowWeaponClassNav(enum class EItemClass SelectedClass, bool bIsSecondary, bool bShowLessLethal, enum class EItemClass NewCategory, TSet<enum class EItemClass> SecondaryClasses, TMap<class FName, class FText> TempOptionMap, TSet<enum class EItemClass> PrimaryClasses, bool Temp_bool_Variable, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, class FText CallFunc_GetItemClassText_Category_Text, class FName CallFunc_Conv_StringToName_ReturnValue, int32 Temp_int_Variable, int32 Temp_int_Variable_1, uint8 CallFunc_Conv_IntToByte_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, uint8 CallFunc_GetValidValue_ReturnValue, uint8 CallFunc_Conv_IntToByte_ReturnValue_1, uint8 CallFunc_GetEnumeratorValueFromIndex_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue, TSet<enum class EItemClass> K2Node_MakeVariable_MakeVariableOutput, TSet<enum class EItemClass> K2Node_MakeVariable_MakeVariableOutput_1, int32 CallFunc_MakeLiteralInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1, class FName CallFunc_Conv_StringToName_ReturnValue_1, TSet<enum class EItemClass> K2Node_Select_Default, bool CallFunc_Set_Contains_ReturnValue);
	class UWidget* BP_GetDesiredFocusTarget(TScriptInterface<class IReadyOrNotUI_C> CallFunc_GetFocusTarget_self_CastInput, class UWidget* CallFunc_GetFocusTarget_Focus);
	void SetCameraAndPose(class FName CameraTag, const class FString& PoseTag, float BlendTime, class AReadyOrNotGameState* CallFunc_GetReadyOrNotGameState_ReturnValue, bool CallFunc_StringIsEmpty_ReturnValue, class AReadyOrNotGameState* CallFunc_GetReadyOrNotGameState_ReturnValue_1);
	void SetCameraAndPoseByPageID(class FName PageNameID, float BlendTime, class FName CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, const class FString& CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, class AReadyOrNotGameState* CallFunc_GetReadyOrNotGameState_ReturnValue);
	void SlotUnhovered();
	void ArmorMaterialHovered(class UArmourMaterial* ArmorMaterial, bool CallFunc_IsValid_ReturnValue);
	void AttachmentHovered(class UWeaponAttachment* Attachment, enum class EWeaponAttachmentType AttachmentType, class FText CallFunc_GetAttachmentSlotText_SlotText, bool CallFunc_IsValid_ReturnValue);
	void ItemHovered(class ABaseItem* BaseItem, class FText CategoryText, bool CallFunc_IsValid_ReturnValue);
	void WeaponHovered(class ABaseWeapon* BaseWeaponItem, bool Secondary, class FText Temp_text_Variable, bool CallFunc_IsValid_ReturnValue, class FText Temp_text_Variable_1, bool Temp_bool_Variable, class FText K2Node_Select_Default, class UClass* CallFunc_GetClassFromObject_ReturnValue, class UClass* K2Node_ClassDynamicCast_AsBase_Weapon, bool K2Node_ClassDynamicCast_bSuccess);
	bool BP_OnHandleBackAction(bool CallFunc_BackPage_Handled);
	void CheckOverviewIsActive(bool* TURR, class UOverview_V2* K2Node_DynamicCast_AsOverview_V2, bool K2Node_DynamicCast_bSuccess);
	void SetCategoryPoses(enum class EItemCategory Temp_byte_Variable, const class FString& Temp_string_Variable, enum class EItemCategory Temp_byte_Variable_1, const class FString& Temp_string_Variable_1, enum class EItemCategory Temp_byte_Variable_2, const class FString& Temp_string_Variable_2, enum class EItemCategory Temp_byte_Variable_3, const class FString& Temp_string_Variable_3);
	void SetCategoryCameraTags(enum class EItemCategory Temp_byte_Variable, class FName Temp_name_Variable, enum class EItemCategory Temp_byte_Variable_1, class FName Temp_name_Variable_1, enum class EItemCategory Temp_byte_Variable_2, class FName Temp_name_Variable_2, enum class EItemCategory Temp_byte_Variable_3, class FName Temp_name_Variable_3, enum class EItemCategory Temp_byte_Variable_4, class FName Temp_name_Variable_4);
	void UpdateAllPreviewWeaponAttachments(bool IsWorkbench, TSubclassOf<class ABaseItem>& Weapon, bool IsSidearm, const struct FSavedLoadout& ActiveLoadout, const TArray<class UClass*>& Attachments, bool Temp_bool_Variable, const struct FSavedWeaponAttachmentData& K2Node_MakeStruct_SavedWeaponAttachmentData, bool CallFunc_EqualEqual_ClassClass_ReturnValue, const struct FSavedWeaponAttachmentData& K2Node_MakeStruct_SavedWeaponAttachmentData_1, bool CallFunc_EqualEqual_ClassClass_ReturnValue_1, bool Temp_bool_Variable_1, bool CallFunc_BooleanOR_ReturnValue, const struct FSavedWeaponAttachmentData& K2Node_Select_Default, bool Temp_bool_Variable_2, int32 Temp_int_Variable, class AReadyOrNotGameState* CallFunc_GetReadyOrNotGameState_ReturnValue, int32 Temp_int_Variable_1, const struct FSavedLoadout& CallFunc_GetActiveLoadout_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class AReadyOrNotPlayerController* CallFunc_GetReadyOrNotPlayerController_ReturnValue, class UWorld* CallFunc_GetWorldBP_ReturnValue, const struct FSavedWeaponAttachmentData& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UItemData* CallFunc_GetItemData_ReturnValue, const struct FSavedWeaponAttachmentData& K2Node_MakeStruct_SavedWeaponAttachmentData_2, const struct FSavedWeaponAttachmentData& K2Node_Select_Default_1, const struct FSavedWeaponAttachmentData& K2Node_Select_Default_2, class UClass* K2Node_Select_Default_3);
	void EquipArmourMaterial(class UArmourMaterial* ArmourMaterial);
	void SetPresetModified(bool PresetDirty);
	void EquipItem(class UClass* ItemData, const TArray<enum class EItemCategory>& ItemCategories, enum class EItemClass EquippingItemClass, class UClass* EquippingItem, enum class EItemCategory Temp_byte_Variable, class UClass* K2Node_ClassDynamicCast_AsBase_Weapon, bool K2Node_ClassDynamicCast_bSuccess, const struct FWeaponData& K2Node_MakeStruct_WeaponData, enum class EItemCategory Temp_byte_Variable_1, enum class EItemCategory Temp_byte_Variable_2, enum class EItemCategory Temp_byte_Variable_3, enum class EItemCategory Temp_byte_Variable_4, class AReadyOrNotGameState* CallFunc_GetReadyOrNotGameState_ReturnValue, class AReadyOrNotGameState* CallFunc_GetReadyOrNotGameState_ReturnValue_1, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Array_Contains_ReturnValue_1, class UW_LoadoutSlot_C* K2Node_DynamicCast_AsW_Loadout_Slot, bool K2Node_DynamicCast_bSuccess, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Array_Contains_ReturnValue_2, bool CallFunc_Array_Contains_ReturnValue_3, class UDataTable* CallFunc_GetItemLookupDataTable_ReturnValue, bool CallFunc_Array_Contains_ReturnValue_4, const struct FItemLookupTable& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue);
	void OpenItemList(bool VerticalList, enum class EItemCategory LoadoutSlot, TArray<struct FLoadoutCategory>& GearCategoryClasses, class UW_Loadout_ItemList_Vertical_C* ItemList, class FText CallFunc_GetLoadoutCategoryText_Category_Text, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue);
	void SetPreMissionCameraBySlot(enum class EItemCategory LoadoutSlot, float BlendTime, class FName CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, const class FString& CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1);
	void HolsterPreviewCharacterWeapon(bool* IsHolstering, class AReadyOrNotCharacter* CallFunc_GetDefaultPreviewCharacter_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, const class FString& CallFunc_GetLastTableMontagePlayed_ReturnValue, class UFMODAudioComponent* CallFunc_PlayEventAttached_ReturnValue, float CallFunc_IsTableMontagePlayingWithTimeRemaining_TimeRemaining, bool CallFunc_IsTableMontagePlayingWithTimeRemaining_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, const class FString& CallFunc_SelectString_ReturnValue, const class FString& CallFunc_SelectString_ReturnValue_1);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void HeaderSubpageNavigation(class FName OptionNameID);
	void SetLoadoutWidget(class UW_Loadout_C* LoadoutWidget);
	void UpdateCurrentItemMap(TMap<enum class EItemCategory, class UClass*> ItemCategory);
	void UpdateCurrentSlot(class UW_LoadoutSlot_C* CurrentSlot);
	void UpdateActiveLoadout(const struct FSavedLoadout& ActiveLoadout);
	void SetInputMode(bool IsGamepad);
	void Hide(float Delay, bool Collapse);
	void Reveal(float Delay);
	void OnAttachmentSlotClicked(class UClass* Attaching_Weapon, class UClass* Attachment_Data);
	void InputMethodChanged(enum class ECommonInputType bNewInputType);
	void SetPreMissionCamera(class FName Tag, const class FString& Animation, float BlendTime);
	void SetCurrentPageID(class FName CurrentPageID);
	void ChangePage(class FName PageName);
	void BndEvt__W_Loadout_V2_Header_K2Node_ComponentBoundEvent_1_OnNavOptionSelected__DelegateSignature(class FName OptionNameID);
	void OpenCustomization();
	void SwitchToLoadout();
	void SwitchToCustomization();
	void BndEvt__W_Loadout_V2_CustomizationWidget_K2Node_ComponentBoundEvent_4_OnCategorySelected__DelegateSignature(class FName CameraTag, const class FString& CharacterPose);
	void BndEvt__W_Loadout_V2_PageHeader_K2Node_ComponentBoundEvent_2_OnFooterButtonClicked__DelegateSignature(const class FString& ButtonID);
	void ExecuteUbergraph_W_Loadout_V2(int32 EntryPoint, bool CallFunc_HolsterPreviewCharacterWeapon_IsHolstering, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, bool K2Node_Event_IsDesignTime, class FName K2Node_Event_OptionNameID, class UW_Loadout_C* K2Node_Event_LoadoutWidget, TMap<enum class EItemCategory, class UClass*> K2Node_Event_ItemCategory, class UW_LoadoutSlot_C* K2Node_Event_CurrentSlot, const struct FSavedLoadout& K2Node_Event_ActiveLoadout, bool K2Node_Event_IsGamepad, float K2Node_Event_Delay_1, bool K2Node_Event_Collapse, float K2Node_Event_Delay, class UClass* K2Node_CustomEvent_Attaching_Weapon, class UClass* K2Node_CustomEvent_Attachment_Data, int32 Temp_int_Array_Index_Variable, class ABaseItem* CallFunc_GetClassDefaultObject_ReturnValue, class AReadyOrNotGameState* CallFunc_GetReadyOrNotGameState_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, const struct FSavedLoadout& CallFunc_GetActiveLoadout_ReturnValue, enum class ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool CallFunc_IsValid_ReturnValue, enum class ECommonInputType K2Node_CustomEvent_bNewInputType, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_EqualEqual_ByteByte_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class FName K2Node_CustomEvent_Tag, const class FString& K2Node_CustomEvent_Animation, float K2Node_CustomEvent_BlendTime, bool CallFunc_NotEqual_StrStr_ReturnValue, bool CallFunc_IsEmpty_ReturnValue, const class FString& CallFunc_SelectString_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue, class UCommonActivatableWidget* CallFunc_GetActiveWidget_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, TScriptInterface<class IReadyOrNotUI_C> K2Node_DynamicCast_AsReady_or_Not_UI, bool K2Node_DynamicCast_bSuccess, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool CallFunc_CheckOverviewIsActive_True, bool CallFunc_Not_PreBool_ReturnValue, class FName K2Node_CustomEvent_CurrentPageID, bool CallFunc_BackPage_Handled, class FName K2Node_Event_PageName, bool Temp_bool_Variable, class FName K2Node_Select_Default, class UClass* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UCommonActivatableWidget* CallFunc_BP_AddWidget_ReturnValue, class FName K2Node_ComponentBoundEvent_OptionNameID, bool K2Node_SwitchName_CmpSuccess, class FName K2Node_ComponentBoundEvent_CameraTag, const class FString& K2Node_ComponentBoundEvent_CharacterPose, const class FString& K2Node_ComponentBoundEvent_ButtonID, bool CallFunc_EqualEqual_StrStr_ReturnValue, TArray<class UUserWidget*>& CallFunc_GetAllWidgetsWithInterface_FoundWidgets, class UUserWidget* CallFunc_Array_Get_Item, TScriptInterface<class ILoadoutUI_C> K2Node_DynamicCast_AsLoadout_UI, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void OnPresetModified__DelegateSignature(bool PresetDirty);
	void OnChangedInput__DelegateSignature(bool UsingGamepad);
	void OnArmorMaterialEquipped__DelegateSignature();
	void OnSidearmWeaponEquipped__DelegateSignature();
	void OnPrimaryWeaponEquipped__DelegateSignature();
};

}


