#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x71 (0x71 - 0x0)
// UserDefinedStruct SStandardModalDetails.SStandardModalDetails
struct FSStandardModalDetails
{
public:
	class FText                                  TitleBar_2_DF32DAB1427EA41B35266B8FA2882F03;       // 0x0(0x18)(Edit, BlueprintVisible)
	class FText                                  ModalDescription_5_73039887468A065EF94BD6B00B763A0F; // 0x18(0x18)(Edit, BlueprintVisible)
	bool                                         ShowCancelButton_8_3133E249417BF24BD8FDEE9293EC1BA8; // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         ShowOkButton_10_154CC1C14289052054A2538C427153B7;  // 0x31(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         ShowApplyButton_12_7DCFDAE1499BE72B8C447695443D4FEE; // 0x32(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1AEB[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OkButtonText_20_F49F44344D3A0F0CBB7DCC8BCB17010E;  // 0x38(0x18)(Edit, BlueprintVisible)
	struct FVector2D                             Size_28_F9A951CA4483BA8FED7F839B4DCF7AAA;          // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CancelButtonText_22_7F5E5E7047878934462E0DA8388B825F; // 0x58(0x18)(Edit, BlueprintVisible)
	bool                                         RequireScrollToBottom_26_3CEF956B41C5CF8E596FF3A70938CB28; // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}


