#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x60 (0x2D8 - 0x278)
// WidgetBlueprintGeneratedClass W_LoadoutItem_Presets.W_LoadoutItem_Presets_C
class UW_LoadoutItem_Presets_C : public UBaseWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x278(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_LoadoutItem_Preset_C*               LoadoutItem_Preset_1;                              // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadoutItem_Preset_C*               LoadoutItem_Preset_2;                              // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadoutItem_Preset_C*               LoadoutItem_Preset_3;                              // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadoutItem_Preset_C*               LoadoutItem_Preset_4;                              // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadoutItem_Preset_C*               LoadoutItem_Preset_Default;                        // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          LoadoutItem_Presets_Container;                     // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadoutItem_Preset_C*               LoadoutItem_WeaponTable;                           // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                        SelectedRow;                                       // 0x2B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bAnyKeyDown;                                       // 0x2BC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bLoaded;                                           // 0x2BD(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5F7[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                LastSetItemClass;                                  // 0x2C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_LoadoutItem_Preset_C*               LastSelectedPreset;                                // 0x2C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_LoadoutCustomizationMenu_C*         Owner;                                             // 0x2D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UW_LoadoutItem_Presets_C* GetDefaultObj();

	void LoadPresets__ItemClass_(class UClass*& ItemClass, int32 PresetSelectedIndex, int32 CallFunc_FindSelectedPreset_Return_Value, class UW_LoadoutItem_Preset_C* CallFunc_FindSelectedPreset_Loadout_Item_Preset, const struct FSavedWeaponPreset& CallFunc_GetWeaponPresetsData_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue);
	void FindSelectedPreset(class UClass*& ItemClass, int32* Return_Value, class UW_LoadoutItem_Preset_C** Loadout_Item_Preset, const struct FSavedWeaponPreset& CallFunc_GetWeaponPresetsData_ReturnValue);
	void CanRenamePreset(bool* Return_Value, class UW_LoadoutItem_Preset_C* CallFunc_GetSelectedPresetWidget_Return_Value, bool CallFunc_CanRename_Return_Value, bool CallFunc_IsValid_ReturnValue);
	void GetSelectedPresetWidget(class UW_LoadoutItem_Preset_C** Return_Value, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutItem_Preset_C* K2Node_DynamicCast_AsW_Loadout_Item_Preset, bool K2Node_DynamicCast_bSuccess);
	void IsRenamingPreset(bool* Return_Value, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutItem_Preset_C* K2Node_DynamicCast_AsW_Loadout_Item_Preset, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsRenaming_Return_Value);
	void ConflictsWithOtherPresets(class UW_LoadoutItem_Preset_C* Loadout_Item_Preset, class FText& InText, bool* Return_Value, class FText TestingPresetText, const class FString& CallFunc_Conv_TextToString_ReturnValue, bool CallFunc_TextIsEmpty_ReturnValue, const class FString& CallFunc_Replace_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UW_LoadoutItem_Preset_C* K2Node_DynamicCast_AsW_Loadout_Item_Preset, bool K2Node_DynamicCast_bSuccess, bool CallFunc_NotEqual_ObjectObject_ReturnValue, class FText CallFunc_GetText_CurrentText, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, const class FString& CallFunc_Replace_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue_1, bool CallFunc_EqualEqual_IgnoreCase_TextText_ReturnValue);
	void UnhoverAllPresetsExcept(class UW_LoadoutItem_Preset_C* Loadout_Item_Preset);
	void DeselectAllPresetsExcept(class UW_LoadoutItem_Preset_C* Loadout_Item_Preset);
	void StopRenamingPreset(TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutItem_Preset_C* K2Node_DynamicCast_AsW_Loadout_Item_Preset, bool K2Node_DynamicCast_bSuccess);
	void StartRenamingPreset(TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutItem_Preset_C* K2Node_DynamicCast_AsW_Loadout_Item_Preset, bool K2Node_DynamicCast_bSuccess);
	void Enter(bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_HasKeyboardFocus_ReturnValue);
	void Exit(class UWidget* CallFunc_GetCurrentlyFocusedWidget_Return_Value, class UW_LoadoutClass_C* K2Node_DynamicCast_AsW_Loadout_Class, bool K2Node_DynamicCast_bSuccess);
	void Escape(bool CallFunc_IsRenamingPreset_Return_Value);
	void Select(int32 Index, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutItem_Preset_C* K2Node_DynamicCast_AsW_Loadout_Item_Preset, bool K2Node_DynamicCast_bSuccess);
	void Click(TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutItem_Preset_C* K2Node_DynamicCast_AsW_Loadout_Item_Preset, bool K2Node_DynamicCast_bSuccess);
	void Unhover(TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutItem_Preset_C* K2Node_DynamicCast_AsW_Loadout_Item_Preset, bool K2Node_DynamicCast_bSuccess);
	void Hover(TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UW_LoadoutItem_Preset_C* K2Node_DynamicCast_AsW_Loadout_Item_Preset, bool K2Node_DynamicCast_bSuccess);
	void PreviousRow(int32 CallFunc_GetChildrenCount_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, int32 CallFunc_Clamp_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue);
	void NextRow(int32 CallFunc_GetChildrenCount_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Clamp_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent, const struct FEventReply& CallFunc_Handled_ReturnValue, bool CallFunc_HandleMenuWideMultiInput__Up__Return_Value);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent, const struct FKey& CallFunc_GetKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_HandleMenuWideMultiInput__Down__Return_Value, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue_2, bool CallFunc_EqualEqual_KeyKey_ReturnValue_3, const struct FKey& CallFunc_GetKey_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_3, const struct FKey& CallFunc_GetKey_ReturnValue_2, const struct FKey& CallFunc_GetKey_ReturnValue_3, bool CallFunc_EqualEqual_KeyKey_ReturnValue_6, bool CallFunc_EqualEqual_KeyKey_ReturnValue_7, bool CallFunc_EqualEqual_KeyKey_ReturnValue_8, bool CallFunc_EqualEqual_KeyKey_ReturnValue_9, bool CallFunc_BooleanOR_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_5, const struct FKey& CallFunc_GetKey_ReturnValue_4, const struct FKey& CallFunc_GetKey_ReturnValue_5, bool CallFunc_EqualEqual_KeyKey_ReturnValue_10, bool CallFunc_EqualEqual_KeyKey_ReturnValue_11, bool CallFunc_EqualEqual_KeyKey_ReturnValue_12, bool CallFunc_EqualEqual_KeyKey_ReturnValue_13, bool CallFunc_EqualEqual_KeyKey_ReturnValue_14, bool CallFunc_BooleanOR_ReturnValue_6, bool CallFunc_EqualEqual_KeyKey_ReturnValue_15, bool CallFunc_BooleanOR_ReturnValue_7, bool CallFunc_BooleanOR_ReturnValue_8, bool CallFunc_BooleanOR_ReturnValue_9, const struct FKey& CallFunc_GetKey_ReturnValue_6, bool CallFunc_EqualEqual_KeyKey_ReturnValue_16, bool CallFunc_EqualEqual_KeyKey_ReturnValue_17, bool CallFunc_EqualEqual_KeyKey_ReturnValue_18, bool CallFunc_EqualEqual_KeyKey_ReturnValue_19, const struct FKey& CallFunc_GetKey_ReturnValue_7, bool CallFunc_BooleanOR_ReturnValue_10, bool CallFunc_EqualEqual_KeyKey_ReturnValue_20, bool CallFunc_BooleanOR_ReturnValue_11, bool CallFunc_EqualEqual_KeyKey_ReturnValue_21, bool CallFunc_BooleanOR_ReturnValue_12, bool CallFunc_EqualEqual_KeyKey_ReturnValue_22, bool CallFunc_EqualEqual_KeyKey_ReturnValue_23, const struct FKey& CallFunc_GetKey_ReturnValue_8, bool CallFunc_BooleanOR_ReturnValue_13, bool CallFunc_EqualEqual_KeyKey_ReturnValue_24, bool CallFunc_BooleanOR_ReturnValue_14, bool CallFunc_EqualEqual_KeyKey_ReturnValue_25, bool CallFunc_BooleanOR_ReturnValue_15, bool CallFunc_EqualEqual_KeyKey_ReturnValue_26, bool CallFunc_EqualEqual_KeyKey_ReturnValue_27, bool CallFunc_BooleanOR_ReturnValue_16, bool CallFunc_BooleanOR_ReturnValue_17, bool CallFunc_HandleMenuWideInput_Return_Value, bool CallFunc_BooleanOR_ReturnValue_18, class UW_LoadoutItem_Preset_C* CallFunc_GetSelectedPresetWidget_Return_Value, const struct FEventReply& CallFunc_Handled_ReturnValue, const struct FEventReply& CallFunc_Handled_ReturnValue_1, bool CallFunc_IsUIHidden_Return_Value, const struct FEventReply& CallFunc_Handled_ReturnValue_2, const struct FEventReply& CallFunc_Handled_ReturnValue_3, const struct FEventReply& CallFunc_Handled_ReturnValue_4, const struct FEventReply& CallFunc_Handled_ReturnValue_5);
	void InitializeWidget();
	void OnLoadoutItemPresetButtonClicked(class UW_LoadoutItem_Preset_C* LoadoutItemPresetWidget);
	void OnLoadoutItemPresetButtonHovered(class UW_LoadoutItem_Preset_C* LoadoutItemPresetWidget);
	void Construct();
	void ExecuteUbergraph_W_LoadoutItem_Presets(int32 EntryPoint, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, class UW_LoadoutItem_Preset_C* K2Node_CustomEvent_LoadoutItemPresetWidget_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UW_LoadoutItem_Preset_C* K2Node_DynamicCast_AsW_Loadout_Item_Preset, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, class UW_LoadoutItem_Preset_C* K2Node_CustomEvent_LoadoutItemPresetWidget, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_1, int32 CallFunc_Array_Find_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1);
};

}


