#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamupdateBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountTeamupdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamupdateBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountTeamupdateBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamgetBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountTeamgetBPS__DelegateSignature_Params
{
public:
	struct FZeuzTeam                             Result;                                            // 0x0(0xC8)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamgetBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountTeamgetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamgetBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountTeamgetBP__DelegateSignature_Params
{
public:
	struct FZeuzTeam                             Result;                                            // 0x0(0xC8)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xC8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamdeleteBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountTeamdeleteBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamdeleteBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountTeamdeleteBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamcreateBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountTeamcreateBPS__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamcreateBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountTeamcreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountTeamcreateBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountTeamcreateBP__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotasetBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountQuotasetBPS__DelegateSignature_Params
{
public:
	struct FZeuzAccountQuotaInfo                 Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotasetBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountQuotasetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotasetBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountQuotasetBP__DelegateSignature_Params
{
public:
	struct FZeuzAccountQuotaInfo                 Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x18(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotagetBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountQuotagetBPS__DelegateSignature_Params
{
public:
	struct FZeuzAccountQuotaInfo                 Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotagetBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountQuotagetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountQuotagetBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountQuotagetBP__DelegateSignature_Params
{
public:
	struct FZeuzAccountQuotaInfo                 Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x18(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectupdateBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectupdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectupdateBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectupdateBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectsgetBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectsgetBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzProj>                     Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectsgetBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectsgetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectsgetBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectsgetBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzProj>                     Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectgetBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectgetBPS__DelegateSignature_Params
{
public:
	struct FZeuzProj                             Result;                                            // 0x0(0xC8)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectgetBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectgetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectgetBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectgetBP__DelegateSignature_Params
{
public:
	struct FZeuzProj                             Result;                                            // 0x0(0xC8)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xC8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectdeleteBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectdeleteBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectdeleteBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectdeleteBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectcreateBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectcreateBPS__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectcreateBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectcreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountProjectcreateBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountProjectcreateBP__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvupdateBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvupdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvupdateBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvupdateBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvsgetBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvsgetBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzEnv>                      Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvsgetBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvsgetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvsgetBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvsgetBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzEnv>                      Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvserviceupdateBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvserviceupdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvserviceupdateBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvserviceupdateBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvservicedeleteBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvservicedeleteBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvservicedeleteBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvservicedeleteBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvgetBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvgetBPS__DelegateSignature_Params
{
public:
	struct FZeuzEnv                              Result;                                            // 0x0(0xE8)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvgetBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvgetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF8 (0xF8 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvgetBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvgetBP__DelegateSignature_Params
{
public:
	struct FZeuzEnv                              Result;                                            // 0x0(0xE8)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xE8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvdeleteBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvdeleteBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvdeleteBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvdeleteBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvcreateBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvcreateBPS__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvcreateBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvcreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountEnvcreateBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountEnvcreateBP__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevquicksetupBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevquicksetupBPS__DelegateSignature_Params
{
public:
	struct FZeuzAccountDevQuickSetupOut          Result;                                            // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevquicksetupBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevquicksetupBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x90 (0x90 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevquicksetupBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevquicksetupBP__DelegateSignature_Params
{
public:
	struct FZeuzAccountDevQuickSetupOut          Result;                                            // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x80(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperupdateBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperupdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperupdateBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperupdateBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersgetBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopersgetBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzDeveloper>                Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersgetBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopersgetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersgetBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopersgetBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzDeveloper>                Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersetpwhashBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopersetpwhashBPS__DelegateSignature_Params
{
public:
	struct FZeuzDeveloper                        Result;                                            // 0x0(0x120)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersetpwhashBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopersetpwhashBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x130 (0x130 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopersetpwhashBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopersetpwhashBP__DelegateSignature_Params
{
public:
	struct FZeuzDeveloper                        Result;                                            // 0x0(0x120)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x120(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperrevokeBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperrevokeBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperrevokeBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperrevokeBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetrequestBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperpasswordresetrequestBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetrequestBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperpasswordresetrequestBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperpasswordresetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperpasswordresetBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperpasswordresetBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperispasswordresethashexpiredBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperispasswordresethashexpiredBPS__DelegateSignature_Params
{
public:
	bool                                         Result;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperispasswordresethashexpiredBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperispasswordresethashexpiredBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperispasswordresethashexpiredBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperispasswordresethashexpiredBP__DelegateSignature_Params
{
public:
	bool                                         Result;                                            // 0x0(0x1)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A6D[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Error;                                             // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperinviteBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperinviteBPS__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperinviteBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperinviteBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDeveloperinviteBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDeveloperinviteBP__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopergetBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopergetBPS__DelegateSignature_Params
{
public:
	struct FZeuzDeveloper                        Result;                                            // 0x0(0x120)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopergetBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopergetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x130 (0x130 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopergetBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopergetBP__DelegateSignature_Params
{
public:
	struct FZeuzDeveloper                        Result;                                            // 0x0(0x120)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x120(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreatepwhashBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopercreatepwhashBPS__DelegateSignature_Params
{
public:
	struct FZeuzDeveloper                        Result;                                            // 0x0(0x120)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreatepwhashBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopercreatepwhashBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x130 (0x130 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreatepwhashBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopercreatepwhashBP__DelegateSignature_Params
{
public:
	struct FZeuzDeveloper                        Result;                                            // 0x0(0x120)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x120(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreateBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopercreateBPS__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreateBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopercreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountDevelopercreateBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountDevelopercreateBP__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountupdateBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountAccountupdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountupdateBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountAccountupdateBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x168 (0x168 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountgetBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountAccountgetBPS__DelegateSignature_Params
{
public:
	struct FZeuzAccount                          Result;                                            // 0x0(0x168)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountgetBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountAccountgetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x178 (0x178 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountgetBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountAccountgetBP__DelegateSignature_Params
{
public:
	struct FZeuzAccount                          Result;                                            // 0x0(0x168)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x168(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountcreateBPS__DelegateSignature
struct UZeuzApiAccount_DelegateAccountAccountcreateBPS__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountcreateBPF__DelegateSignature
struct UZeuzApiAccount_DelegateAccountAccountcreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAccount.DelegateAccountAccountcreateBP__DelegateSignature
struct UZeuzApiAccount_DelegateAccountAccountcreateBP__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x190 (0x190 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountTeamupdateBP
struct UZeuzApiAccount_AccountTeamupdateBP_Params
{
public:
	struct FZeuzTeam                             In;                                                // 0x0(0xC8)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xC8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xD8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xE8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xF8(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountTeamgetBP
struct UZeuzApiAccount_AccountTeamgetBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountTeamdeleteBP
struct UZeuzApiAccount_AccountTeamdeleteBP_Params
{
public:
	struct FZeuzAccountTeamDeleteIn              In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x130 (0x130 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountTeamcreateBP
struct UZeuzApiAccount_AccountTeamcreateBP_Params
{
public:
	struct FZeuzAccountTeamCreateIn              In;                                                // 0x0(0x68)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x88(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x98(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountQuotasetBP
struct UZeuzApiAccount_AccountQuotasetBP_Params
{
public:
	struct FZeuzAccountQuotaInfo                 In;                                                // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x18(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x48(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountQuotagetBP
struct UZeuzApiAccount_AccountQuotagetBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x190 (0x190 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountProjectupdateBP
struct UZeuzApiAccount_AccountProjectupdateBP_Params
{
public:
	struct FZeuzProj                             In;                                                // 0x0(0xC8)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xC8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xD8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xE8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xF8(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountProjectsgetBP
struct UZeuzApiAccount_AccountProjectsgetBP_Params
{
public:
	TArray<class FString>                        In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountProjectgetBP
struct UZeuzApiAccount_AccountProjectgetBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountProjectdeleteBP
struct UZeuzApiAccount_AccountProjectdeleteBP_Params
{
public:
	struct FZeuzAccountProjectDeleteIn           In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountProjectcreateBP
struct UZeuzApiAccount_AccountProjectcreateBP_Params
{
public:
	struct FZeuzAccountProjectCreateIn           In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1B0 (0x1B0 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountEnvupdateBP
struct UZeuzApiAccount_AccountEnvupdateBP_Params
{
public:
	struct FZeuzEnv                              In;                                                // 0x0(0xE8)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xE8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xF8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x108(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x118(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountEnvsgetBP
struct UZeuzApiAccount_AccountEnvsgetBP_Params
{
public:
	TArray<class FString>                        In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x100 (0x100 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountEnvserviceupdateBP
struct UZeuzApiAccount_AccountEnvserviceupdateBP_Params
{
public:
	struct FZeuzServiceCfg                       In;                                                // 0x0(0x38)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x38(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x48(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x68(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountEnvservicedeleteBP
struct UZeuzApiAccount_AccountEnvservicedeleteBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountEnvgetBP
struct UZeuzApiAccount_AccountEnvgetBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountEnvdeleteBP
struct UZeuzApiAccount_AccountEnvdeleteBP_Params
{
public:
	struct FZeuzAccountEnvDeleteIn               In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountEnvcreateBP
struct UZeuzApiAccount_AccountEnvcreateBP_Params
{
public:
	struct FZeuzAccountEnvCreateIn               In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xF8 (0xF8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDevquicksetupBP
struct UZeuzApiAccount_AccountDevquicksetupBP_Params
{
public:
	struct FZeuzAccountDevQuickSetupIn           In;                                                // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x60(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1E8 (0x1E8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDeveloperupdateBP
struct UZeuzApiAccount_AccountDeveloperupdateBP_Params
{
public:
	struct FZeuzDeveloper                        In;                                                // 0x0(0x120)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x120(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x130(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x140(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x150(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDevelopersgetBP
struct UZeuzApiAccount_AccountDevelopersgetBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDevelopersetpwhashBP
struct UZeuzApiAccount_AccountDevelopersetpwhashBP_Params
{
public:
	struct FZeuzAccountDeveloperSetPwHashIn      In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDeveloperrevokeBP
struct UZeuzApiAccount_AccountDeveloperrevokeBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDeveloperpasswordresetrequestBP
struct UZeuzApiAccount_AccountDeveloperpasswordresetrequestBP_Params
{
public:
	struct FZeuzAccountDeveloperPasswordResetIn  In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x108 (0x108 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDeveloperpasswordresetBP
struct UZeuzApiAccount_AccountDeveloperpasswordresetBP_Params
{
public:
	struct FZeuzAccountDeveloperPasswordResetExecuteRequestIn In;                                                // 0x0(0x40)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x60(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x70(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDeveloperispasswordresethashexpiredBP
struct UZeuzApiAccount_AccountDeveloperispasswordresethashexpiredBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x148 (0x148 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDeveloperinviteBP
struct UZeuzApiAccount_AccountDeveloperinviteBP_Params
{
public:
	struct FZeuzAccountDeveloperCreateIn         In;                                                // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x80(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x90(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xA0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xB0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDevelopergetBP
struct UZeuzApiAccount_AccountDevelopergetBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x108 (0x108 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDevelopercreatepwhashBP
struct UZeuzApiAccount_AccountDevelopercreatepwhashBP_Params
{
public:
	struct FZeuzAccountDeveloperCreatePwHashIn   In;                                                // 0x0(0x40)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x60(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x70(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x148 (0x148 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountDevelopercreateBP
struct UZeuzApiAccount_AccountDevelopercreateBP_Params
{
public:
	struct FZeuzAccountDeveloperCreateIn         In;                                                // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x80(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x90(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xA0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xB0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x230 (0x230 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountAccountupdateBP
struct UZeuzApiAccount_AccountAccountupdateBP_Params
{
public:
	struct FZeuzAccount                          In;                                                // 0x0(0x168)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x168(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x178(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x188(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x198(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountAccountgetBP
struct UZeuzApiAccount_AccountAccountgetBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x190 (0x190 - 0x0)
// Function Zeuzsdk.ZeuzApiAccount.AccountAccountcreateBP
struct UZeuzApiAccount_AccountAccountcreateBP_Params
{
public:
	struct FZeuzAccountCreateIn                  In;                                                // 0x0(0xC8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xC8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xD8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xE8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xF8(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminStatsBPS__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminStatsBPS__DelegateSignature_Params
{
public:
	struct FZeuzAdminStatsOut                    Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminStatsBPF__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminStatsBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminStatsBP__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminStatsBP__DelegateSignature_Params
{
public:
	struct FZeuzAdminStatsOut                    Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminProjectsBPS__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminProjectsBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzProj>                     Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminProjectsBPF__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminProjectsBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminProjectsBP__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminProjectsBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzProj>                     Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminLogsBPS__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminLogsBPS__DelegateSignature_Params
{
public:
	struct FZeuzLogsearchOut                     Result;                                            // 0x0(0x10)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminLogsBPF__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminLogsBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminLogsBP__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminLogsBP__DelegateSignature_Params
{
public:
	struct FZeuzLogsearchOut                     Result;                                            // 0x0(0x10)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminItemsBPS__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminItemsBPS__DelegateSignature_Params
{
public:
	struct FZeuzAdminItemsOut                    Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminItemsBPF__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminItemsBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminItemsBP__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminItemsBP__DelegateSignature_Params
{
public:
	struct FZeuzAdminItemsOut                    Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminGetquotaBPS__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminGetquotaBPS__DelegateSignature_Params
{
public:
	int32                                        Result;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminGetquotaBPF__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminGetquotaBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminGetquotaBP__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminGetquotaBP__DelegateSignature_Params
{
public:
	int32                                        Result;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_CED[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Error;                                             // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminEnvironmentsBPS__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminEnvironmentsBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzEnv>                      Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminEnvironmentsBPF__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminEnvironmentsBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminEnvironmentsBP__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminEnvironmentsBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzEnv>                      Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminDevelopersBPS__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminDevelopersBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzDeveloper>                Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminDevelopersBPF__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminDevelopersBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminDevelopersBP__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminDevelopersBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzDeveloper>                Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesperaccBPS__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminCountresourcesperaccBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzAdminCountResoucesPerAccountOut> Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesperaccBPF__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminCountresourcesperaccBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesperaccBP__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminCountresourcesperaccBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzAdminCountResoucesPerAccountOut> Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesBPS__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminCountresourcesBPS__DelegateSignature_Params
{
public:
	int32                                        Result;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesBPF__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminCountresourcesBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminCountresourcesBP__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminCountresourcesBP__DelegateSignature_Params
{
public:
	int32                                        Result;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D04[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Error;                                             // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminAccountsBPS__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminAccountsBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzAccount>                  Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminAccountsBPF__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminAccountsBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAdmin.DelegateAdminAccountsBP__DelegateSignature
struct UZeuzApiAdmin_DelegateAdminAccountsBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzAccount>                  Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x118 (0x118 - 0x0)
// Function Zeuzsdk.ZeuzApiAdmin.AdminStatsBP
struct UZeuzApiAdmin_AdminStatsBP_Params
{
public:
	struct FZeuzAdminStatsIn                     In;                                                // 0x0(0x50)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x60(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x70(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x80(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAdmin.AdminProjectsBP
struct UZeuzApiAdmin_AdminProjectsBP_Params
{
public:
	struct FZeuzAdminAccountIn                   In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x108 (0x108 - 0x0)
// Function Zeuzsdk.ZeuzApiAdmin.AdminLogsBP
struct UZeuzApiAdmin_AdminLogsBP_Params
{
public:
	struct FZeuzAdminLogsIn                      In;                                                // 0x0(0x40)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x60(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x70(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiAdmin.AdminItemsBP
struct UZeuzApiAdmin_AdminItemsBP_Params
{
public:
	struct FZeuzAdminItemsIn                     In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAdmin.AdminGetquotaBP
struct UZeuzApiAdmin_AdminGetquotaBP_Params
{
public:
	struct FZeuzAdminTestpoolIn                  In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAdmin.AdminEnvironmentsBP
struct UZeuzApiAdmin_AdminEnvironmentsBP_Params
{
public:
	struct FZeuzAdminEnvIn                       In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAdmin.AdminDevelopersBP
struct UZeuzApiAdmin_AdminDevelopersBP_Params
{
public:
	struct FZeuzAdminAccountIn                   In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAdmin.AdminCountresourcesperaccBP
struct UZeuzApiAdmin_AdminCountresourcesperaccBP_Params
{
public:
	struct FZeuzAdminTestpoolIn                  In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// Function Zeuzsdk.ZeuzApiAdmin.AdminCountresourcesBP
struct UZeuzApiAdmin_AdminCountresourcesBP_Params
{
public:
	struct FZeuzAdminCountResoucesIn             In;                                                // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x18(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x28(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x38(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x48(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD0 (0xD0 - 0x0)
// Function Zeuzsdk.ZeuzApiAdmin.AdminAccountsBP
struct UZeuzApiAdmin_AdminAccountsBP_Params
{
public:
	struct FZeuzAdminAccountsIn                  In;                                                // 0x0(0x1)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_D82[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FDelegateProperty_                           Callback;                                          // 0x4(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x14(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x24(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_D84[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FZeuzContext                          Ctx;                                               // 0x38(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x168 (0x168 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationUpdateBPS__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationUpdateBPS__DelegateSignature_Params
{
public:
	struct FZeuzAllocationInfo                   Result;                                            // 0x0(0x168)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationUpdateBPF__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationUpdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x178 (0x178 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationUpdateBP__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationUpdateBP__DelegateSignature_Params
{
public:
	struct FZeuzAllocationInfo                   Result;                                            // 0x0(0x168)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x168(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationRequestServicesBPS__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationRequestServicesBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzAllocationPayloadInfo>    Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationRequestServicesBPF__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationRequestServicesBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationRequestServicesBP__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationRequestServicesBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzAllocationPayloadInfo>    Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationGetBPS__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationGetBPS__DelegateSignature_Params
{
public:
	struct FZeuzAllocationGetOut                 Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationGetBPF__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationGetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationGetBP__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationGetBP__DelegateSignature_Params
{
public:
	struct FZeuzAllocationGetOut                 Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x18(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x168 (0x168 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationCreateBPS__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationCreateBPS__DelegateSignature_Params
{
public:
	struct FZeuzAllocationInfo                   Result;                                            // 0x0(0x168)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationCreateBPF__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationCreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x178 (0x178 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAllocation.DelegateAllocationCreateBP__DelegateSignature
struct UZeuzApiAllocation_DelegateAllocationCreateBP__DelegateSignature_Params
{
public:
	struct FZeuzAllocationInfo                   Result;                                            // 0x0(0x168)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x168(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1F8 (0x1F8 - 0x0)
// Function Zeuzsdk.ZeuzApiAllocation.AllocationUpdateBP
struct UZeuzApiAllocation_AllocationUpdateBP_Params
{
public:
	struct FZeuzAllocationUpdateIn               In;                                                // 0x0(0x130)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x130(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x140(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x150(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x160(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// Function Zeuzsdk.ZeuzApiAllocation.AllocationRequestServicesBP
struct UZeuzApiAllocation_AllocationRequestServicesBP_Params
{
public:
	struct FZeuzAllocationRequestServiceIn       In;                                                // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x28(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x58(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x128 (0x128 - 0x0)
// Function Zeuzsdk.ZeuzApiAllocation.AllocationGetBP
struct UZeuzApiAllocation_AllocationGetBP_Params
{
public:
	struct FZeuzAllocationGetIn                  In;                                                // 0x0(0x60)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x60(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x70(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x80(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x90(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x200 (0x200 - 0x0)
// Function Zeuzsdk.ZeuzApiAllocation.AllocationCreateBP
struct UZeuzApiAllocation_AllocationCreateBP_Params
{
public:
	struct FZeuzAllocationCreateIn               In;                                                // 0x0(0x138)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x138(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x148(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x158(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x168(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyUpdateBPS__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyUpdateBPS__DelegateSignature_Params
{
public:
	struct FZeuzAPIKey                           Result;                                            // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyUpdateBPF__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyUpdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyUpdateBP__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyUpdateBP__DelegateSignature_Params
{
public:
	struct FZeuzAPIKey                           Result;                                            // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xE0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeySetpwhashBPS__DelegateSignature
struct UZeuzApiApikey_DelegateApikeySetpwhashBPS__DelegateSignature_Params
{
public:
	struct FZeuzAPIKey                           Result;                                            // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeySetpwhashBPF__DelegateSignature
struct UZeuzApiApikey_DelegateApikeySetpwhashBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeySetpwhashBP__DelegateSignature
struct UZeuzApiApikey_DelegateApikeySetpwhashBP__DelegateSignature_Params
{
public:
	struct FZeuzAPIKey                           Result;                                            // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xE0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyRevokeBPF__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyRevokeBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyRevokeBP__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyRevokeBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetBPS__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyGetBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzAPIKey>                   Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetBPF__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyGetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetBP__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyGetBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzAPIKey>                   Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetallBPS__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyGetallBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzAPIKey>                   Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetallBPF__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyGetallBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyGetallBP__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyGetallBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzAPIKey>                   Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyGenerateBPS__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyGenerateBPS__DelegateSignature_Params
{
public:
	struct FZeuzAPIKey                           Result;                                            // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyGenerateBPF__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyGenerateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyGenerateBP__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyGenerateBP__DelegateSignature_Params
{
public:
	struct FZeuzAPIKey                           Result;                                            // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xE0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyDeleteBPF__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyDeleteBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyDeleteBP__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyDeleteBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyCreateBPS__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyCreateBPS__DelegateSignature_Params
{
public:
	struct FZeuzAPIKey                           Result;                                            // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyCreateBPF__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyCreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiApikey.DelegateApikeyCreateBP__DelegateSignature
struct UZeuzApiApikey_DelegateApikeyCreateBP__DelegateSignature_Params
{
public:
	struct FZeuzAPIKey                           Result;                                            // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xE0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1A8 (0x1A8 - 0x0)
// Function Zeuzsdk.ZeuzApiApikey.ApikeyUpdateBP
struct UZeuzApiApikey_ApikeyUpdateBP_Params
{
public:
	struct FZeuzAPIKey                           In;                                                // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xE0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xF0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x100(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x110(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xF8 (0xF8 - 0x0)
// Function Zeuzsdk.ZeuzApiApikey.ApikeySetpwhashBP
struct UZeuzApiApikey_ApikeySetpwhashBP_Params
{
public:
	struct FZeuzAPIKeyPwHashIn                   In;                                                // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x60(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiApikey.ApikeyRevokeBP
struct UZeuzApiApikey_ApikeyRevokeBP_Params
{
public:
	struct FZeuzAPIKeyDeleteIn                   In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiApikey.ApikeyGetBP
struct UZeuzApiApikey_ApikeyGetBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// Function Zeuzsdk.ZeuzApiApikey.ApikeyGetallBP
struct UZeuzApiApikey_ApikeyGetallBP_Params
{
public:
	struct FZeuzAPIKeyGetIn                      In;                                                // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x28(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x58(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiApikey.ApikeyGenerateBP
struct UZeuzApiApikey_ApikeyGenerateBP_Params
{
public:
	struct FZeuzAPIKeyGenerateIn                 In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiApikey.ApikeyDeleteBP
struct UZeuzApiApikey_ApikeyDeleteBP_Params
{
public:
	struct FZeuzAPIKeyDeleteIn                   In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x1A8 (0x1A8 - 0x0)
// Function Zeuzsdk.ZeuzApiApikey.ApikeyCreateBP
struct UZeuzApiApikey_ApikeyCreateBP_Params
{
public:
	struct FZeuzAPIKey                           In;                                                // 0x0(0xE0)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xE0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xF0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x100(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x110(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthSessiondelBPF__DelegateSignature
struct UZeuzApiAuth_DelegateAuthSessiondelBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthSessiondelBP__DelegateSignature
struct UZeuzApiAuth_DelegateAuthSessiondelBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthLogoutBPF__DelegateSignature
struct UZeuzApiAuth_DelegateAuthLogoutBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthLogoutBP__DelegateSignature
struct UZeuzApiAuth_DelegateAuthLogoutBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthLoginBPS__DelegateSignature
struct UZeuzApiAuth_DelegateAuthLoginBPS__DelegateSignature_Params
{
public:
	struct FZeuzAuthLoginResult                  Result;                                            // 0x0(0x68)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthLoginBPF__DelegateSignature
struct UZeuzApiAuth_DelegateAuthLoginBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthLoginBP__DelegateSignature
struct UZeuzApiAuth_DelegateAuthLoginBP__DelegateSignature_Params
{
public:
	struct FZeuzAuthLoginResult                  Result;                                            // 0x0(0x68)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x68(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthCheckBPS__DelegateSignature
struct UZeuzApiAuth_DelegateAuthCheckBPS__DelegateSignature_Params
{
public:
	struct FZeuzTimestamp                        Result;                                            // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthCheckBPF__DelegateSignature
struct UZeuzApiAuth_DelegateAuthCheckBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthCheckBP__DelegateSignature
struct UZeuzApiAuth_DelegateAuthCheckBP__DelegateSignature_Params
{
public:
	struct FZeuzTimestamp                        Result;                                            // 0x0(0x8)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthActivesessionsgetBPS__DelegateSignature
struct UZeuzApiAuth_DelegateAuthActivesessionsgetBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzSession>                  Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthActivesessionsgetBPF__DelegateSignature
struct UZeuzApiAuth_DelegateAuthActivesessionsgetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiAuth.DelegateAuthActivesessionsgetBP__DelegateSignature
struct UZeuzApiAuth_DelegateAuthActivesessionsgetBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzSession>                  Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAuth.AuthSessiondelBP
struct UZeuzApiAuth_AuthSessiondelBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAuth.AuthLogoutBP
struct UZeuzApiAuth_AuthLogoutBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x108 (0x108 - 0x0)
// Function Zeuzsdk.ZeuzApiAuth.AuthLoginBP
struct UZeuzApiAuth_AuthLoginBP_Params
{
public:
	struct FZeuzAuthLoginIn                      In;                                                // 0x0(0x40)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x60(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x70(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAuth.AuthCheckBP
struct UZeuzApiAuth_AuthCheckBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiAuth.AuthActivesessionsgetBP
struct UZeuzApiAuth_AuthActivesessionsgetBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiEcho.Echo4BP
struct UZeuzApiEcho_Echo4BP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD0 (0xD0 - 0x0)
// Function Zeuzsdk.ZeuzApiEcho.Echo3BP
struct UZeuzApiEcho_Echo3BP_Params
{
public:
	struct FZeuzEcho3In                          In;                                                // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x4(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x14(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x24(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_100D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FZeuzContext                          Ctx;                                               // 0x38(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiEcho.Echo2BP
struct UZeuzApiEcho_Echo2BP_Params
{
public:
	struct FZeuzEcho2In                          In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiEcho.Echo1BP
struct UZeuzApiEcho_Echo1BP_Params
{
public:
	struct FZeuzEchoIn                           In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho4BPS__DelegateSignature
struct UZeuzApiEcho_DelegateEcho4BPS__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho4BPF__DelegateSignature
struct UZeuzApiEcho_DelegateEcho4BPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho4BP__DelegateSignature
struct UZeuzApiEcho_DelegateEcho4BP__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho3BPS__DelegateSignature
struct UZeuzApiEcho_DelegateEcho3BPS__DelegateSignature_Params
{
public:
	struct FZeuzEchoOut                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho3BPF__DelegateSignature
struct UZeuzApiEcho_DelegateEcho3BPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho3BP__DelegateSignature
struct UZeuzApiEcho_DelegateEcho3BP__DelegateSignature_Params
{
public:
	struct FZeuzEchoOut                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho2BPS__DelegateSignature
struct UZeuzApiEcho_DelegateEcho2BPS__DelegateSignature_Params
{
public:
	struct FZeuzEcho2Out                         Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho2BPF__DelegateSignature
struct UZeuzApiEcho_DelegateEcho2BPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho2BP__DelegateSignature
struct UZeuzApiEcho_DelegateEcho2BP__DelegateSignature_Params
{
public:
	struct FZeuzEcho2Out                         Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho1BPS__DelegateSignature
struct UZeuzApiEcho_DelegateEcho1BPS__DelegateSignature_Params
{
public:
	struct FZeuzEchoOut                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho1BPF__DelegateSignature
struct UZeuzApiEcho_DelegateEcho1BPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiEcho.DelegateEcho1BP__DelegateSignature
struct UZeuzApiEcho_DelegateEcho1BP__DelegateSignature_Params
{
public:
	struct FZeuzEchoOut                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiImagemanager.ImagemanagerPushFileUrlBP
struct UZeuzApiImagemanager_ImagemanagerPushFileUrlBP_Params
{
public:
	struct FZeuzImageManagerPresignedFileUrlIn   In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiImagemanager.ImagemanagerPushBP
struct UZeuzApiImagemanager_ImagemanagerPushBP_Params
{
public:
	struct FZeuzImageManagerManifest             In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiImagemanager.ImagemanagerPullFileUrlBP
struct UZeuzApiImagemanager_ImagemanagerPullFileUrlBP_Params
{
public:
	struct FZeuzImageManagerPresignedFileUrlIn   In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiImagemanager.ImagemanagerPullBP
struct UZeuzApiImagemanager_ImagemanagerPullBP_Params
{
public:
	struct FZeuzImageManagerPullInput            In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiImagemanager.ImagemanagerPublishBP
struct UZeuzApiImagemanager_ImagemanagerPublishBP_Params
{
public:
	struct FZeuzImageManagerPublishInput         In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// Function Zeuzsdk.ZeuzApiImagemanager.ImagemanagerListBP
struct UZeuzApiImagemanager_ImagemanagerListBP_Params
{
public:
	FDelegateProperty_                           Callback;                                          // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x30(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiImagemanager.ImagemanagerGetpublishstateBP
struct UZeuzApiImagemanager_ImagemanagerGetpublishstateBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// Function Zeuzsdk.ZeuzApiImagemanager.ImagemanagerDiscardBP
struct UZeuzApiImagemanager_ImagemanagerDiscardBP_Params
{
public:
	FDelegateProperty_                           Callback;                                          // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x30(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushFileUrlBPS__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPushFileUrlBPS__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushFileUrlBPF__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPushFileUrlBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushFileUrlBP__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPushFileUrlBP__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushBPS__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPushBPS__DelegateSignature_Params
{
public:
	struct FZeuzImageManagerPushPullOutput       Result;                                            // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushBPF__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPushBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPushBP__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPushBP__DelegateSignature_Params
{
public:
	struct FZeuzImageManagerPushPullOutput       Result;                                            // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x30(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullFileUrlBPS__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPullFileUrlBPS__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullFileUrlBPF__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPullFileUrlBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullFileUrlBP__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPullFileUrlBP__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullBPS__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPullBPS__DelegateSignature_Params
{
public:
	struct FZeuzImageManagerPushPullOutput       Result;                                            // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullBPF__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPullBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPullBP__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPullBP__DelegateSignature_Params
{
public:
	struct FZeuzImageManagerPushPullOutput       Result;                                            // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x30(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPublishBPS__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPublishBPS__DelegateSignature_Params
{
public:
	struct FZeuzImagemanagerPublishState         Result;                                            // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPublishBPF__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPublishBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x90 (0x90 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerPublishBP__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerPublishBP__DelegateSignature_Params
{
public:
	struct FZeuzImagemanagerPublishState         Result;                                            // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x80(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerListBPS__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerListBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzImageManagerListEntry>    Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerListBPF__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerListBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerListBP__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerListBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzImageManagerListEntry>    Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerGetpublishstateBPS__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerGetpublishstateBPS__DelegateSignature_Params
{
public:
	struct FZeuzImagemanagerPublishState         Result;                                            // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerGetpublishstateBPF__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerGetpublishstateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x90 (0x90 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerGetpublishstateBP__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerGetpublishstateBP__DelegateSignature_Params
{
public:
	struct FZeuzImagemanagerPublishState         Result;                                            // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x80(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerDiscardBPF__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerDiscardBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiImagemanager.DelegateImagemanagerDiscardBP__DelegateSignature
struct UZeuzApiImagemanager_DelegateImagemanagerDiscardBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF8 (0xF8 - 0x0)
// Function Zeuzsdk.ZeuzApiKVStore.KVStorePutBP
struct UZeuzApiKVStore_KVStorePutBP_Params
{
public:
	struct FZeuzKVStorePutIn                     In;                                                // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x60(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiKVStore.KVStoreGetBP
struct UZeuzApiKVStore_KVStoreGetBP_Params
{
public:
	struct FZeuzKVStoreKey                       In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiKVStore.KVStoreDelBP
struct UZeuzApiKVStore_KVStoreDelBP_Params
{
public:
	struct FZeuzKVStoreDelIn                     In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiKVStore.DelegateKVStorePutBPF__DelegateSignature
struct UZeuzApiKVStore_DelegateKVStorePutBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiKVStore.DelegateKVStorePutBP__DelegateSignature
struct UZeuzApiKVStore_DelegateKVStorePutBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiKVStore.DelegateKVStoreGetBPS__DelegateSignature
struct UZeuzApiKVStore_DelegateKVStoreGetBPS__DelegateSignature_Params
{
public:
	struct FZeuzKVStoreKVEntry                   Result;                                            // 0x0(0x38)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiKVStore.DelegateKVStoreGetBPF__DelegateSignature
struct UZeuzApiKVStore_DelegateKVStoreGetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiKVStore.DelegateKVStoreGetBP__DelegateSignature
struct UZeuzApiKVStore_DelegateKVStoreGetBP__DelegateSignature_Params
{
public:
	struct FZeuzKVStoreKVEntry                   Result;                                            // 0x0(0x38)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x38(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiKVStore.DelegateKVStoreDelBPF__DelegateSignature
struct UZeuzApiKVStore_DelegateKVStoreDelBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiKVStore.DelegateKVStoreDelBP__DelegateSignature
struct UZeuzApiKVStore_DelegateKVStoreDelBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x160 (0x160 - 0x0)
// Function Zeuzsdk.ZeuzApiLobby.LobbyUserBP
struct UZeuzApiLobby_LobbyUserBP_Params
{
public:
	struct FZeuzLobbyUserIn                      In;                                                // 0x0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x98(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xA8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xB8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xC8(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiLobby.LobbyUpdateBP
struct UZeuzApiLobby_LobbyUpdateBP_Params
{
public:
	struct FZeuzLobbyStateIn                     In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiLobby.LobbyStartBP
struct UZeuzApiLobby_LobbyStartBP_Params
{
public:
	struct FZeuzLobbyStartDestroy                In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// Function Zeuzsdk.ZeuzApiLobby.LobbyRefreshBP
struct UZeuzApiLobby_LobbyRefreshBP_Params
{
public:
	struct FZeuzLobbyRefresh                     In;                                                // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x28(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x58(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x100 (0x100 - 0x0)
// Function Zeuzsdk.ZeuzApiLobby.LobbyQueryBP
struct UZeuzApiLobby_LobbyQueryBP_Params
{
public:
	struct FZeuzLobbyQueryIn                     In;                                                // 0x0(0x38)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x38(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x48(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x68(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xF8 (0xF8 - 0x0)
// Function Zeuzsdk.ZeuzApiLobby.LobbyLeaveBP
struct UZeuzApiLobby_LobbyLeaveBP_Params
{
public:
	struct FZeuzLobbyJoin                        In;                                                // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x60(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x110 (0x110 - 0x0)
// Function Zeuzsdk.ZeuzApiLobby.LobbyKickBP
struct UZeuzApiLobby_LobbyKickBP_Params
{
public:
	struct FZeuzLobbyKick                        In;                                                // 0x0(0x48)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x48(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x78(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xF8 (0xF8 - 0x0)
// Function Zeuzsdk.ZeuzApiLobby.LobbyJoinBP
struct UZeuzApiLobby_LobbyJoinBP_Params
{
public:
	struct FZeuzLobbyJoin                        In;                                                // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x60(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiLobby.LobbyDestroyBP
struct UZeuzApiLobby_LobbyDestroyBP_Params
{
public:
	struct FZeuzLobbyStartDestroy                In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiLobby.LobbyCreateBP
struct UZeuzApiLobby_LobbyCreateBP_Params
{
public:
	struct FZeuzLobbyStateIn                     In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyUserBPS__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyUserBPS__DelegateSignature_Params
{
public:
	struct FZeuzLobbyUsersOut                    Result;                                            // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyUserBPF__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyUserBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyUserBP__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyUserBP__DelegateSignature_Params
{
public:
	struct FZeuzLobbyUsersOut                    Result;                                            // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x78(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyUpdateBPS__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyUpdateBPS__DelegateSignature_Params
{
public:
	struct FZeuzLobbyUsersOut                    Result;                                            // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyUpdateBPF__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyUpdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyUpdateBP__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyUpdateBP__DelegateSignature_Params
{
public:
	struct FZeuzLobbyUsersOut                    Result;                                            // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x78(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyStartBPS__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyStartBPS__DelegateSignature_Params
{
public:
	struct FZeuzLobbyServerConnect               Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyStartBPF__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyStartBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyStartBP__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyStartBP__DelegateSignature_Params
{
public:
	struct FZeuzLobbyServerConnect               Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyRefreshBPS__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyRefreshBPS__DelegateSignature_Params
{
public:
	struct FZeuzLobbyUsersOut                    Result;                                            // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyRefreshBPF__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyRefreshBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyRefreshBP__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyRefreshBP__DelegateSignature_Params
{
public:
	struct FZeuzLobbyUsersOut                    Result;                                            // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x78(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyQueryBPS__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyQueryBPS__DelegateSignature_Params
{
public:
	struct FZeuzLobbyQueryOut                    Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyQueryBPF__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyQueryBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyQueryBP__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyQueryBP__DelegateSignature_Params
{
public:
	struct FZeuzLobbyQueryOut                    Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x18(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyLeaveBPF__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyLeaveBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyLeaveBP__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyLeaveBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyKickBPF__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyKickBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyKickBP__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyKickBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyJoinBPS__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyJoinBPS__DelegateSignature_Params
{
public:
	struct FZeuzLobbyUsersOut                    Result;                                            // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyJoinBPF__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyJoinBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyJoinBP__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyJoinBP__DelegateSignature_Params
{
public:
	struct FZeuzLobbyUsersOut                    Result;                                            // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x78(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyDestroyBPF__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyDestroyBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyDestroyBP__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyDestroyBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x78 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyCreateBPS__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyCreateBPS__DelegateSignature_Params
{
public:
	struct FZeuzLobbyUsersOut                    Result;                                            // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyCreateBPF__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyCreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLobby.DelegateLobbyCreateBP__DelegateSignature
struct UZeuzApiLobby_DelegateLobbyCreateBP__DelegateSignature_Params
{
public:
	struct FZeuzLobbyUsersOut                    Result;                                            // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x78(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x170 (0x170 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityRegionUpdateBP
struct UZeuzApiLocality_LocalityRegionUpdateBP_Params
{
public:
	struct FZeuzRegion                           In;                                                // 0x0(0xA8)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xA8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xB8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xC8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xD8(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityRegionRemoveBP
struct UZeuzApiLocality_LocalityRegionRemoveBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xF8 (0xF8 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityRegionGetBP
struct UZeuzApiLocality_LocalityRegionGetBP_Params
{
public:
	struct FZeuzLocalityRegionGetIn              In;                                                // 0x0(0x30)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x60(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x170 (0x170 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityRegionCreateBP
struct UZeuzApiLocality_LocalityRegionCreateBP_Params
{
public:
	struct FZeuzRegion                           In;                                                // 0x0(0xA8)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xA8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xB8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xC8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xD8(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x178 (0x178 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityProviderUpdateBP
struct UZeuzApiLocality_LocalityProviderUpdateBP_Params
{
public:
	struct FZeuzProvider                         In;                                                // 0x0(0xB0)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xB0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xC0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xD0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xE0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityProviderRemoveBP
struct UZeuzApiLocality_LocalityProviderRemoveBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityProviderGetBP
struct UZeuzApiLocality_LocalityProviderGetBP_Params
{
public:
	struct FZeuzLocalityProviderGetIn            In;                                                // 0x0(0x28)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x28(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x38(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x48(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x58(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x178 (0x178 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityProviderCreateBP
struct UZeuzApiLocality_LocalityProviderCreateBP_Params
{
public:
	struct FZeuzProvider                         In;                                                // 0x0(0xB0)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xB0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xC0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xD0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xE0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x218 (0x218 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityLocationUpdateBP
struct UZeuzApiLocality_LocalityLocationUpdateBP_Params
{
public:
	struct FZeuzLocation                         In;                                                // 0x0(0x150)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x150(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x160(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x170(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x180(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityLocationRemoveBP
struct UZeuzApiLocality_LocalityLocationRemoveBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x118 (0x118 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityLocationGetBP
struct UZeuzApiLocality_LocalityLocationGetBP_Params
{
public:
	struct FZeuzLocalityLocationGetIn            In;                                                // 0x0(0x50)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x50(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x60(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x70(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x80(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x218 (0x218 - 0x0)
// Function Zeuzsdk.ZeuzApiLocality.LocalityLocationCreateBP
struct UZeuzApiLocality_LocalityLocationCreateBP_Params
{
public:
	struct FZeuzLocation                         In;                                                // 0x0(0x150)(Parm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x150(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x160(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x170(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x180(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionUpdateBPS__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityRegionUpdateBPS__DelegateSignature_Params
{
public:
	struct FZeuzRegion                           Result;                                            // 0x0(0xA8)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionUpdateBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityRegionUpdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xB8 (0xB8 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionUpdateBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityRegionUpdateBP__DelegateSignature_Params
{
public:
	struct FZeuzRegion                           Result;                                            // 0x0(0xA8)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xA8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionRemoveBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityRegionRemoveBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionRemoveBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityRegionRemoveBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionGetBPS__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityRegionGetBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzRegion>                   Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionGetBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityRegionGetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionGetBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityRegionGetBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzRegion>                   Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA8 (0xA8 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionCreateBPS__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityRegionCreateBPS__DelegateSignature_Params
{
public:
	struct FZeuzRegion                           Result;                                            // 0x0(0xA8)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionCreateBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityRegionCreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xB8 (0xB8 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityRegionCreateBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityRegionCreateBP__DelegateSignature_Params
{
public:
	struct FZeuzRegion                           Result;                                            // 0x0(0xA8)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xA8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xB0 (0xB0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderUpdateBPS__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityProviderUpdateBPS__DelegateSignature_Params
{
public:
	struct FZeuzProvider                         Result;                                            // 0x0(0xB0)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderUpdateBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityProviderUpdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderUpdateBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityProviderUpdateBP__DelegateSignature_Params
{
public:
	struct FZeuzProvider                         Result;                                            // 0x0(0xB0)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xB0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderRemoveBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityProviderRemoveBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderRemoveBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityProviderRemoveBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderGetBPS__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityProviderGetBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzProvider>                 Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderGetBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityProviderGetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderGetBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityProviderGetBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzProvider>                 Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xB0 (0xB0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderCreateBPS__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityProviderCreateBPS__DelegateSignature_Params
{
public:
	struct FZeuzProvider                         Result;                                            // 0x0(0xB0)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderCreateBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityProviderCreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC0 (0xC0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityProviderCreateBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityProviderCreateBP__DelegateSignature_Params
{
public:
	struct FZeuzProvider                         Result;                                            // 0x0(0xB0)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xB0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x150 (0x150 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationUpdateBPS__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityLocationUpdateBPS__DelegateSignature_Params
{
public:
	struct FZeuzLocation                         Result;                                            // 0x0(0x150)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationUpdateBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityLocationUpdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x160 (0x160 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationUpdateBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityLocationUpdateBP__DelegateSignature_Params
{
public:
	struct FZeuzLocation                         Result;                                            // 0x0(0x150)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x150(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationRemoveBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityLocationRemoveBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationRemoveBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityLocationRemoveBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationGetBPS__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityLocationGetBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzLocation>                 Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationGetBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityLocationGetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationGetBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityLocationGetBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzLocation>                 Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x150 (0x150 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationCreateBPS__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityLocationCreateBPS__DelegateSignature_Params
{
public:
	struct FZeuzLocation                         Result;                                            // 0x0(0x150)(Parm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationCreateBPF__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityLocationCreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x160 (0x160 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLocality.DelegateLocalityLocationCreateBP__DelegateSignature
struct UZeuzApiLocality_DelegateLocalityLocationCreateBP__DelegateSignature_Params
{
public:
	struct FZeuzLocation                         Result;                                            // 0x0(0x150)(Parm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x150(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x138 (0x138 - 0x0)
// Function Zeuzsdk.ZeuzApiLogsearch.LogsearchStartexportBP
struct UZeuzApiLogsearch_LogsearchStartexportBP_Params
{
public:
	struct FZeuzLogsearchAccountIn               In;                                                // 0x0(0x70)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x70(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x80(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x90(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xA0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiLogsearch.LogsearchDownloadexportBP
struct UZeuzApiLogsearch_LogsearchDownloadexportBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiLogsearch.LogsearchCheckexportBP
struct UZeuzApiLogsearch_LogsearchCheckexportBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x138 (0x138 - 0x0)
// Function Zeuzsdk.ZeuzApiLogsearch.LogsearchAccountBP
struct UZeuzApiLogsearch_LogsearchAccountBP_Params
{
public:
	struct FZeuzLogsearchAccountIn               In;                                                // 0x0(0x70)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x70(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x80(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x90(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xA0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchStartexportBPS__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchStartexportBPS__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchStartexportBPF__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchStartexportBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchStartexportBP__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchStartexportBP__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchDownloadexportBPS__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchDownloadexportBPS__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchDownloadexportBPF__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchDownloadexportBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchDownloadexportBP__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchDownloadexportBP__DelegateSignature_Params
{
public:
	class FString                                Result;                                            // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchCheckexportBPS__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchCheckexportBPS__DelegateSignature_Params
{
public:
	struct FZeuzLogsearchLogsStatus              Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchCheckexportBPF__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchCheckexportBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchCheckexportBP__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchCheckexportBP__DelegateSignature_Params
{
public:
	struct FZeuzLogsearchLogsStatus              Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x18(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchAccountBPS__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchAccountBPS__DelegateSignature_Params
{
public:
	struct FZeuzLogsearchAccountOut              Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchAccountBPF__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchAccountBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiLogsearch.DelegateLogsearchAccountBP__DelegateSignature
struct UZeuzApiLogsearch_DelegateLogsearchAccountBP__DelegateSignature_Params
{
public:
	struct FZeuzLogsearchAccountOut              Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x18(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x198 (0x198 - 0x0)
// Function Zeuzsdk.ZeuzApiMachine.MachineUpdateresourceBP
struct UZeuzApiMachine_MachineUpdateresourceBP_Params
{
public:
	struct FZeuzMachineResourceUpdateIn          In;                                                // 0x0(0xD0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xD0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xE0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xF0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x100(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiMachine.MachineSettagsBP
struct UZeuzApiMachine_MachineSettagsBP_Params
{
public:
	TArray<struct FZeuzMachineTagsSetIn>         In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiMachine.MachineResourcedeprovisionBP
struct UZeuzApiMachine_MachineResourcedeprovisionBP_Params
{
public:
	struct FZeuzMachineResourceDeprovisionIn     In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiMachine.MachineGettagsBP
struct UZeuzApiMachine_MachineGettagsBP_Params
{
public:
	TArray<class FString>                        In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x158 (0x158 - 0x0)
// Function Zeuzsdk.ZeuzApiMachine.MachineGetresourcesBP
struct UZeuzApiMachine_MachineGetresourcesBP_Params
{
public:
	struct FZeuzMachineResourceGetIn             In;                                                // 0x0(0x90)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x90(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xA0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xB0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xC0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiMachine.MachineGetinfoBP
struct UZeuzApiMachine_MachineGetinfoBP_Params
{
public:
	TArray<class FString>                        In;                                                // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x150 (0x150 - 0x0)
// Function Zeuzsdk.ZeuzApiMachine.MachineGetBP
struct UZeuzApiMachine_MachineGetBP_Params
{
public:
	struct FZeuzMachineGetIn                     In;                                                // 0x0(0x88)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x88(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x98(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xA8(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xB8(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiMachine.MachineDeallocateBP
struct UZeuzApiMachine_MachineDeallocateBP_Params
{
public:
	struct FZeuzMachineResourceDeallocateIn      In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiMachine.MachineCountresourcesBP
struct UZeuzApiMachine_MachineCountresourcesBP_Params
{
public:
	struct FZeuzMachineResourcesCountIn          In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xE8 (0xE8 - 0x0)
// Function Zeuzsdk.ZeuzApiMachine.MachineAllocateBP
struct UZeuzApiMachine_MachineAllocateBP_Params
{
public:
	struct FZeuzMachineResourceAllocateIn        In;                                                // 0x0(0x20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x40(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x50(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x188 (0x188 - 0x0)
// Function Zeuzsdk.ZeuzApiMachine.MachineAddresourceBP
struct UZeuzApiMachine_MachineAddresourceBP_Params
{
public:
	struct FZeuzMachineResourceDataIn            In;                                                // 0x0(0xC0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xC0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xD0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xE0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xF0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineUpdateresourceBPS__DelegateSignature
struct UZeuzApiMachine_DelegateMachineUpdateresourceBPS__DelegateSignature_Params
{
public:
	struct FZeuzMachineResourceInfo              Result;                                            // 0x0(0xF0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineUpdateresourceBPF__DelegateSignature
struct UZeuzApiMachine_DelegateMachineUpdateresourceBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x100 (0x100 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineUpdateresourceBP__DelegateSignature
struct UZeuzApiMachine_DelegateMachineUpdateresourceBP__DelegateSignature_Params
{
public:
	struct FZeuzMachineResourceInfo              Result;                                            // 0x0(0xF0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xF0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineSettagsBPS__DelegateSignature
struct UZeuzApiMachine_DelegateMachineSettagsBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzMachineTagsSetIn>         Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineSettagsBPF__DelegateSignature
struct UZeuzApiMachine_DelegateMachineSettagsBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineSettagsBP__DelegateSignature
struct UZeuzApiMachine_DelegateMachineSettagsBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzMachineTagsSetIn>         Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineResourcedeprovisionBPF__DelegateSignature
struct UZeuzApiMachine_DelegateMachineResourcedeprovisionBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineResourcedeprovisionBP__DelegateSignature
struct UZeuzApiMachine_DelegateMachineResourcedeprovisionBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGettagsBPS__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGettagsBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzMachineTagsSetIn>         Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGettagsBPF__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGettagsBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGettagsBP__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGettagsBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzMachineTagsSetIn>         Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGetresourcesBPS__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGetresourcesBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzMachineResourceInfo>      Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGetresourcesBPF__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGetresourcesBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGetresourcesBP__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGetresourcesBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzMachineResourceInfo>      Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGetinfoBPS__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGetinfoBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzMachineInfo>              Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGetinfoBPF__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGetinfoBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGetinfoBP__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGetinfoBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzMachineInfo>              Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGetBPS__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGetBPS__DelegateSignature_Params
{
public:
	struct FZeuzMachineGetOut                    Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGetBPF__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGetBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineGetBP__DelegateSignature
struct UZeuzApiMachine_DelegateMachineGetBP__DelegateSignature_Params
{
public:
	struct FZeuzMachineGetOut                    Result;                                            // 0x0(0x18)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x18(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineDeallocateBPS__DelegateSignature
struct UZeuzApiMachine_DelegateMachineDeallocateBPS__DelegateSignature_Params
{
public:
	TArray<class FString>                        Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineDeallocateBPF__DelegateSignature
struct UZeuzApiMachine_DelegateMachineDeallocateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineDeallocateBP__DelegateSignature
struct UZeuzApiMachine_DelegateMachineDeallocateBP__DelegateSignature_Params
{
public:
	TArray<class FString>                        Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineCountresourcesBPS__DelegateSignature
struct UZeuzApiMachine_DelegateMachineCountresourcesBPS__DelegateSignature_Params
{
public:
	int32                                        Result;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineCountresourcesBPF__DelegateSignature
struct UZeuzApiMachine_DelegateMachineCountresourcesBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineCountresourcesBP__DelegateSignature
struct UZeuzApiMachine_DelegateMachineCountresourcesBP__DelegateSignature_Params
{
public:
	int32                                        Result;                                            // 0x0(0x4)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1483[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Error;                                             // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineAllocateBPS__DelegateSignature
struct UZeuzApiMachine_DelegateMachineAllocateBPS__DelegateSignature_Params
{
public:
	TArray<struct FZeuzMachineInfo>              Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineAllocateBPF__DelegateSignature
struct UZeuzApiMachine_DelegateMachineAllocateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineAllocateBP__DelegateSignature
struct UZeuzApiMachine_DelegateMachineAllocateBP__DelegateSignature_Params
{
public:
	TArray<struct FZeuzMachineInfo>              Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xF0 (0xF0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineAddresourceBPS__DelegateSignature
struct UZeuzApiMachine_DelegateMachineAddresourceBPS__DelegateSignature_Params
{
public:
	struct FZeuzMachineResourceInfo              Result;                                            // 0x0(0xF0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineAddresourceBPF__DelegateSignature
struct UZeuzApiMachine_DelegateMachineAddresourceBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x100 (0x100 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMachine.DelegateMachineAddresourceBP__DelegateSignature
struct UZeuzApiMachine_DelegateMachineAddresourceBP__DelegateSignature_Params
{
public:
	struct FZeuzMachineResourceInfo              Result;                                            // 0x0(0xF0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xF0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiMatchmaking.MatchmakingUpdateBP
struct UZeuzApiMatchmaking_MatchmakingUpdateBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// Function Zeuzsdk.ZeuzApiMatchmaking.MatchmakingStatsBP
struct UZeuzApiMatchmaking_MatchmakingStatsBP_Params
{
public:
	FDelegateProperty_                           Callback;                                          // 0x0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x30(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x140 (0x140 - 0x0)
// Function Zeuzsdk.ZeuzApiMatchmaking.MatchmakingServerrefreshBP
struct UZeuzApiMatchmaking_MatchmakingServerrefreshBP_Params
{
public:
	struct FZeuzMatchMakingServerInfo            In;                                                // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x88(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x98(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xA8(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x140 (0x140 - 0x0)
// Function Zeuzsdk.ZeuzApiMatchmaking.MatchmakingServerdestroyBP
struct UZeuzApiMatchmaking_MatchmakingServerdestroyBP_Params
{
public:
	struct FZeuzMatchMakingServerInfo            In;                                                // 0x0(0x78)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x88(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x98(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xA8(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x178 (0x178 - 0x0)
// Function Zeuzsdk.ZeuzApiMatchmaking.MatchmakingCreatepartyBP
struct UZeuzApiMatchmaking_MatchmakingCreatepartyBP_Params
{
public:
	struct FZeuzMatchMakingPartyInit             In;                                                // 0x0(0xB0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0xB0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0xC0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xD0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xE0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x148 (0x148 - 0x0)
// Function Zeuzsdk.ZeuzApiMatchmaking.MatchmakingCreateBP
struct UZeuzApiMatchmaking_MatchmakingCreateBP_Params
{
public:
	struct FZeuzMatchMakingInit                  In;                                                // 0x0(0x80)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x80(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x90(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0xA0(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0xB0(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD8 (0xD8 - 0x0)
// Function Zeuzsdk.ZeuzApiMatchmaking.MatchmakingCloseBP
struct UZeuzApiMatchmaking_MatchmakingCloseBP_Params
{
public:
	class FString                                In;                                                // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x10(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x20(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x30(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x40(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0xD0 (0xD0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingUpdateBPS__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingUpdateBPS__DelegateSignature_Params
{
public:
	struct FZeuzMatchMakingStatus                Result;                                            // 0x0(0xD0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingUpdateBPF__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingUpdateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingUpdateBP__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingUpdateBP__DelegateSignature_Params
{
public:
	struct FZeuzMatchMakingStatus                Result;                                            // 0x0(0xD0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xD0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingStatsBPS__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingStatsBPS__DelegateSignature_Params
{
public:
	struct FZeuzMatchMakingStats                 Result;                                            // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingStatsBPF__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingStatsBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingStatsBP__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingStatsBP__DelegateSignature_Params
{
public:
	struct FZeuzMatchMakingStats                 Result;                                            // 0x0(0x4)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_14B0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Error;                                             // 0x8(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingServerrefreshBPF__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingServerrefreshBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingServerrefreshBP__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingServerrefreshBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingServerdestroyBPF__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingServerdestroyBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingServerdestroyBP__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingServerdestroyBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD0 (0xD0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreatepartyBPS__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingCreatepartyBPS__DelegateSignature_Params
{
public:
	struct FZeuzMatchMakingStatus                Result;                                            // 0x0(0xD0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreatepartyBPF__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingCreatepartyBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreatepartyBP__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingCreatepartyBP__DelegateSignature_Params
{
public:
	struct FZeuzMatchMakingStatus                Result;                                            // 0x0(0xD0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xD0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xD0 (0xD0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreateBPS__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingCreateBPS__DelegateSignature_Params
{
public:
	struct FZeuzMatchMakingStatus                Result;                                            // 0x0(0xD0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreateBPF__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingCreateBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xE0 (0xE0 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCreateBP__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingCreateBP__DelegateSignature_Params
{
public:
	struct FZeuzMatchMakingStatus                Result;                                            // 0x0(0xD0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0xD0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCloseBPF__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingCloseBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMatchmaking.DelegateMatchmakingCloseBP__DelegateSignature
struct UZeuzApiMatchmaking_DelegateMatchmakingCloseBP__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiMetrics.MetricsPayloadnetworksentBP
struct UZeuzApiMetrics_MetricsPayloadnetworksentBP_Params
{
public:
	struct FZeuzMetricsQueryIn                   In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiMetrics.MetricsPayloadnetworkreceivedBP
struct UZeuzApiMetrics_MetricsPayloadnetworkreceivedBP_Params
{
public:
	struct FZeuzMetricsQueryIn                   In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiMetrics.MetricsPayloadmemoryusageBP
struct UZeuzApiMetrics_MetricsPayloadmemoryusageBP_Params
{
public:
	struct FZeuzMetricsQueryIn                   In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiMetrics.MetricsPayloadcpuusageBP
struct UZeuzApiMetrics_MetricsPayloadcpuusageBP_Params
{
public:
	struct FZeuzMetricsQueryIn                   In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiMetrics.MetricsPayloadcountBP
struct UZeuzApiMetrics_MetricsPayloadcountBP_Params
{
public:
	struct FZeuzMetricsQueryIn                   In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiMetrics.MetricsMachinenetworksentBP
struct UZeuzApiMetrics_MetricsMachinenetworksentBP_Params
{
public:
	struct FZeuzMetricsQueryIn                   In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiMetrics.MetricsMachinenetworkreceivedBP
struct UZeuzApiMetrics_MetricsMachinenetworkreceivedBP_Params
{
public:
	struct FZeuzMetricsQueryIn                   In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiMetrics.MetricsMachinememoryusageBP
struct UZeuzApiMetrics_MetricsMachinememoryusageBP_Params
{
public:
	struct FZeuzMetricsQueryIn                   In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x120 (0x120 - 0x0)
// Function Zeuzsdk.ZeuzApiMetrics.MetricsMachinecpuusageBP
struct UZeuzApiMetrics_MetricsMachinecpuusageBP_Params
{
public:
	struct FZeuzMetricsQueryIn                   In;                                                // 0x0(0x58)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	FDelegateProperty_                           Callback;                                          // 0x58(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnSuccess;                                         // 0x68(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnFailure;                                         // 0x78(0x10)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FZeuzContext                          Ctx;                                               // 0x88(0x98)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworksentBPS__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadnetworksentBPS__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworksentBPF__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadnetworksentBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworksentBP__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadnetworksentBP__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworkreceivedBPS__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadnetworkreceivedBPS__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworkreceivedBPF__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadnetworkreceivedBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadnetworkreceivedBP__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadnetworkreceivedBP__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadmemoryusageBPS__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadmemoryusageBPS__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadmemoryusageBPF__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadmemoryusageBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadmemoryusageBP__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadmemoryusageBP__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcpuusageBPS__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadcpuusageBPS__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcpuusageBPF__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadcpuusageBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcpuusageBP__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadcpuusageBP__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcountBPS__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadcountBPS__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcountBPF__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadcountBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsPayloadcountBP__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsPayloadcountBP__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworksentBPS__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsMachinenetworksentBPS__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworksentBPF__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsMachinenetworksentBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworksentBP__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsMachinenetworksentBP__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworkreceivedBPS__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsMachinenetworkreceivedBPS__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworkreceivedBPF__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsMachinenetworkreceivedBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinenetworkreceivedBP__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsMachinenetworkreceivedBP__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinememoryusageBPS__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsMachinememoryusageBPS__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinememoryusageBPF__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsMachinememoryusageBPF__DelegateSignature_Params
{
public:
	class FString                                Error;                                             // 0x0(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinememoryusageBP__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsMachinememoryusageBP__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                Error;                                             // 0x10(0x10)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// DelegateFunction Zeuzsdk.ZeuzApiMetrics.DelegateMetricsMachinecpuusageBPS__DelegateSignature
struct UZeuzApiMetrics_DelegateMetricsMachinecpuusageBPS__DelegateSignature_Params
{
public:
	struct FZeuzVariant                          Result;                                            // 0x0(0x10)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

